Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
          <instance name="OCMP3">
            <parameters>
              <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
              <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
              <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 6"/>
              <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 7"/>
            </parameters>
          </instance>
          <instance name="OCMP4">
            <parameters>
              <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
              <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
              <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 6"/>
              <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 7"/>
            </parameters>
          </instance>
        </module>
        <module id="03088" name="PCACHE" version="">
          <instance name="PCACHE">
            <register-group address-space="periph_pb1b" name="PCACHE" name-in-module="PCACHE" offset="0x1f812400"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
        <module id="03337" name="PMU" version="">
          <instance name="PMU">
            <register-group address-space="periph_pb1b" name="PMU" name-in-module="PMU" offset="0x1f813e00"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
        <module id="03337" name="PPS" version="">
          <instance name="PPS">
            <register-group address-space="periph_pb1a" name="PPS" name-in-module="PPS" offset="0x1f801800"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
        <module id="01459" name="PTG" version="">
          <instance name="PTG">
            <register-group address-space="periph_pb1a" name="PTG" name-in-module="PTG" offset="0x1f801c00"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
        <module id="00350" name="RNG" version="">
          <instance name="RNG">
            <register-group address-space="periph_indep_a" name="RNG" name-in-module="RNG" offset="0x1f8e5000"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
        <module id="00748" name="RTCC" version="">
          <instance name="RTCC">
            <register-group address-space="periph_pb4" name="RTCC" name-in-module="RTCC" offset="0x1f870000"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
        <module id="01329" name="SPI" version="">
          <instance name="SPI1">
            <register-group address-space="periph_pb3" name="SPI" name-in-module="SPI" offset="0x1f840c00"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
          <instance name="SPI2">
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
        <module id="00307" name="SQI" version="">
          <instance name="SQI1">
            <register-group address-space="periph_indep_a" name="SQI" name-in-module="SQI" offset="0x1f8e1000"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
        <module id="02141" name="TMR1" version="">
          <instance name="TMR1">
            <register-group address-space="periph_pb1a" name="TMR1" name-in-module="TMR1" offset="0x1f802000"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
        <module id="00745" name="TMR" version="">
          <instance name="TMR2">
            <register-group address-space="periph_pb1a" name="TMR" name-in-module="TMR" offset="0x1f802200"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
          <instance name="TMR3">
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
          <instance name="TMR4">
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
          <instance name="TMR5">
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
          <instance name="TMR6">
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
          <instance name="TMR7">
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
        <module id="02478" name="UART" version="">
          <instance name="UART3">
            <register-group address-space="periph_pb1a" name="UART" name-in-module="UART" offset="0x1f801600"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
          <instance name="UART1">
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
          <instance name="UART2">
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
        <module id="02813" name="USB" version="">
          <instance name="USB1">
            <register-group address-space="periph_pb3" name="USB" name-in-module="USB" offset="0x1f844000"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
        <module id="02674" name="WDT" version="">
          <instance name="WDT">
            <register-group address-space="periph_pb1a" name="WDT" name-in-module="WDT" offset="0x1f800800"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
      </peripherals>
      <interrupts>
        <interrupt caption="Core Timer" index="0" name="CORE_TIMER"/>
        <interrupt caption="Core Software 0" index="1" name="CORE_SOFTWARE_0"/>
        <interrupt caption="Core Software 1" index="2" name="CORE_SOFTWARE_1"/>
        <interrupt caption="Ext INT 0" index="3" name="EXTERNAL_0"/>
        <interrupt caption="Timer1" index="4" name="TIMER_1"/>
        <interrupt caption="Input Capture 1 Error" index="5" name="INPUT_CAPTURE_1_ERROR"/>
        <interrupt caption="Input Capture 1" index="6" name="INPUT_CAPTURE_1"/>
        <interrupt caption="Output Compare 1" index="7" name="OUTPUT_COMPARE_1"/>
        <interrupt caption="Ext INT 1" index="8" name="EXTERNAL_1"/>
        <interrupt caption="Timer2" index="9" name="TIMER_2"/>
        <interrupt caption="Input Capture 2 Error" index="10" name="INPUT_CAPTURE_2_ERROR"/>
        <interrupt caption="Input Capture 2" index="11" name="INPUT_CAPTURE_2"/>
        <interrupt caption="Output Compare 2" index="12" name="OUTPUT_COMPARE_2"/>
        <interrupt caption="Ext INT 2" index="13" name="EXTERNAL_2"/>
        <interrupt caption="Timer3" index="14" name="TIMER_3"/>
        <interrupt caption="Input Capture 3 Error" index="15" name="INPUT_CAPTURE_3_ERROR"/>
        <interrupt caption="Input Capture 3" index="16" name="INPUT_CAPTURE_3"/>
        <interrupt caption="Output Compare 3" index="17" name="OUTPUT_COMPARE_3"/>
        <interrupt caption="Ext INT 3" index="18" name="EXTERNAL_3"/>
        <interrupt caption="Timer4" index="19" name="TIMER_4"/>
        <interrupt caption="Input Capture 4 Error" index="20" name="INPUT_CAPTURE_4_ERROR"/>
        <interrupt caption="Input Capture 4" index="21" name="INPUT_CAPTURE_4"/>
        <interrupt caption="Output Compare 4" index="22" name="OUTPUT_COMPARE_4"/>
        <interrupt caption="Ext INT 4" index="23" name="EXTERNAL_4"/>
        <interrupt caption="Timer5" index="24" name="TIMER_5"/>
        <interrupt caption="Flash Control Event" index="30" name="FLASH_CONTROL"/>
        <interrupt caption="Prefetch Module SEC Event" index="31" name="PREFETCH"/>
        <interrupt caption="PFW CRC event" index="32" name="PFW_CRC"/>
        <interrupt caption="REAL_TIME_CLOCK" index="33" name="RTCC"/>
        <interrupt caption="USB_1" index="34" name="USB"/>
        <interrupt caption="SPI_1_FAULT" index="35" name="SPI1_FAULT"/>
        <interrupt caption="SPI_1_RECEIVE" index="36" name="SPI1_RX"/>
        <interrupt caption="SPI_1_TRANSFER" index="37" name="SPI1_TX"/>
        <interrupt caption="UART_1_FAULT" index="38" name="UART1_FAULT"/>
        <interrupt caption="UART_1_RECEIVE" index="39" name="UART1_RX"/>
        <interrupt caption="UART_1_TRANSFER" index="40" name="UART1_TX"/>
        <interrupt caption="I2C_1_BUS_COLLISION_EVENT" index="41" name="I2C1_BUS"/>
        <interrupt caption="I2C_1_SLAVE_EVENT" index="42" name="I2C1_SLAVE"/>
        <interrupt caption="I2C_1_MASTER_EVENT" index="43" name="I2C1_MASTER"/>
        <interrupt caption="PORT_A_INPUT_CHANGE_INTERRUPT" index="44" name="CHANGE_NOTICE_A"/>
        <interrupt caption="PORT_B_INPUT_CHANGE_INTERRUPT" index="45" name="CHANGE_NOTICE_B"/>
        <interrupt caption="PORT_C_INPUT_CHANGE_INTERRUPT" index="46" name="CHANGE_NOTICE_C"/>
        <interrupt caption="PORT_D_INPUT_CHANGE_INTERRUPT" index="47" name="CHANGE_NOTICE_K"/>
        <interrupt caption="SPI 2 Fault" index="53" name="SPI2_FAULT"/>
        <interrupt caption="SPI 2 Receive Done" index="54" name="SPI2_RX"/>
        <interrupt caption="SPI 2 Transfer Done" index="55" name="SPI2_TX"/>
        <interrupt caption="UART 2 Error" index="56" name="UART2_FAULT"/>
        <interrupt caption="UART 2 Receiver" index="57" name="UART2_RX"/>
        <interrupt caption="UART 2 Transmitter" index="58" name="UART2_TX"/>
        <interrupt caption="I2C 2 Bus Collision Event" index="59" name="I2C2_BUS"/>
        <interrupt caption="I2C 2 Slave Event" index="60" name="I2C2_SLAVE"/>
        <interrupt caption="I2C 2 Master Event" index="61" name="I2C2_MASTER"/>
        <interrupt caption="UART_3_FAULT" index="62" name="UART3_FAULT"/>
        <interrupt caption="UART_3_RECEIVE" index="63" name="UART3_RX"/>
        <interrupt caption="UART_3_TRANSFER" index="64" name="UART3_TX"/>
        <interrupt caption="DMA Channel 0" index="68" name="DMA0"/>
        <interrupt caption="DMA Channel 1" index="69" name="DMA1"/>
        <interrupt caption="DMA Channel 2" index="70" name="DMA2"/>
        <interrupt caption="DMA Channel 3" index="71" name="DMA3"/>
        <interrupt caption="DMA Channel 4" index="72" name="DMA4"/>
        <interrupt caption="DMA Channel 5" index="73" name="DMA5"/>
        <interrupt caption="DMA Channel 6" index="74" name="DMA6"/>
        <interrupt caption="DMA Channel 7" index="75" name="DMA7"/>
        <interrupt caption="Timer 6" index="76" name="TIMER_6"/>
        <interrupt caption="Timer 7" index="80" name="TIMER_7"/>
        <interrupt caption="WiFi SMC Event" index="83" name="RFSMC"/>
        <interrupt caption="WiFi MAC Event" index="84" name="RFMAC"/>
        <interrupt caption="CTR1 EVENT" index="85" name="CTR1_EVENT"/>
        <interrupt caption="WiFi Timer 0 Event" index="86" name="RFTM0"/>
        <interrupt caption="WiFi Timer 1 Event" index="87" name="RFTM1"/>
        <interrupt caption="WiFi Timer 2 Event" index="88" name="RFTM2"/>
        <interrupt caption="WiFi Timer 3 Event" index="89" name="RFTM3"/>
        <interrupt caption="CTR1 Trig out event" index="90" name="CTR1_TRG"/>
        <interrupt caption="WiFi WCOE Event" index="91" name="RFWCOE"/>
        <interrupt caption="ADC global" index="92" name="ADC"/>
        <interrupt caption="ADC Digital Comparator 1" index="94" name="ADC_DC1"/>
        <interrupt caption="ADC Digital Comparator 2" index="95" name="ADC_DC2"/>
        <interrupt caption="ADC Digital Filter 1" index="96" name="ADC_DF1"/>
        <interrupt caption="ADC Digital Filter 2" index="97" name="ADC_DF2"/>
        <interrupt caption="ADC Fault Interrupt" index="100" name="ADC_FAULT"/>
        <interrupt caption="ADC EO Scan" index="101" name="ADC_EOS"/>
        <interrupt caption="ADC Analog Ready" index="102" name="ADC_ARDY"/>
        <interrupt caption="ADC Update Rdy after Suspend" index="103" name="ADC_URDY"/>
        <interrupt caption="ADC 1st Class Buffer Transfer" index="104" name="ADC_DMA"/>
        <interrupt caption="ADC A Data #0" index="106" name="ADC_DATA0"/>
        <interrupt caption="ADC A Data #1" index="107" name="ADC_DATA1"/>
        <interrupt caption="ADC A Data #2" index="108" name="ADC_DATA2"/>
        <interrupt caption="ADC A Data #3" index="109" name="ADC_DATA3"/>
        <interrupt caption="ADC A Data #4" index="110" name="ADC_DATA4"/>
        <interrupt caption="ADC A Data #5" index="111" name="ADC_DATA5"/>
        <interrupt caption="ADC A Data #6" index="112" name="ADC_DATA6"/>
        <interrupt caption="ADC A Data #7" index="113" name="ADC_DATA7"/>
        <interrupt caption="ADC A Data #8" index="114" name="ADC_DATA8"/>
        <interrupt caption="ADC A Data #9" index="115" name="ADC_DATA9"/>
        <interrupt caption="ADC A Data #10" index="116" name="ADC_DATA10"/>
        <interrupt caption="ADC A Data #11" index="117" name="ADC_DATA11"/>
        <interrupt caption="ADC A Data #12" index="118" name="ADC_DATA12"/>
        <interrupt caption="ADC A Data #13" index="119" name="ADC_DATA13"/>
        <interrupt caption="ADC A Data #14" index="120" name="ADC_DATA14"/>
        <interrupt caption="ADC A Data #15" index="121" name="ADC_DATA15"/>
        <interrupt caption="ADC A Data #16" index="122" name="ADC_DATA16"/>
        <interrupt caption="ADC A Data #17" index="123" name="ADC_DATA17"/>
        <interrupt caption="ADC A Data #18" index="124" name="ADC_DATA18"/>
        <interrupt caption="ADC A Data #19" index="125" name="ADC_DATA19"/>
        <interrupt caption="ADC A Data #20" index="126" name="ADC_DATA20"/>
        <interrupt caption="ADC A Data #21" index="127" name="ADC_DATA21"/>
        <interrupt caption="ADC A Data #22" index="128" name="ADC_DATA22"/>
        <interrupt caption="ADC A Data #23" index="129" name="ADC_DATA23"/>
        <interrupt caption="CAN Combined Interrupt" index="142" name="CAN1"/>
        <interrupt caption="CAN2 Receive Interrupt" index="143" name="CAN2_RX"/>
        <interrupt caption="CAN2 Transmit Interrupt" index="144" name="CAN2_TX"/>
        <interrupt caption="CAN2 Misc Interrupt" index="145" name="CAN2_MISC"/>
        <interrupt caption="SQI Event Completion" index="150" name="SQI1"/>
        <interrupt caption="PTG Step Complete" index="152" name="PTG0_STEP"/>
        <interrupt caption="PTG Watchdog Timeout" index="153" name="PTG0_WDT"/>
        <interrupt caption="PTG Int. Trigger 0" index="154" name="PTG0_TRG0"/>
        <interrupt caption="PTG Int. Trigger 1" index="155" name="PTG0_TRG1"/>
        <interrupt caption="PTG Int. Trigger 2" index="156" name="PTG0_TRG2"/>
        <interrupt caption="PTG Int. Trigger 3" index="157" name="PTG0_TRG3"/>
        <interrupt caption="Core perform. counter event" index="162" name="CORE_PERF_COUNT"/>
        <interrupt caption="Fast Debug Channel Event" index="163" name="CORE_FAST_DEBUG_CHAN"/>
        <interrupt caption="Crypto Engine Event" index="164" name="CRYPTO"/>
        <interrupt caption="Ethernet" index="165" name="ETHERNET"/>
        <interrupt caption="Asymmetric Crypto Engine End Event" index="166" name="CRYPTO1"/>
        <interrupt caption="Asymmetric Crypto Engine Error Event" index="167" name="CRYPTO1_FAULT"/>
        <interrupt caption="cvd event" index="168" name="CVD_EVENT"/>
      </interrupts>
      <interfaces>
        <interface name="JTAG" type="samjtag"/>
        <interface name="SWD" type="swd"/>
      </interfaces>
    </device>
  </devices>
  <modules>
    <module caption="" id="02508" name="ADCHS" version="">
      <register-group name="ADCHS">
        <register caption="ADC Control Register 1" name="ADCCON1" offset="0x0" rw="RW" size="4">
          <bitfield caption="DMA to System RAM Buffer Length Size bits" mask="0x00000007" name="DMABL" values="ADCCON1__DMABL" />
          <bitfield caption="Scan Trigger High Level/Positive Edge Sensitivity bit" mask="0x00000008" name="STRGLVL" values="ADCCON1__STRGLVL"/>
          <bitfield caption="Interrupt Vector Shift bits" mask="0x00000070" name="IRQVS" values="ADCCON1__IRQVS"/>
          <bitfield mask="0x00000100" name="SCANEN"/>
          <bitfield mask="0x00000200" name="FSYUPB"/>
          <bitfield mask="0x00000400" name="FSYDMA"/>
          <bitfield caption="Capacitive Voltage Division Enable bit" mask="0x00000800" name="CVDEN" values="ADCCON1__CVDEN"/>
          <bitfield caption="Analog Input Charge Pump Enable bit - see datasheet" mask="0x00001000" name="AICPMPEN" values="ADCCON1__AICPMPEN"/>
          <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="ADCCON1__SIDL"/>
          <bitfield caption="ADC Module Enable bit" mask="0x00008000" name="ON" values="ADCCON1__ON"/>
          <bitfield caption="Scan Trigger Source Select bits" mask="0x001F0000" name="STRGSRC" values="ADCCON1__STRGSRC"/>
          <bitfield caption="Shared ADC Resolution bits" mask="0x00600000" name="SELRES" values="ADCCON1__SELRES"/>
          <bitfield caption="Fractional Data Output Format bit" mask="0x00800000" name="FRACT" values="ADCCON1__FRACT"/>
          <bitfield caption="Turbo Slave ADCx bits" mask="0x07000000" name="TRBSLV" values="ADCCON1__TRBSLV"/>
          <bitfield caption="Turbo Master ADCx bits" mask="0x38000000" name="TRBMST" values="ADCCON1__TRBMST"/>
          <bitfield caption="Turbo Channel Error Status bit" mask="0x40000000" name="TRBERR" values="ADCCON1__TRBERR"/>
          <bitfield caption="Turbo Channel Enable bit" mask="0x80000000" name="TRBEN" values="ADCCON1__TRBEN"/>
        </register>
        <register caption="ADC Control Register 2" name="ADCCON2" offset="0x10" rw="RW" size="4">
          <bitfield caption="Shared ADC Clock Divider bits" mask="0x0000007F" name="ADCDIV" values="ADCCON2__ADCDIV"/>
          <bitfield caption="Shared ADC Early Interrupt Select bits" mask="0x00000700" name="ADCEIS" values="ADCCON2__ADCEIS"/>
          <bitfield mask="0x00000800" name="ENXCNVRT"/>
          <bitfield caption="Early Interrupt Request Override bit" mask="0x00001000" name="ADCEIOVR" values="ADCCON2__ADCEIOVR"/>
          <bitfield caption="End of Scan Interrupt Enable bit" mask="0x00002000" name="EOSIEN" values="ADCCON2__EOSIEN"/>
          <bitfield caption="Band Gap/VREF Voltage Fault Interrupt Enable bit" mask="0x00004000" name="REFFLTIEN" values="ADCCON2__REFFLTIEN"/>
          <bitfield caption="Band Gap/VREF Voltage Ready Interrupt Enable bit" mask="0x00008000" name="BGVRIEN" values="ADCCON2__BGVRIEN"/>
          <bitfield caption="Sample Time for the Shared ADC bits" mask="0x03FF0000" name="SAMC" values="ADCCON2__SAMC"/>
          <bitfield caption="Capacitor Voltage Divider Setting bit" mask="0x1C000000" name="CVDCPL" values="ADCCON2__CVDCPL"/>
          <bitfield caption="End of Scan Interrupt Status bit" mask="0x20000000" name="EOSRDY" values="ADCCON2__EOSRDY"/>
          <bitfield caption="Band Gap/ Vref / AVdd BOR Fault Status bit" mask="0x40000000" name="REFFLT" values="ADCCON2__REFFLT"/>
          <bitfield caption="Band Gap Voltage/ADC Reference Voltage Status bit" mask="0x80000000" name="BGVRRDY" values="ADCCON2__BGVRRDY"/>
        </register>
