Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
      <value-group caption="Interrupt Vector Shift bits" name="ADCCON1__IRQVS">
        <value caption="Shift x left 7 bit position" name="" value="0x7"/>
        <value caption="Shift x left 6 bit position" name="" value="0x6"/>
        <value caption="Shift x left 5 bit position" name="" value="0x5"/>
        <value caption="Shift x left 4 bit position" name="" value="0x4"/>
        <value caption="Shift x left 3 bit position" name="" value="0x3"/>
        <value caption="Shift x left 2 bit position" name="" value="0x2"/>
        <value caption="Shift x left 1 bit position" name="" value="0x1"/>
        <value caption="Shift x left 0 bit position" name="" value="0x0"/>
      </value-group>
      <value-group caption="Capacitive Voltage Division Enable bit" name="ADCCON1__CVDEN">
        <value caption="CVD operation is enabled" name="" value="0x1"/>
        <value caption="CVD operation is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Input Charge Pump Enable bit - see datasheet" name="ADCCON1__AICPMPEN">
        <value caption="Analog input charge pump is enabled (default)" name="" value="0x1"/>
        <value caption="Analog input charge pump is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="ADCCON1__SIDL">
        <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1"/>
        <value caption="Continue module operation in Idle mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Module Enable bit" name="ADCCON1__ON">
        <value caption="ADC module is enabled" name="" value="0x1"/>
        <value caption="ADC module is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Scan Trigger Source Select bits" name="ADCCON1__STRGSRC">
        <value caption="External Trigger for Validation" name="" value="0x1f"/>
        <value caption="PTG Trigger Out 15" name="" value="0x17"/>
        <value caption="PTG Trigger Out 14" name="" value="0x16"/>
        <value caption="PTG Trigger Out 13" name="" value="0x15"/>
        <value caption="PTG Trigger Out 12" name="" value="0x14"/>
        <value caption="Output Compare 4 period end" name="" value="0x12"/>
        <value caption="Output Compare 3 period end" name="" value="0x11"/>
        <value caption="Output Compare 2 period end" name="" value="0x10"/>
        <value caption="Output Compare 1 period end" name="" value="0x9"/>
        <value caption="General Purpose Timer7" name="" value="0x8"/>
        <value caption="General Purpose Timer5" name="" value="0x7"/>
        <value caption="General Purpose Timer3" name="" value="0x6"/>
        <value caption="General Purpose Timer1" name="" value="0x5"/>
        <value caption="INT0" name="" value="0x4"/>
        <value caption="Reserved" name="" value="0x3"/>
        <value caption="Software level trigger" name="" value="0x2"/>
        <value caption="Software edge trigger" name="" value="0x1"/>
        <value caption="No Trigger" name="" value="0x0"/>
      </value-group>
      <value-group caption="Shared ADC Resolution bits" name="ADCCON1__SELRES">
        <value caption="12 bits (default)" name="" value="0x3"/>
        <value caption="10 bits" name="" value="0x2"/>
        <value caption="8 bits" name="" value="0x1"/>
        <value caption="6 bits" name="" value="0x0"/>
      </value-group>
      <value-group caption="Fractional Data Output Format bit" name="ADCCON1__FRACT">
        <value caption="Fractional" name="" value="0x1"/>
        <value caption="Integer" name="" value="0x0"/>
      </value-group>
      <value-group caption="Turbo Slave ADCx bits" name="ADCCON1__TRBSLV">
        <value caption="Reserved" name="" value="0x7"/>
        <value caption="Reserved" name="" value="0x6"/>
        <value caption="Reserved" name="" value="0x5"/>
        <value caption="ADC4 is selected as the Turbo Slave" name="" value="0x4"/>
        <value caption="ADC3 is selected as the Turbo Slave" name="" value="0x3"/>
        <value caption="ADC2 is selected as the Turbo Slave" name="" value="0x2"/>
        <value caption="ADC1 is selected as the Turbo Slave" name="" value="0x1"/>
        <value caption="ADC0 is selected as the Turbo Slave" name="" value="0x0"/>
      </value-group>
      <value-group caption="Turbo Master ADCx bits" name="ADCCON1__TRBMST">
        <value caption="Reserved" name="" value="0x7"/>
        <value caption="Reserved" name="" value="0x6"/>
        <value caption="Reserved" name="" value="0x5"/>
        <value caption="ADC4 is selected as the Turbo Master" name="" value="0x4"/>
        <value caption="ADC3 is selected as the Turbo Master" name="" value="0x3"/>
        <value caption="ADC2 is selected as the Turbo Master" name="" value="0x2"/>
        <value caption="ADC1 is selected as the Turbo Master" name="" value="0x1"/>
        <value caption="ADC0 is selected as the Turbo Master" name="" value="0x0"/>
      </value-group>
      <value-group caption="Turbo Channel Error Status bit" name="ADCCON1__TRBERR">
        <value caption="An error occurred while setting the Turbo channel and Turbo channel function to be disabled regardless of the TRBEN bit being set to 1." name="" value="0x1"/>
        <value caption="Turbo channel error did not occur" name="" value="0x0"/>
      </value-group>
      <value-group caption="Turbo Channel Enable bit" name="ADCCON1__TRBEN">
        <value caption="Enable the Turbo channel" name="" value="0x1"/>
        <value caption="Disable the Turbo channel" name="" value="0x0"/>
      </value-group>
      <value-group caption="Shared ADC Clock Divider bits" name="ADCCON2__ADCDIV">
        <value caption="254 * Tq = Tad7" name="" value="0x7f"/>
        <value caption="6 * Tq = Tad7" name="" value="0x3"/>
        <value caption="4 * Tq = Tad7" name="" value="0x2"/>
        <value caption="2 * Tq = Tad7" name="" value="0x1"/>
        <value caption="Reserved" name="" value="0x0"/>
      </value-group>
      <value-group caption="Shared ADC Early Interrupt Select bits" name="ADCCON2__ADCEIS">
        <value caption="The data ready interrupt is generated 8 ADC clocks prior to end of conversion" name="" value="0x7"/>
        <value caption="The data ready interrupt is generated 7 ADC clocks prior to end of conversion" name="" value="0x6"/>
        <value caption="The data ready interrupt is generated 2 ADC module clocks prior to end of conversion" name="" value="0x1"/>
        <value caption="The data ready interrupt is generated 1 ADC module clock prior to end of conversion" name="" value="0x0"/>
      </value-group>
