Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
      <value-group caption="ADC Global Interrupt Enable bits for analog input 15" name="ADCGIRQEN1__AGIEN15">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 16" name="ADCGIRQEN1__AGIEN16">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 17" name="ADCGIRQEN1__AGIEN17">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 18" name="ADCGIRQEN1__AGIEN18">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 19" name="ADCGIRQEN1__AGIEN19">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 0" name="ADCCSS1__CSS0">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 1" name="ADCCSS1__CSS1">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 2" name="ADCCSS1__CSS2">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 3" name="ADCCSS1__CSS3">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 4" name="ADCCSS1__CSS4">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 5" name="ADCCSS1__CSS5">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 6" name="ADCCSS1__CSS6">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 7" name="ADCCSS1__CSS7">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 8" name="ADCCSS1__CSS8">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 9" name="ADCCSS1__CSS9">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 10" name="ADCCSS1__CSS10">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 11" name="ADCCSS1__CSS11">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 12" name="ADCCSS1__CSS12">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 13" name="ADCCSS1__CSS13">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 14" name="ADCCSS1__CSS14">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 15" name="ADCCSS1__CSS15">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 16" name="ADCCSS1__CSS16">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
