Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
      <value-group caption="Filter Significant Data Length bit" name="ADCFLTR2__DATA16EN">
        <value caption="All 16 bits of the filter output data are significant" name="" value="0x1"/>
        <value caption="Only the first 12 bits are significant" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Filter x Enable bit" name="ADCFLTR2__AFEN">
        <value caption="Digital filter is enabled" name="" value="0x1"/>
        <value caption="Digital filter is disabled and the AFRDY status bit is cleared" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Source for Conversion of ADC0 Module Select bits" name="ADCTRG1__TRGSRC0">
        <value caption="External Trigger for Validation" name="" value="0x1f"/>
        <value caption="PTG Trigger Out 15" name="" value="0x17"/>
        <value caption="PTG Trigger Out 14" name="" value="0x16"/>
        <value caption="PTG Trigger Out 13" name="" value="0x15"/>
        <value caption="PTG Trigger Out 12" name="" value="0x14"/>
        <value caption="Output Compare 4 period end" name="" value="0x12"/>
        <value caption="Output Compare 3 period end" name="" value="0x11"/>
        <value caption="Output Compare 2 period end" name="" value="0x10"/>
        <value caption="Output Compare 1 period end" name="" value="0x9"/>
        <value caption="General Purpose Timer7" name="" value="0x8"/>
        <value caption="General Purpose Timer5" name="" value="0x7"/>
        <value caption="General Purpose Timer3" name="" value="0x6"/>
        <value caption="General Purpose Timer1" name="" value="0x5"/>
        <value caption="INT0" name="" value="0x4"/>
        <value caption="Scan trigger (see Note)" name="" value="0x3"/>
        <value caption="Software level trigger" name="" value="0x2"/>
        <value caption="Software edge trigger" name="" value="0x1"/>
        <value caption="No Trigger" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN1 Select bits" name="ADCTRG1__TRGSRC1">
        <value caption="External Trigger for Validation" name="" value="0x1f"/>
        <value caption="PTG Trigger Out 15" name="" value="0x17"/>
        <value caption="PTG Trigger Out 14" name="" value="0x16"/>
        <value caption="PTG Trigger Out 13" name="" value="0x15"/>
        <value caption="PTG Trigger Out 12" name="" value="0x14"/>
        <value caption="Output Compare 4 period end" name="" value="0x12"/>
        <value caption="Output Compare 3 period end" name="" value="0x11"/>
        <value caption="Output Compare 2 period end" name="" value="0x10"/>
        <value caption="Output Compare 1 period end" name="" value="0x9"/>
        <value caption="General Purpose Timer7" name="" value="0x8"/>
        <value caption="General Purpose Timer5" name="" value="0x7"/>
        <value caption="General Purpose Timer3" name="" value="0x6"/>
        <value caption="General Purpose Timer1" name="" value="0x5"/>
        <value caption="INT0" name="" value="0x4"/>
        <value caption="Scan trigger (see Note)" name="" value="0x3"/>
        <value caption="Software level trigger" name="" value="0x2"/>
        <value caption="Software edge trigger" name="" value="0x1"/>
        <value caption="No Trigger" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN2 Select bits" name="ADCTRG1__TRGSRC2">
        <value caption="External Trigger for Validation" name="" value="0x1f"/>
        <value caption="PTG Trigger Out 15" name="" value="0x17"/>
        <value caption="PTG Trigger Out 14" name="" value="0x16"/>
        <value caption="PTG Trigger Out 13" name="" value="0x15"/>
        <value caption="PTG Trigger Out 12" name="" value="0x14"/>
        <value caption="Output Compare 4 period end" name="" value="0x12"/>
        <value caption="Output Compare 3 period end" name="" value="0x11"/>
        <value caption="Output Compare 2 period end" name="" value="0x10"/>
        <value caption="Output Compare 1 period end" name="" value="0x9"/>
        <value caption="General Purpose Timer7" name="" value="0x8"/>
        <value caption="General Purpose Timer5" name="" value="0x7"/>
        <value caption="General Purpose Timer3" name="" value="0x6"/>
        <value caption="General Purpose Timer1" name="" value="0x5"/>
        <value caption="INT0" name="" value="0x4"/>
        <value caption="Scan trigger (see Note)" name="" value="0x3"/>
        <value caption="Software level trigger" name="" value="0x2"/>
        <value caption="Software edge trigger" name="" value="0x1"/>
        <value caption="No Trigger" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN3 Select bits" name="ADCTRG1__TRGSRC3">
        <value caption="External Trigger for Validation" name="" value="0x1f"/>
        <value caption="PTG Trigger Out 15" name="" value="0x17"/>
        <value caption="PTG Trigger Out 14" name="" value="0x16"/>
        <value caption="PTG Trigger Out 13" name="" value="0x15"/>
        <value caption="PTG Trigger Out 12" name="" value="0x14"/>
        <value caption="Output Compare 4 period end" name="" value="0x12"/>
        <value caption="Output Compare 3 period end" name="" value="0x11"/>
        <value caption="Output Compare 2 period end" name="" value="0x10"/>
        <value caption="Output Compare 1 period end" name="" value="0x9"/>
        <value caption="General Purpose Timer7" name="" value="0x8"/>
        <value caption="General Purpose Timer5" name="" value="0x7"/>
        <value caption="General Purpose Timer3" name="" value="0x6"/>
        <value caption="General Purpose Timer1" name="" value="0x5"/>
        <value caption="INT0" name="" value="0x4"/>
        <value caption="Scan trigger (see Note)" name="" value="0x3"/>
        <value caption="Software level trigger" name="" value="0x2"/>
        <value caption="Software edge trigger" name="" value="0x1"/>
        <value caption="No Trigger" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN4 Select bits" name="ADCTRG2__TRGSRC4">
        <value caption="External Trigger for Validation" name="" value="0x1f"/>
        <value caption="PTG Trigger Out 15" name="" value="0x17"/>
        <value caption="PTG Trigger Out 14" name="" value="0x16"/>
        <value caption="PTG Trigger Out 13" name="" value="0x15"/>
        <value caption="PTG Trigger Out 12" name="" value="0x14"/>
        <value caption="Output Compare 4 period end" name="" value="0x12"/>
        <value caption="Output Compare 3 period end" name="" value="0x11"/>
        <value caption="Output Compare 2 period end" name="" value="0x10"/>
        <value caption="Output Compare 1 period end" name="" value="0x9"/>
        <value caption="General Purpose Timer7" name="" value="0x8"/>
        <value caption="General Purpose Timer5" name="" value="0x7"/>
        <value caption="General Purpose Timer3" name="" value="0x6"/>
        <value caption="General Purpose Timer1" name="" value="0x5"/>
        <value caption="INT0" name="" value="0x4"/>
        <value caption="Scan trigger (see Note)" name="" value="0x3"/>
        <value caption="Software level trigger" name="" value="0x2"/>
        <value caption="Software edge trigger" name="" value="0x1"/>
        <value caption="No Trigger" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN5 Select bits" name="ADCTRG2__TRGSRC5">
        <value caption="External Trigger for Validation" name="" value="0x1f"/>
        <value caption="PTG Trigger Out 15" name="" value="0x17"/>
        <value caption="PTG Trigger Out 14" name="" value="0x16"/>
        <value caption="PTG Trigger Out 13" name="" value="0x15"/>
        <value caption="PTG Trigger Out 12" name="" value="0x14"/>
        <value caption="Output Compare 4 period end" name="" value="0x12"/>
        <value caption="Output Compare 3 period end" name="" value="0x11"/>
        <value caption="Output Compare 2 period end" name="" value="0x10"/>
        <value caption="Output Compare 1 period end" name="" value="0x9"/>
        <value caption="General Purpose Timer7" name="" value="0x8"/>
        <value caption="General Purpose Timer5" name="" value="0x7"/>
        <value caption="General Purpose Timer3" name="" value="0x6"/>
        <value caption="General Purpose Timer1" name="" value="0x5"/>
        <value caption="INT0" name="" value="0x4"/>
        <value caption="Scan trigger (see Note)" name="" value="0x3"/>
        <value caption="Software level trigger" name="" value="0x2"/>
        <value caption="Software edge trigger" name="" value="0x1"/>
        <value caption="No Trigger" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN6 Select bits" name="ADCTRG2__TRGSRC6">
        <value caption="External Trigger for Validation" name="" value="0x1f"/>
        <value caption="PTG Trigger Out 15" name="" value="0x17"/>
        <value caption="PTG Trigger Out 14" name="" value="0x16"/>
        <value caption="PTG Trigger Out 13" name="" value="0x15"/>
        <value caption="PTG Trigger Out 12" name="" value="0x14"/>
        <value caption="Output Compare 4 period end" name="" value="0x12"/>
        <value caption="Output Compare 3 period end" name="" value="0x11"/>
        <value caption="Output Compare 2 period end" name="" value="0x10"/>
        <value caption="Output Compare 1 period end" name="" value="0x9"/>
        <value caption="General Purpose Timer7" name="" value="0x8"/>
        <value caption="General Purpose Timer5" name="" value="0x7"/>
        <value caption="General Purpose Timer3" name="" value="0x6"/>
        <value caption="General Purpose Timer1" name="" value="0x5"/>
        <value caption="INT0" name="" value="0x4"/>
        <value caption="Scan trigger (see Note)" name="" value="0x3"/>
        <value caption="Software level trigger" name="" value="0x2"/>
        <value caption="Software edge trigger" name="" value="0x1"/>
        <value caption="No Trigger" name="" value="0x0"/>
      </value-group>
