Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 13" name="ADCEISTAT1__EIRDY13">
        <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 14" name="ADCEISTAT1__EIRDY14">
        <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 15" name="ADCEISTAT1__EIRDY15">
        <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 16" name="ADCEISTAT1__EIRDY16">
        <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 17" name="ADCEISTAT1__EIRDY17">
        <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 18" name="ADCEISTAT1__EIRDY18">
        <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 19" name="ADCEISTAT1__EIRDY19">
        <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC0 Analog and Bias Circuitry Enable bit" name="ADCANCON__ANEN0">
        <value caption="Analog and bias circuitry enabled. Once the analog and bias circuit is enabled" name="" value="0x1"/>
        <value caption="Analog and bias circuitry disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Shared ADC Analog and Bias Circuitry Enable bit" name="ADCANCON__ANEN7">
        <value caption="Analog and bias circuitry enabled. Once the analog and bias circuit is enabled" name="" value="0x1"/>
        <value caption="Analog and bias circuitry disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC 0 Wake-up Status bit" name="ADCANCON__WKRDY0">
        <value caption="ADCx Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANENx to 1" name="" value="0x1"/>
        <value caption="ADCx Analog and Bias circuitry is not ready" name="" value="0x0"/>
      </value-group>
      <value-group caption="Shared ADC Wake-up Status bit" name="ADCANCON__WKRDY7">
        <value caption="ADC7 Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANEN7 to 1" name="" value="0x1"/>
        <value caption="ADC7 Analog and Bias circuitry is not ready" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC 0 Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN0">
        <value caption="Enable interrupt and generate interrupt when the WKRDYx status bit is set" name="" value="0x1"/>
        <value caption="Disable interrupt" name="" value="0x0"/>
      </value-group>
      <value-group caption="Shared ADC Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN7">
        <value caption="Enable interrupt and generate interrupt when the WKRDY7 status bit is set" name="" value="0x1"/>
        <value caption="Disable interrupt" name="" value="0x0"/>
      </value-group>
      <value-group caption="Wake-up Clock Count bits" name="ADCANCON__WKUPCLKCNT">
        <value caption="32" name="" value="0xf"/>
        <value caption="64 clocks" name="" value="0x6"/>
        <value caption="32 clocks" name="" value="0x5"/>
        <value caption="16 clocks" name="" value="0x4"/>
        <value caption="16 clocks" name="" value="0x3"/>
        <value caption="16 clocks" name="" value="0x2"/>
        <value caption="16 clocks" name="" value="0x1"/>
        <value caption="16 clocks" name="" value="0x0"/>
      </value-group>
    </module>
    <module caption="" id="01152" name="CAN" version="1">
      <register-group name="CAN">
        <register caption="CAN Module Control Register" name="C1CON" offset="0x0" rw="RW" size="4">
          <bitfield caption="Device Net Filter Bit Number bits" mask="0x0000001F" name="DNCNT" values="C1CON__DNCNT"/>
          <bitfield caption="CAN Module is Busy bit" mask="0x00000800" name="CANBUSY" values="C1CON__CANBUSY"/>
          <bitfield mask="0x00002000" name="SIDL"/>
          <bitfield caption="CAN On bit" mask="0x00008000" name="ON" values="C1CON__ON"/>
          <bitfield caption="CAN Message Receive Time Stamp Timer Capture Enable bit" mask="0x00010000" name="CANCAP" values="C1CON__CANCAP"/>
          <bitfield caption="Operation Mode Status bits" mask="0x00E00000" name="OPMOD" values="C1CON__OPMOD"/>
          <bitfield caption="Request Operation Mode bits" mask="0x07000000" name="REQOP" values="C1CON__REQOP"/>
          <bitfield caption="Abort All Pending Transmissions bit" mask="0x08000000" name="ABAT" values="C1CON__ABAT"/>
        </register>
        <register caption="CAN Baud Rate Configuration Register" name="C1CFG" offset="0x10" rw="RW" size="4">
          <bitfield caption="Baud Rate Prescaler bits" mask="0x0000003F" name="BRP" values="C1CFG__BRP"/>
          <bitfield caption="Synchronization Jump Width bits" mask="0x000000C0" name="SJW" values="C1CFG__SJW"/>
          <bitfield caption="Propagation Time Segment bits" mask="0x00000700" name="PRSEG" values="C1CFG__PRSEG"/>
          <bitfield caption="Phase Buffer Segment 1 bits" mask="0x00003800" name="SEG1PH" values="C1CFG__SEG1PH"/>
          <bitfield caption="Sample of the CAN Bus Line bit" mask="0x00004000" name="SAM" values="C1CFG__SAM"/>
          <bitfield caption="Phase Segment 2 Time Select bit" mask="0x00008000" name="SEG2PHTS" values="C1CFG__SEG2PHTS"/>
          <bitfield caption="Phase Buffer Segment 2 bits" mask="0x00070000" name="SEG2PH" values="C1CFG__SEG2PH"/>
          <bitfield caption="CAN Bus Line Filter Enable bit" mask="0x00400000" name="WAKFIL" values="C1CFG__WAKFIL"/>
        </register>
        <register caption="CAN Interrupt Register" name="C1INT" offset="0x20" rw="RW" size="4">
          <bitfield caption="Transmit Buffer Interrupt Flag bit" mask="0x00000001" name="TBIF" values="C1INT__TBIF"/>
          <bitfield caption="Receive Buffer Interrupt Flag bit" mask="0x00000002" name="RBIF" values="C1INT__RBIF"/>
          <bitfield caption="CAN Timer Overflow Interrupt Flag bit" mask="0x00000004" name="CTMRIF" values="C1INT__CTMRIF"/>
          <bitfield caption="CAN Mode Change Interrupt Flag bit" mask="0x00000008" name="MODIF" values="C1INT__MODIF"/>
          <bitfield caption="Receive Buffer Overflow Interrupt Flag bit" mask="0x00000800" name="RBOVIF" values="C1INT__RBOVIF"/>
          <bitfield caption="System Error Interrupt Flag bit" mask="0x00001000" name="SERRIF" values="C1INT__SERRIF"/>
          <bitfield caption="CAN Bus Error Interrupt Flag bit" mask="0x00002000" name="CERRIF" values="C1INT__CERRIF"/>
          <bitfield caption="CAN Bus Activity Wake-up Interrupt Flag bit" mask="0x00004000" name="WAKIF" values="C1INT__WAKIF"/>
          <bitfield caption="Invalid Message Received Interrupt Flag bit" mask="0x00008000" name="IVRIF" values="C1INT__IVRIF"/>
          <bitfield caption="Transmit Buffer Interrupt Enable bit" mask="0x00010000" name="TBIE" values="C1INT__TBIE"/>
          <bitfield caption="Receive Buffer Interrupt Enable bit" mask="0x00020000" name="RBIE" values="C1INT__RBIE"/>
          <bitfield caption="CAN Timestamp Timer Interrupt Enable bit" mask="0x00040000" name="CTMRIE" values="C1INT__CTMRIE"/>
          <bitfield caption="Mode Change Interrupt Enable bit" mask="0x00080000" name="MODIE" values="C1INT__MODIE"/>
          <bitfield caption="Receive Buffer Overflow Interrupt Enable bit" mask="0x08000000" name="RBOVIE" values="C1INT__RBOVIE"/>
          <bitfield caption="System Error Interrupt Enable bit" mask="0x10000000" name="SERRIE" values="C1INT__SERRIE"/>
          <bitfield caption="CAN Bus Error Interrupt Enable bit" mask="0x20000000" name="CERRIE" values="C1INT__CERRIE"/>
          <bitfield caption="CAN Bus Activity Wake-up Interrupt Enable bit" mask="0x40000000" name="WAKIE" values="C1INT__WAKIE"/>
          <bitfield caption="Invalid Message Received Interrupt Enable bit" mask="0x80000000" name="IVRIE" values="C1INT__IVRIE"/>
        </register>
        <register caption="CAN Interrupt Code Register" name="C1VEC" offset="0x30" rw="R" size="4">
          <bitfield caption="Interrupt Flag Code bits" mask="0x0000007F" name="ICODE" values="C1VEC__ICODE"/>
          <bitfield caption="Filter Hit Number bit" mask="0x00001F00" name="FILHIT" values="C1VEC__FILHIT"/>
        </register>
        <register caption="CAN Transmit/Receive Error Count Register" name="C1TREC" offset="0x40" rw="R" size="4">
          <bitfield mask="0x000000FF" name="RERRCNT"/>
          <bitfield mask="0x0000FF00" name="TERRCNT"/>
          <bitfield mask="0x00010000" name="EWARN"/>
          <bitfield mask="0x00020000" name="RXWARN"/>
          <bitfield mask="0x00040000" name="TXWARN"/>
          <bitfield mask="0x00080000" name="RXBP"/>
          <bitfield mask="0x00100000" name="TXBP"/>
          <bitfield mask="0x00200000" name="TXBO"/>
        </register>
        <register caption="CAN FIFO Status Register" name="C1FSTAT" offset="0x50" rw="R" size="4">
          <bitfield caption="FIFOx Interrupt Pending bits" mask="0xFFFFFFFF" name="FIFOIP" values="C1FSTAT__FIFOIP"/>
        </register>
