Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
        <register caption="CAN FIFO Interrupt Register " name="C1FIFOINT11" offset="0x620" rw="RW" size="4">
          <bitfield caption="Receive Buffer Not Empty Interrupt Flag bit" mask="0x00000001" name="RXNEMPTYIF" values="C1FIFOINT11__RXNEMPTYIF"/>
          <bitfield caption="Receive FIFO Half Full Interrupt Flag bit" mask="0x00000002" name="RXHALFIF" values="C1FIFOINT11__RXHALFIF"/>
          <bitfield caption="Receive FIFO Full Interrupt Flag bit" mask="0x00000004" name="RXFULLIF" values="C1FIFOINT11__RXFULLIF"/>
          <bitfield caption="Receive FIFO Overflow Interrupt Flag bit" mask="0x00000008" name="RXOVFLIF" values="C1FIFOINT11__RXOVFLIF"/>
          <bitfield caption="Transmit FIFO Empty Interrupt Flag bit" mask="0x00000100" name="TXEMPTYIF" values="C1FIFOINT11__TXEMPTYIF"/>
          <bitfield caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit" mask="0x00000200" name="TXHALFIF" values="C1FIFOINT11__TXHALFIF"/>
          <bitfield caption="Transmit FIFO Not Full Interrupt Flag bit" mask="0x00000400" name="TXNFULLIF" values="C1FIFOINT11__TXNFULLIF"/>
          <bitfield caption="Empty Interrupt Enable bit" mask="0x00010000" name="RXNEMPTYIE" values="C1FIFOINT11__RXNEMPTYIE"/>
          <bitfield caption="FIFO Half Full Interrupt Enable bit" mask="0x00020000" name="RXHALFIE" values="C1FIFOINT11__RXHALFIE"/>
          <bitfield caption="Full Interrupt Enable bit" mask="0x00040000" name="RXFULLIE" values="C1FIFOINT11__RXFULLIE"/>
          <bitfield caption="Overflow Interrupt Enable bit" mask="0x00080000" name="RXOVFLIE" values="C1FIFOINT11__RXOVFLIE"/>
          <bitfield caption="Transmit FIFO Empty Interrupt Enable bit" mask="0x01000000" name="TXEMPTYIE" values="C1FIFOINT11__TXEMPTYIE"/>
          <bitfield caption="Transmit FIFO Half Full Interrupt Enable bit" mask="0x02000000" name="TXHALFIE" values="C1FIFOINT11__TXHALFIE"/>
          <bitfield caption="Transmit FIFO Not Full Interrupt Enable bit" mask="0x04000000" name="TXNFULLIE" values="C1FIFOINT11__TXNFULLIE"/>
        </register>
        <register caption="CAN FIFO User Address Register " name="C1FIFOUA11" offset="0x630" rw="R" size="4">
          <bitfield mask="0xFFFFFFFC" name="FIFOUA"/>
        </register>
        <register caption="CAN Module Message Index Register " name="C1FIFOCI11" offset="0x640" rw="R" size="4">
          <bitfield mask="0x0000001F" name="CFIFOCI"/>
        </register>
        <register caption="CAN FIFO Control Register " name="C1FIFOCON12" offset="0x650" rw="RW" size="4">
          <bitfield caption="Message Transmit Priority bits" mask="0x00000003" name="TXPRI" values="C1FIFOCON12__TXPRI"/>
          <bitfield caption="Auto RTR Enable bit" mask="0x00000004" name="RTREN" values="C1FIFOCON12__RTREN"/>
          <bitfield caption="Message Send Request" mask="0x00000008" name="TXREQ" values="C1FIFOCON12__TXREQ"/>
          <bitfield caption="Error Detected During Transmission bit" mask="0x00000010" name="TXERR" values="C1FIFOCON12__TXERR"/>
          <bitfield caption="Message Lost Arbitration bit" mask="0x00000020" name="TXLARB" values="C1FIFOCON12__TXLARB"/>
          <bitfield caption="Message Aborted bit" mask="0x00000040" name="TXABAT" values="C1FIFOCON12__TXABAT"/>
          <bitfield caption="TX/RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="C1FIFOCON12__TXEN"/>
          <bitfield caption="Store Message Data Only bit" mask="0x00001000" name="DONLY" values="C1FIFOCON12__DONLY"/>
          <bitfield caption="Increment Head/Tail bit" mask="0x00002000" name="UINC" values="C1FIFOCON12__UINC"/>
          <bitfield caption="FIFO Reset bits" mask="0x00004000" name="FRESET" values="C1FIFOCON12__FRESET"/>
          <bitfield caption="FIFO Size bits" mask="0x001F0000" name="FSIZE" values="C1FIFOCON12__FSIZE"/>
        </register>
        <register caption="CAN FIFO Interrupt Register " name="C1FIFOINT12" offset="0x660" rw="RW" size="4">
          <bitfield caption="Receive Buffer Not Empty Interrupt Flag bit" mask="0x00000001" name="RXNEMPTYIF" values="C1FIFOINT12__RXNEMPTYIF"/>
          <bitfield caption="Receive FIFO Half Full Interrupt Flag bit" mask="0x00000002" name="RXHALFIF" values="C1FIFOINT12__RXHALFIF"/>
          <bitfield caption="Receive FIFO Full Interrupt Flag bit" mask="0x00000004" name="RXFULLIF" values="C1FIFOINT12__RXFULLIF"/>
          <bitfield caption="Receive FIFO Overflow Interrupt Flag bit" mask="0x00000008" name="RXOVFLIF" values="C1FIFOINT12__RXOVFLIF"/>
          <bitfield caption="Transmit FIFO Empty Interrupt Flag bit" mask="0x00000100" name="TXEMPTYIF" values="C1FIFOINT12__TXEMPTYIF"/>
          <bitfield caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit" mask="0x00000200" name="TXHALFIF" values="C1FIFOINT12__TXHALFIF"/>
          <bitfield caption="Transmit FIFO Not Full Interrupt Flag bit" mask="0x00000400" name="TXNFULLIF" values="C1FIFOINT12__TXNFULLIF"/>
          <bitfield caption="Empty Interrupt Enable bit" mask="0x00010000" name="RXNEMPTYIE" values="C1FIFOINT12__RXNEMPTYIE"/>
          <bitfield caption="FIFO Half Full Interrupt Enable bit" mask="0x00020000" name="RXHALFIE" values="C1FIFOINT12__RXHALFIE"/>
          <bitfield caption="Full Interrupt Enable bit" mask="0x00040000" name="RXFULLIE" values="C1FIFOINT12__RXFULLIE"/>
          <bitfield caption="Overflow Interrupt Enable bit" mask="0x00080000" name="RXOVFLIE" values="C1FIFOINT12__RXOVFLIE"/>
          <bitfield caption="Transmit FIFO Empty Interrupt Enable bit" mask="0x01000000" name="TXEMPTYIE" values="C1FIFOINT12__TXEMPTYIE"/>
          <bitfield caption="Transmit FIFO Half Full Interrupt Enable bit" mask="0x02000000" name="TXHALFIE" values="C1FIFOINT12__TXHALFIE"/>
          <bitfield caption="Transmit FIFO Not Full Interrupt Enable bit" mask="0x04000000" name="TXNFULLIE" values="C1FIFOINT12__TXNFULLIE"/>
        </register>
        <register caption="CAN FIFO User Address Register " name="C1FIFOUA12" offset="0x670" rw="R" size="4">
          <bitfield mask="0xFFFFFFFC" name="FIFOUA"/>
        </register>
        <register caption="CAN Module Message Index Register " name="C1FIFOCI12" offset="0x680" rw="R" size="4">
          <bitfield mask="0x0000001F" name="CFIFOCI"/>
        </register>
        <register caption="CAN FIFO Control Register " name="C1FIFOCON13" offset="0x690" rw="RW" size="4">
          <bitfield caption="Message Transmit Priority bits" mask="0x00000003" name="TXPRI" values="C1FIFOCON13__TXPRI"/>
          <bitfield caption="Auto RTR Enable bit" mask="0x00000004" name="RTREN" values="C1FIFOCON13__RTREN"/>
          <bitfield caption="Message Send Request" mask="0x00000008" name="TXREQ" values="C1FIFOCON13__TXREQ"/>
          <bitfield caption="Error Detected During Transmission bit" mask="0x00000010" name="TXERR" values="C1FIFOCON13__TXERR"/>
          <bitfield caption="Message Lost Arbitration bit" mask="0x00000020" name="TXLARB" values="C1FIFOCON13__TXLARB"/>
          <bitfield caption="Message Aborted bit" mask="0x00000040" name="TXABAT" values="C1FIFOCON13__TXABAT"/>
          <bitfield caption="TX/RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="C1FIFOCON13__TXEN"/>
          <bitfield caption="Store Message Data Only bit" mask="0x00001000" name="DONLY" values="C1FIFOCON13__DONLY"/>
          <bitfield caption="Increment Head/Tail bit" mask="0x00002000" name="UINC" values="C1FIFOCON13__UINC"/>
          <bitfield caption="FIFO Reset bits" mask="0x00004000" name="FRESET" values="C1FIFOCON13__FRESET"/>
          <bitfield caption="FIFO Size bits" mask="0x001F0000" name="FSIZE" values="C1FIFOCON13__FSIZE"/>
        </register>
        <register caption="CAN FIFO Interrupt Register " name="C1FIFOINT13" offset="0x6a0" rw="RW" size="4">
          <bitfield caption="Receive Buffer Not Empty Interrupt Flag bit" mask="0x00000001" name="RXNEMPTYIF" values="C1FIFOINT13__RXNEMPTYIF"/>
          <bitfield caption="Receive FIFO Half Full Interrupt Flag bit" mask="0x00000002" name="RXHALFIF" values="C1FIFOINT13__RXHALFIF"/>
          <bitfield caption="Receive FIFO Full Interrupt Flag bit" mask="0x00000004" name="RXFULLIF" values="C1FIFOINT13__RXFULLIF"/>
          <bitfield caption="Receive FIFO Overflow Interrupt Flag bit" mask="0x00000008" name="RXOVFLIF" values="C1FIFOINT13__RXOVFLIF"/>
          <bitfield caption="Transmit FIFO Empty Interrupt Flag bit" mask="0x00000100" name="TXEMPTYIF" values="C1FIFOINT13__TXEMPTYIF"/>
          <bitfield caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit" mask="0x00000200" name="TXHALFIF" values="C1FIFOINT13__TXHALFIF"/>
          <bitfield caption="Transmit FIFO Not Full Interrupt Flag bit" mask="0x00000400" name="TXNFULLIF" values="C1FIFOINT13__TXNFULLIF"/>
          <bitfield caption="Empty Interrupt Enable bit" mask="0x00010000" name="RXNEMPTYIE" values="C1FIFOINT13__RXNEMPTYIE"/>
          <bitfield caption="FIFO Half Full Interrupt Enable bit" mask="0x00020000" name="RXHALFIE" values="C1FIFOINT13__RXHALFIE"/>
          <bitfield caption="Full Interrupt Enable bit" mask="0x00040000" name="RXFULLIE" values="C1FIFOINT13__RXFULLIE"/>
          <bitfield caption="Overflow Interrupt Enable bit" mask="0x00080000" name="RXOVFLIE" values="C1FIFOINT13__RXOVFLIE"/>
          <bitfield caption="Transmit FIFO Empty Interrupt Enable bit" mask="0x01000000" name="TXEMPTYIE" values="C1FIFOINT13__TXEMPTYIE"/>
          <bitfield caption="Transmit FIFO Half Full Interrupt Enable bit" mask="0x02000000" name="TXHALFIE" values="C1FIFOINT13__TXHALFIE"/>
          <bitfield caption="Transmit FIFO Not Full Interrupt Enable bit" mask="0x04000000" name="TXNFULLIE" values="C1FIFOINT13__TXNFULLIE"/>
        </register>
