Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
      <value-group caption="CAN Bus Error Interrupt Flag bit" name="C1INT__CERRIF">
        <value caption="A CAN bus error has occurred" name="" value="0x1"/>
        <value caption="A CAN bus error has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="CAN Bus Activity Wake-up Interrupt Flag bit" name="C1INT__WAKIF">
        <value caption="A bus wake-up activity interrupt has occurred" name="" value="0x1"/>
        <value caption="A bus wake-up activity interrupt has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Invalid Message Received Interrupt Flag bit" name="C1INT__IVRIF">
        <value caption="An invalid messages interrupt has occurred" name="" value="0x1"/>
        <value caption="An invalid message interrupt has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Buffer Interrupt Enable bit" name="C1INT__TBIE">
        <value caption="Interrupt request is enabled" name="" value="0x1"/>
        <value caption="Interrupt request is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Buffer Interrupt Enable bit" name="C1INT__RBIE">
        <value caption="Interrupt request is enabled" name="" value="0x1"/>
        <value caption="Interrupt request is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="CAN Timestamp Timer Interrupt Enable bit" name="C1INT__CTMRIE">
        <value caption="Interrupt request is enabled" name="" value="0x1"/>
        <value caption="Interrupt request is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Mode Change Interrupt Enable bit" name="C1INT__MODIE">
        <value caption="Interrupt request is enabled" name="" value="0x1"/>
        <value caption="Interrupt request is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Buffer Overflow Interrupt Enable bit" name="C1INT__RBOVIE">
        <value caption="Interrupt request is enabled" name="" value="0x1"/>
        <value caption="Interrupt request is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="System Error Interrupt Enable bit" name="C1INT__SERRIE">
        <value caption="Interrupt request is enabled" name="" value="0x1"/>
        <value caption="Interrupt request is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="CAN Bus Error Interrupt Enable bit" name="C1INT__CERRIE">
        <value caption="Interrupt request is enabled" name="" value="0x1"/>
        <value caption="Interrupt request is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="CAN Bus Activity Wake-up Interrupt Enable bit" name="C1INT__WAKIE">
        <value caption="Interrupt request is enabled" name="" value="0x1"/>
        <value caption="Interrupt request is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Invalid Message Received Interrupt Enable bit" name="C1INT__IVRIE">
        <value caption="Interrupt request is enabled" name="" value="0x1"/>
        <value caption="Interrupt request is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Code bits" name="C1VEC__ICODE">
        <value caption="Invalid message received (IVRIF)" name="" value="0x48"/>
        <value caption="CAN module mode change (MODIF)" name="" value="0x47"/>
        <value caption="CAN timestamp timer (CTMRIF)" name="" value="0x46"/>
        <value caption="Bus bandwidth error (SERRIF)" name="" value="0x45"/>
        <value caption="Address error interrupt (SERRIF)" name="" value="0x44"/>
        <value caption="Receive FIFO overflow interrupt (RBOVIF)" name="" value="0x43"/>
        <value caption="Wake-up interrupt (WAKIF)" name="" value="0x42"/>
        <value caption="Error Interrupt (CERRIF)" name="" value="0x41"/>
        <value caption="No interrupt" name="" value="0x40"/>
        <value caption="FIFO31 Interrupt (CiFSTAT set)" name="" value="0x1f"/>
        <value caption="FIFO30 Interrupt (CiFSTAT set)" name="" value="0x1e"/>
        <value caption="FIFO1 Interrupt (CiFSTAT set)" name="" value="0x1"/>
        <value caption="FIFO0 Interrupt (CiFSTAT set)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter Hit Number bit" name="C1VEC__FILHIT">
        <value caption="Filter 31" name="" value="0x1f"/>
        <value caption="Filter 30" name="" value="0x1e"/>
        <value caption="Filter 1" name="" value="0x1"/>
        <value caption="Filter 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFOx Interrupt Pending bits" name="C1FSTAT__FIFOIP">
        <value caption="One or more enabled FIFO interrupts are pending" name="" value="0x1"/>
        <value caption="No FIFO interrupts are pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFOx Receive Overflow Interrupt Pending bit" name="C1RXOVF__RXOVF">
        <value caption="FIFO has overflowed" name="" value="0x1"/>
        <value caption="FIFO has not overflowed" name="" value="0x0"/>
      </value-group>
      <value-group caption="CAN Time Stamp Timer Prescaler bits" name="C1TMR__CANTSPRE">
        <value caption="CAN time stamp timer (CANTS) increments every 65,535 system clocks" name="" value="0xffffffff"/>
        <value caption="CAN time stamp timer (CANTS) increments every system clock" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXM0__EID">
        <value caption="Include bit, EIDx, in filter comparison" name="" value="0x1"/>
        <value caption="Bit EIDx is dont care in filter operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="C1RXM0__MIDE">
        <value caption="Match only message types (standard/extended address) that correspond to the EXID bit in filter" name="" value="0x1"/>
        <value caption="Match either standard or extended address message if filters match (that is, if (Filter SID) = (Message SID) or if (FILTER SID/EID) = (Message SID/EID))" name="" value="0x0"/>
      </value-group>
