Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
      <value-group caption="Extended Identifier bits" name="C1RXF7__EID">
        <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
        <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF7__EXID">
        <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
        <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF7__SID">
        <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1"/>
        <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF8__EID">
        <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
        <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF8__EXID">
        <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
        <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF8__SID">
        <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1"/>
        <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF9__EID">
        <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
        <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF9__EXID">
        <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
        <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF9__SID">
        <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1"/>
        <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF10__EID">
        <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
        <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF10__EXID">
        <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
        <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF10__SID">
        <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1"/>
        <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF11__EID">
        <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
        <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF11__EXID">
        <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
        <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF11__SID">
        <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1"/>
        <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF12__EID">
        <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
        <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF12__EXID">
        <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
        <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF12__SID">
        <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1"/>
        <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF13__EID">
        <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
        <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF13__EXID">
        <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
        <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF13__SID">
        <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1"/>
        <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF14__EID">
        <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
        <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF14__EXID">
        <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
        <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
