Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
      <value-group caption="Message Send Request" name="C1FIFOCON15__TXREQ">
        <value caption="(TXEN is 1) Request sending a message. The bit will automatically clear when all the messages queued in the FIFO are successfully sent./ (TXEN is 0) This bit has no effect" name="" value="0x1"/>
        <value caption="(TXEN is 1) Request a message abort / (TXEN is 0) This bit has no effect." name="" value="0x0"/>
      </value-group>
      <value-group caption="Error Detected During Transmission bit" name="C1FIFOCON15__TXERR">
        <value caption="A bus error occurred while the message was being sent" name="" value="0x1"/>
        <value caption="A bus error did not occur while the message was being sent" name="" value="0x0"/>
      </value-group>
      <value-group caption="Message Lost Arbitration bit" name="C1FIFOCON15__TXLARB">
        <value caption="Message lost arbitration while being sent" name="" value="0x1"/>
        <value caption="Message did not lose arbitration while being sent" name="" value="0x0"/>
      </value-group>
      <value-group caption="Message Aborted bit" name="C1FIFOCON15__TXABAT">
        <value caption="Message was aborted" name="" value="0x1"/>
        <value caption="Message completed successfully" name="" value="0x0"/>
      </value-group>
      <value-group caption="TX/RX Buffer Selection bit" name="C1FIFOCON15__TXEN">
        <value caption="FIFO is a Transmit FIFO" name="" value="0x1"/>
        <value caption="FIFO is a Receive FIFO" name="" value="0x0"/>
      </value-group>
      <value-group caption="Store Message Data Only bit" name="C1FIFOCON15__DONLY">
        <value caption="(TXEN is 1) This bit is not used and has no effect. / (TXEN is 0) Only data bytes will be stored in the FIFO" name="" value="0x1"/>
        <value caption="(TXEN is 1) This bit is not used and has no effect. / (TXEN is 0) Full message is stored, including identifier" name="" value="0x0"/>
      </value-group>
      <value-group caption="Increment Head/Tail bit" name="C1FIFOCON15__UINC">
        <value caption="(TXEN is 1) The FIFO head will increment by a single message / (TXEN is 0) The FIFO tail will increment by a single message" name="" value="0x1"/>
        <value caption="(TXEN is 1) The FIFO head will not increment by a single message / (TXEN is 0) The FIFO tail will not increment by a single message" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Reset bits" name="C1FIFOCON15__FRESET">
        <value caption="FIFO will be reset when bit is set, cleared by hardware when FIFO is reset. After setting, the user application should poll whether this bit is clear before taking any action" name="" value="0x1"/>
        <value caption="No effect" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Size bits" name="C1FIFOCON15__FSIZE">
        <value caption="FIFO is 32 messages deep" name="" value="0x1f"/>
        <value caption="FIFO is 3 messages deep" name="" value="0x2"/>
        <value caption="FIFO is 2 messages deep" name="" value="0x1"/>
        <value caption="FIFO is 1 message deep" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Buffer Not Empty Interrupt Flag bit" name="C1FIFOINT15__RXNEMPTYIF">
        <value caption="(TXEN is 1) Unused, reads 0 / (TXEN is 0) FIFO is at least half full" name="" value="0x1"/>
        <value caption="(TXEN is 1) Unused, reads 0 / (TXEN is 0) FIFO is less than half full" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive FIFO Half Full Interrupt Flag bit" name="C1FIFOINT15__RXHALFIF">
        <value caption="(TXEN is 1) Unused, reads 0 / (TXEN is 0) FIFO is not empty, has at least 1 message" name="" value="0x1"/>
        <value caption="(TXEN is 1) Unused, reads 0 / (TXEN is 0) FIFO is empty" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive FIFO Full Interrupt Flag bit" name="C1FIFOINT15__RXFULLIF">
        <value caption="(TXEN is 1) Unused, reads 0 / (TXEN is 0) FIFO is full" name="" value="0x1"/>
        <value caption="(TXEN is 1) Unused, reads 0 / (TXEN is 0) FIFO is full" name="" value="0x1"/>
      </value-group>
      <value-group caption="Receive FIFO Overflow Interrupt Flag bit" name="C1FIFOINT15__RXOVFLIF">
        <value caption="(TXEN is 1) Unused, reads 0 / (TXEN is 0) Overflow event has occurred" name="" value="0x1"/>
        <value caption="(TXEN is 1) Unused, reads 0 / (TXEN is 0) Overflow event has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit FIFO Empty Interrupt Flag bit" name="C1FIFOINT15__TXEMPTYIF">
        <value caption="(TXEN is 1) FIFO is empty / (TXEN is 0) Unused, reads 0" name="" value="0x1"/>
        <value caption="(TXEN is 1) FIFO is not empty / (TXEN is 0) Unused, reads 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit" name="C1FIFOINT15__TXHALFIF">
        <value caption="(TXEN is 1) FIFO is at most half full / (TXEN is 0) Unused, reads 0" name="" value="0x1"/>
        <value caption="(TXEN is 1) FIFO is more than half full / (TXEN is 0) Unused, reads 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit FIFO Not Full Interrupt Flag bit" name="C1FIFOINT15__TXNFULLIF">
        <value caption="(TXEN is 1) FIFO is not full / (TXEN is 0) Unused, reads 0" name="" value="0x1"/>
        <value caption="(TXEN is 1) FIFO is full / (TXEN is 0) Unused, reads 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Empty Interrupt Enable bit" name="C1FIFOINT15__RXNEMPTYIE">
        <value caption="Interrupt enabled for FIFO not empty" name="" value="0x1"/>
        <value caption="Interrupt disabled for FIFO not empty" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Half Full Interrupt Enable bit" name="C1FIFOINT15__RXHALFIE">
        <value caption="Interrupt enabled for FIFO half full" name="" value="0x1"/>
        <value caption="Interrupt disabled for FIFO half full" name="" value="0x0"/>
      </value-group>
      <value-group caption="Full Interrupt Enable bit" name="C1FIFOINT15__RXFULLIE">
        <value caption="Interrupt enabled for FIFO full" name="" value="0x1"/>
        <value caption="Interrupt disabled for FIFO full" name="" value="0x0"/>
      </value-group>
      <value-group caption="Overflow Interrupt Enable bit" name="C1FIFOINT15__RXOVFLIE">
        <value caption="Interrupt enabled for overflow event" name="" value="0x1"/>
        <value caption="Interrupt disabled for overflow event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit FIFO Empty Interrupt Enable bit" name="C1FIFOINT15__TXEMPTYIE">
        <value caption="Interrupt enabled for FIFO empty" name="" value="0x1"/>
        <value caption="Interrupt disabled for FIFO empty" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit FIFO Half Full Interrupt Enable bit" name="C1FIFOINT15__TXHALFIE">
        <value caption="Interrupt enabled for FIFO half full" name="" value="0x1"/>
        <value caption="Interrupt disabled for FIFO half full" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit FIFO Not Full Interrupt Enable bit" name="C1FIFOINT15__TXNFULLIE">
        <value caption="Interrupt enabled for FIFO not full" name="" value="0x1"/>
        <value caption="Interrupt disabled for FIFO not full" name="" value="0x0"/>
      </value-group>
    </module>
    <module caption="" id="03247" name="CAN" version="2">
      <register-group name="CAN">
        <register caption="CAN Control Register" name="CFD2CON" offset="0x0" rw="RW" size="4">
          <bitfield caption="Device Net Filter Bit Number bits" mask="0x0000001F" name="DNCNT" values="CFD2CON__DNCNT"/>
          <bitfield caption="Enable ISO CRC in CAN FD Frames bit" mask="0x00000020" name="ISOCRCEN" values="CFD2CON__ISOCRCEN"/>
          <bitfield caption="Protocol Exception Event Detection Disabled bit" mask="0x00000040" name="PXEDIS" values="CFD2CON__PXEDIS"/>
          <bitfield caption="Module Clock Source Select bit" mask="0x00000080" name="CLKSEL0" values="CFD2CON__CLKSEL0"/>
          <bitfield caption="Enable CAN Bus Line Wake-up Filter bit" mask="0x00000100" name="WAKFIL" values="CFD2CON__WAKFIL"/>
          <bitfield caption="Selectable Wake-up Filter Time bits" mask="0x00000600" name="WFT" values="CFD2CON__WFT"/>
          <bitfield caption="CAN Module is Busy bit" mask="0x00000800" name="CANBUSY" values="CFD2CON__CANBUSY"/>
          <bitfield caption="Bit Rate Switching Disable bit" mask="0x00001000" name="BRSDIS" values="CFD2CON__BRSDIS"/>
          <bitfield caption="Stop-in-Idle Control bit" mask="0x00002000" name="SIDL" values="CFD2CON__SIDL"/>
          <bitfield caption="Enable bit" mask="0x00008000" name="ON" values="CFD2CON__ON"/>
          <bitfield caption="Restrict Retransmission Attempts bit" mask="0x00010000" name="RTXAT" values="CFD2CON__RTXAT"/>
          <bitfield caption="Transmit ESI in Gateway Mode bit" mask="0x00020000" name="ESIGM" values="CFD2CON__ESIGM"/>
          <bitfield caption="Transition to Listen Only Mode on System Error bit" mask="0x00040000" name="SERR2LOM" values="CFD2CON__SERR2LOM"/>
          <bitfield caption="Store in Transmit Event FIFO bit" mask="0x00080000" name="STEF" values="CFD2CON__STEF"/>
          <bitfield caption="Enable Transmit Queue bit" mask="0x00100000" name="TXQEN" values="CFD2CON__TXQEN"/>
          <bitfield caption="Operation Mode Status bits" mask="0x00E00000" name="OPMOD" values="CFD2CON__OPMOD"/>
          <bitfield caption="Request Operation Mode bits" mask="0x07000000" name="REQOP" values="CFD2CON__REQOP"/>
          <bitfield caption="Abort All Pending Transmissions bit" mask="0x08000000" name="ABAT" values="CFD2CON__ABAT"/>
          <bitfield caption="Transmit Bandwidth Sharing bits" mask="0xF0000000" name="TXBWS" values="CFD2CON__TXBWS"/>
        </register>
        <register caption="Nominal Bit Time Configuration Register" name="CFD2NBTCFG" offset="0x4" rw="RW" size="4">
          <bitfield caption="Synchronization Jump Width bits" mask="0x0000007F" name="SJW" values="CFD2NBTCFG__SJW"/>
          <bitfield caption="Time Segment 2 bits" mask="0x00007F00" name="TSEG2" values="CFD2NBTCFG__TSEG2"/>
          <bitfield caption="Time Segment 1 bits" mask="0x00FF0000" name="TSEG1" values="CFD2NBTCFG__TSEG1"/>
          <bitfield caption="Baud Rate Prescaler bits" mask="0xFF000000" name="BRP" values="CFD2NBTCFG__BRP"/>
        </register>
        <register caption="Data Bit Time Configuration Register" name="CFD2DBTCFG" offset="0x8" rw="RW" size="4">
          <bitfield caption="Synchronization Jump Width bits" mask="0x0000000F" name="SJW" values="CFD2DBTCFG__SJW"/>
          <bitfield caption="Time Segment 2 bits" mask="0x00000F00" name="TSEG2" values="CFD2DBTCFG__TSEG2"/>
          <bitfield caption="Time Segment 1 bits" mask="0x001F0000" name="TSEG1" values="CFD2DBTCFG__TSEG1"/>
          <bitfield caption="Baud Rate Prescaler bits" mask="0xFF000000" name="BRP" values="CFD2DBTCFG__BRP"/>
        </register>
        <register caption="Transmitter Delay Compensation Register" name="CFD2TDC" offset="0xc" rw="RW" size="4">
          <bitfield caption="Transmitter Delay Compensation Value bits; Secondary Sample Point" mask="0x0000003F" name="TDCV" values="CFD2TDC__TDCV"/>
          <bitfield caption="Transmitter Delay Compensation Offset bits" mask="0x00007F00" name="TDCO" values="CFD2TDC__TDCO"/>
          <bitfield caption="Transmitter Delay Compensation Mode bits" mask="0x00030000" name="TDCMOD" values="CFD2TDC__TDCMOD"/>
          <bitfield caption="Enable 12-Bit SID in CAN FD Base Format Messages bit" mask="0x01000000" name="SID11EN" values="CFD2TDC__SID11EN"/>
          <bitfield caption="Enable Edge Filtering during Bus Integration state bit" mask="0x02000000" name="EDGFLTEN" values="CFD2TDC__EDGFLTEN"/>
        </register>
        <register caption="CAN Time Base Counter Register" name="CFD2TBC" offset="0x10" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="TBC"/>
        </register>
