Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
        <register caption="Transmit Event FIFO Control Register" name="CFD2TEFCON" offset="0x40" rw="RW" size="4">
          <bitfield caption="Transmit Event FIFO Not Empty Interrupt Enable bit" mask="0x00000001" name="TEFNEIE" values="CFD2TEFCON__TEFNEIE"/>
          <bitfield caption="Transmit Event FIFO Half Full Interrupt Enable bit" mask="0x00000002" name="TEFHIE" values="CFD2TEFCON__TEFHIE"/>
          <bitfield caption="Transmit Event FIFO Full Interrupt Enable bit" mask="0x00000004" name="TEFFIE" values="CFD2TEFCON__TEFFIE"/>
          <bitfield caption="Transmit Event FIFO Overflow Interrupt Enable bit" mask="0x00000008" name="TEFOVIE" values="CFD2TEFCON__TEFOVIE"/>
          <bitfield caption="Transmit Event FIFO Time Stamp Enable bit" mask="0x00000020" name="TEFTSEN" values="CFD2TEFCON__TEFTSEN"/>
          <bitfield mask="0x00000100" name="UINC"/>
          <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD2TEFCON__FRESET"/>
          <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD2TEFCON__FSIZE"/>
        </register>
        <register caption="Transmit Event FIFO Status Register" name="CFD2TEFSTA" offset="0x44" rw="RW" size="4">
          <bitfield caption="Transmit Event FIFO Not Empty Interrupt Flag bit" mask="0x00000001" name="TEFNEIF" values="CFD2TEFSTA__TEFNEIF"/>
          <bitfield caption="Transmit Event FIFO Half Full Interrupt Flag bit" mask="0x00000002" name="TEFHIF" values="CFD2TEFSTA__TEFHIF"/>
          <bitfield caption="Transmit Event FIFO Full Interrupt Flag bit" mask="0x00000004" name="TEFFIF" values="CFD2TEFSTA__TEFFIF"/>
          <bitfield caption="Transmit Event FIFO Overflow Interrupt Flag bit" mask="0x00000008" name="TEFOVIF" values="CFD2TEFSTA__TEFOVIF"/>
        </register>
        <register caption="Transmit Event FIFO User Address Register" name="CFD2TEFUA" offset="0x48" rw="RW" size="4">
          <bitfield caption="Transmit Event FIFO User Address bits" mask="0xFFFFFFFF" name="TEFUA"/>
        </register>
        <register caption="Message Memory Base Address Register" name="CFD2FIFOBA" offset="0x4c" rw="RW" size="4">
          <bitfield caption="Message Memory Base Address bits" mask="0xFFFFFFFF" name="FIFOBA"/>
        </register>
        <register caption="Transmit Queue Control Register" name="CFD2TXQCON" offset="0x50" rw="RW" size="4">
          <bitfield caption="Transmit Queue Not Full Interrupt Enable bit" mask="0x00000001" name="TXQNIE" values="CFD2TXQCON__TXQNIE"/>
          <bitfield caption="Transmit Queue Empty Interrupt Enable bit" mask="0x00000004" name="TXQEIE" values="CFD2TXQCON__TXQEIE"/>
          <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD2TXQCON__TXATIE"/>
          <bitfield caption="TX Enable" mask="0x00000080" name="TXEN" values="CFD2TXQCON__TXEN"/>
          <bitfield caption="Increment Head/Tail bit" mask="0x00000100" name="UINC" values="CFD2TXQCON__UINC"/>
          <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD2TXQCON__TXREQ"/>
          <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD2TXQCON__FRESET"/>
          <bitfield caption="Message Transmit Priority bits" mask="0x001F0000" name="TXPRI" values="CFD2TXQCON__TXPRI"/>
          <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD2TXQCON__TXAT"/>
          <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD2TXQCON__FSIZE"/>
          <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD2TXQCON__PLSIZE"/>
        </register>
        <register caption="Transmit Queue Status Register" name="CFD2TXQSTA" offset="0x54" rw="RW" size="4">
          <bitfield caption="Transmit Queue Not Full Interrupt Flag bit" mask="0x00000001" name="TXQNIF" values="CFD2TXQSTA__TXQNIF"/>
          <bitfield caption="Transmit Queue Empty Interrupt Flag bit" mask="0x00000004" name="TXQEIF" values="CFD2TXQSTA__TXQEIF"/>
          <bitfield caption="Transmit Attempts Exhausted Interrupt Pending bit" mask="0x00000010" name="TXATIF" values="CFD2TXQSTA__TXATIF"/>
          <bitfield caption="Error Detected During Transmission bit" mask="0x00000020" name="TXERR" values="CFD2TXQSTA__TXERR"/>
          <bitfield caption="Message Lost Arbitration Status bit" mask="0x00000040" name="TXLARB" values="CFD2TXQSTA__TXLARB"/>
          <bitfield caption="Message Aborted Status bit" mask="0x00000080" name="TXABT" values="CFD2TXQSTA__TXABT"/>
          <bitfield caption="Transmit Queue Message Index bits" mask="0x00001F00" name="TXQCI"/>
        </register>
        <register caption="Transmit Queue User Address Register" name="CFD2TXQUA" offset="0x58" rw="RW" size="4">
          <bitfield caption="Transmit Queue User Address bits" mask="0xFFFFFFFF" name="TXQUA"/>
        </register>
        <register caption="FIFO Control Register" name="CFD2FIFOCON1" offset="0x5c" rw="RW" size="4">
          <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD2FIFOCON1__TFNRFNIE"/>
          <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD2FIFOCON1__TFHRFHIE"/>
          <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD2FIFOCON1__TFERFFIE"/>
          <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD2FIFOCON1__RXOVIE"/>
          <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD2FIFOCON1__TXATIE"/>
          <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD2FIFOCON1__RXTSEN"/>
          <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD2FIFOCON1__RTREN"/>
          <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD2FIFOCON1__TXEN"/>
          <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD2FIFOCON1__UINC"/>
          <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD2FIFOCON1__TXREQ"/>
          <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD2FIFOCON1__FRESET"/>
          <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD2FIFOCON1__TXPRI"/>
          <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD2FIFOCON1__TXAT"/>
          <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD2FIFOCON1__FSIZE"/>
          <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD2FIFOCON1__PLSIZE"/>
        </register>
        <register caption="" name="CFD2FIFOSTA1" offset="0x60" rw="RW" size="4">
          <bitfield mask="0x00000001" name="TFNRFNIF"/>
          <bitfield mask="0x00000002" name="TFHRFHIF"/>
          <bitfield mask="0x00000004" name="TFERFFIF"/>
          <bitfield mask="0x00000008" name="RXOVIF"/>
          <bitfield mask="0x00000010" name="TXATIF"/>
          <bitfield mask="0x00000020" name="TXERR"/>
          <bitfield mask="0x00000040" name="TXLARB"/>
          <bitfield mask="0x00000080" name="TXABT"/>
          <bitfield mask="0x00001F00" name="FIFOCI"/>
        </register>
