Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
        <register caption="" name="CFD2FIFOUA1" offset="0x64" rw="RW" size="4">
          <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA"/>
        </register>
        <register caption="FIFO Control Register" name="CFD2FIFOCON2" offset="0x68" rw="RW" size="4">
          <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD2FIFOCON2__TFNRFNIE"/>
          <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD2FIFOCON2__TFHRFHIE"/>
          <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD2FIFOCON2__TFERFFIE"/>
          <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD2FIFOCON2__RXOVIE"/>
          <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD2FIFOCON2__TXATIE"/>
          <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD2FIFOCON2__RXTSEN"/>
          <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD2FIFOCON2__RTREN"/>
          <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD2FIFOCON2__TXEN"/>
          <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD2FIFOCON2__UINC"/>
          <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD2FIFOCON2__TXREQ"/>
          <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD2FIFOCON2__FRESET"/>
          <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD2FIFOCON2__TXPRI"/>
          <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD2FIFOCON2__TXAT"/>
          <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD2FIFOCON2__FSIZE"/>
          <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD2FIFOCON2__PLSIZE"/>
        </register>
        <register caption="" name="CFD2FIFOSTA2" offset="0x6c" rw="RW" size="4">
          <bitfield mask="0x00000001" name="TFNRFNIF"/>
          <bitfield mask="0x00000002" name="TFHRFHIF"/>
          <bitfield mask="0x00000004" name="TFERFFIF"/>
          <bitfield mask="0x00000008" name="RXOVIF"/>
          <bitfield mask="0x00000010" name="TXATIF"/>
          <bitfield mask="0x00000020" name="TXERR"/>
          <bitfield mask="0x00000040" name="TXLARB"/>
          <bitfield mask="0x00000080" name="TXABT"/>
          <bitfield mask="0x00001F00" name="FIFOCI"/>
        </register>
        <register caption="" name="CFD2FIFOUA2" offset="0x70" rw="RW" size="4">
          <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA"/>
        </register>
        <register caption="FIFO Control Register" name="CFD2FIFOCON3" offset="0x74" rw="RW" size="4">
          <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD2FIFOCON3__TFNRFNIE"/>
          <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD2FIFOCON3__TFHRFHIE"/>
          <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD2FIFOCON3__TFERFFIE"/>
          <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD2FIFOCON3__RXOVIE"/>
          <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD2FIFOCON3__TXATIE"/>
          <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD2FIFOCON3__RXTSEN"/>
          <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD2FIFOCON3__RTREN"/>
          <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD2FIFOCON3__TXEN"/>
          <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD2FIFOCON3__UINC"/>
          <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD2FIFOCON3__TXREQ"/>
          <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD2FIFOCON3__FRESET"/>
          <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD2FIFOCON3__TXPRI"/>
          <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD2FIFOCON3__TXAT"/>
          <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD2FIFOCON3__FSIZE"/>
          <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD2FIFOCON3__PLSIZE"/>
        </register>
        <register caption="" name="CFD2FIFOSTA3" offset="0x78" rw="RW" size="4">
          <bitfield mask="0x00000001" name="TFNRFNIF"/>
          <bitfield mask="0x00000002" name="TFHRFHIF"/>
          <bitfield mask="0x00000004" name="TFERFFIF"/>
          <bitfield mask="0x00000008" name="RXOVIF"/>
          <bitfield mask="0x00000010" name="TXATIF"/>
          <bitfield mask="0x00000020" name="TXERR"/>
          <bitfield mask="0x00000040" name="TXLARB"/>
          <bitfield mask="0x00000080" name="TXABT"/>
          <bitfield mask="0x00001F00" name="FIFOCI"/>
        </register>
        <register caption="" name="CFD2FIFOUA3" offset="0x7c" rw="RW" size="4">
          <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA"/>
        </register>
        <register caption="FIFO Control Register" name="CFD2FIFOCON4" offset="0x80" rw="RW" size="4">
          <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD2FIFOCON4__TFNRFNIE"/>
          <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD2FIFOCON4__TFHRFHIE"/>
          <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD2FIFOCON4__TFERFFIE"/>
          <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD2FIFOCON4__RXOVIE"/>
          <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD2FIFOCON4__TXATIE"/>
          <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD2FIFOCON4__RXTSEN"/>
          <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD2FIFOCON4__RTREN"/>
          <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD2FIFOCON4__TXEN"/>
          <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD2FIFOCON4__UINC"/>
          <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD2FIFOCON4__TXREQ"/>
          <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD2FIFOCON4__FRESET"/>
          <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD2FIFOCON4__TXPRI"/>
          <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD2FIFOCON4__TXAT"/>
          <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD2FIFOCON4__FSIZE"/>
          <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD2FIFOCON4__PLSIZE"/>
        </register>
        <register caption="" name="CFD2FIFOSTA4" offset="0x84" rw="RW" size="4">
          <bitfield mask="0x00000001" name="TFNRFNIF"/>
          <bitfield mask="0x00000002" name="TFHRFHIF"/>
          <bitfield mask="0x00000004" name="TFERFFIF"/>
          <bitfield mask="0x00000008" name="RXOVIF"/>
          <bitfield mask="0x00000010" name="TXATIF"/>
          <bitfield mask="0x00000020" name="TXERR"/>
          <bitfield mask="0x00000040" name="TXLARB"/>
          <bitfield mask="0x00000080" name="TXABT"/>
          <bitfield mask="0x00001F00" name="FIFOCI"/>
        </register>
        <register caption="" name="CFD2FIFOUA4" offset="0x88" rw="RW" size="4">
          <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA"/>
        </register>
        <register caption="FIFO Control Register" name="CFD2FIFOCON5" offset="0x8c" rw="RW" size="4">
          <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD2FIFOCON5__TFNRFNIE"/>
          <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD2FIFOCON5__TFHRFHIE"/>
          <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD2FIFOCON5__TFERFFIE"/>
          <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD2FIFOCON5__RXOVIE"/>
          <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD2FIFOCON5__TXATIE"/>
          <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD2FIFOCON5__RXTSEN"/>
          <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD2FIFOCON5__RTREN"/>
          <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD2FIFOCON5__TXEN"/>
          <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD2FIFOCON5__UINC"/>
          <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD2FIFOCON5__TXREQ"/>
          <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD2FIFOCON5__FRESET"/>
          <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD2FIFOCON5__TXPRI"/>
          <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD2FIFOCON5__TXAT"/>
          <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD2FIFOCON5__FSIZE"/>
          <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD2FIFOCON5__PLSIZE"/>
        </register>
