Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
        <register caption="" name="CFD2FIFOSTA5" offset="0x90" rw="RW" size="4">
          <bitfield mask="0x00000001" name="TFNRFNIF"/>
          <bitfield mask="0x00000002" name="TFHRFHIF"/>
          <bitfield mask="0x00000004" name="TFERFFIF"/>
          <bitfield mask="0x00000008" name="RXOVIF"/>
          <bitfield mask="0x00000010" name="TXATIF"/>
          <bitfield mask="0x00000020" name="TXERR"/>
          <bitfield mask="0x00000040" name="TXLARB"/>
          <bitfield mask="0x00000080" name="TXABT"/>
          <bitfield mask="0x00001F00" name="FIFOCI"/>
        </register>
        <register caption="" name="CFD2FIFOUA5" offset="0x94" rw="RW" size="4">
          <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA"/>
        </register>
        <register caption="FIFO Control Register" name="CFD2FIFOCON6" offset="0x98" rw="RW" size="4">
          <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD2FIFOCON6__TFNRFNIE"/>
          <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD2FIFOCON6__TFHRFHIE"/>
          <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD2FIFOCON6__TFERFFIE"/>
          <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD2FIFOCON6__RXOVIE"/>
          <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD2FIFOCON6__TXATIE"/>
          <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD2FIFOCON6__RXTSEN"/>
          <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD2FIFOCON6__RTREN"/>
          <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD2FIFOCON6__TXEN"/>
          <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD2FIFOCON6__UINC"/>
          <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD2FIFOCON6__TXREQ"/>
          <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD2FIFOCON6__FRESET"/>
          <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD2FIFOCON6__TXPRI"/>
          <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD2FIFOCON6__TXAT"/>
          <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD2FIFOCON6__FSIZE"/>
          <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD2FIFOCON6__PLSIZE"/>
        </register>
        <register caption="" name="CFD2FIFOSTA6" offset="0x9c" rw="RW" size="4">
          <bitfield mask="0x00000001" name="TFNRFNIF"/>
          <bitfield mask="0x00000002" name="TFHRFHIF"/>
          <bitfield mask="0x00000004" name="TFERFFIF"/>
          <bitfield mask="0x00000008" name="RXOVIF"/>
          <bitfield mask="0x00000010" name="TXATIF"/>
          <bitfield mask="0x00000020" name="TXERR"/>
          <bitfield mask="0x00000040" name="TXLARB"/>
          <bitfield mask="0x00000080" name="TXABT"/>
          <bitfield mask="0x00001F00" name="FIFOCI"/>
        </register>
        <register caption="" name="CFD2FIFOUA6" offset="0xa0" rw="RW" size="4">
          <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA"/>
        </register>
        <register caption="FIFO Control Register" name="CFD2FIFOCON7" offset="0xa4" rw="RW" size="4">
          <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD2FIFOCON7__TFNRFNIE"/>
          <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD2FIFOCON7__TFHRFHIE"/>
          <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD2FIFOCON7__TFERFFIE"/>
          <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD2FIFOCON7__RXOVIE"/>
          <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD2FIFOCON7__TXATIE"/>
          <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD2FIFOCON7__RXTSEN"/>
          <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD2FIFOCON7__RTREN"/>
          <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD2FIFOCON7__TXEN"/>
          <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD2FIFOCON7__UINC"/>
          <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD2FIFOCON7__TXREQ"/>
          <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD2FIFOCON7__FRESET"/>
          <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD2FIFOCON7__TXPRI"/>
          <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD2FIFOCON7__TXAT"/>
          <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD2FIFOCON7__FSIZE"/>
          <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD2FIFOCON7__PLSIZE"/>
        </register>
        <register caption="" name="CFD2FIFOSTA7" offset="0xa8" rw="RW" size="4">
          <bitfield mask="0x00000001" name="TFNRFNIF"/>
          <bitfield mask="0x00000002" name="TFHRFHIF"/>
          <bitfield mask="0x00000004" name="TFERFFIF"/>
          <bitfield mask="0x00000008" name="RXOVIF"/>
          <bitfield mask="0x00000010" name="TXATIF"/>
          <bitfield mask="0x00000020" name="TXERR"/>
          <bitfield mask="0x00000040" name="TXLARB"/>
          <bitfield mask="0x00000080" name="TXABT"/>
          <bitfield mask="0x00001F00" name="FIFOCI"/>
        </register>
        <register caption="" name="CFD2FIFOUA7" offset="0xac" rw="RW" size="4">
          <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA"/>
        </register>
        <register caption="FIFO Control Register" name="CFD2FIFOCON8" offset="0xb0" rw="RW" size="4">
          <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD2FIFOCON8__TFNRFNIE"/>
          <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD2FIFOCON8__TFHRFHIE"/>
          <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD2FIFOCON8__TFERFFIE"/>
          <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD2FIFOCON8__RXOVIE"/>
          <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD2FIFOCON8__TXATIE"/>
          <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD2FIFOCON8__RXTSEN"/>
          <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD2FIFOCON8__RTREN"/>
          <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD2FIFOCON8__TXEN"/>
          <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD2FIFOCON8__UINC"/>
          <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD2FIFOCON8__TXREQ"/>
          <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD2FIFOCON8__FRESET"/>
          <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD2FIFOCON8__TXPRI"/>
          <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD2FIFOCON8__TXAT"/>
          <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD2FIFOCON8__FSIZE"/>
          <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD2FIFOCON8__PLSIZE"/>
        </register>
        <register caption="" name="CFD2FIFOSTA8" offset="0xb4" rw="RW" size="4">
          <bitfield mask="0x00000001" name="TFNRFNIF"/>
          <bitfield mask="0x00000002" name="TFHRFHIF"/>
          <bitfield mask="0x00000004" name="TFERFFIF"/>
          <bitfield mask="0x00000008" name="RXOVIF"/>
          <bitfield mask="0x00000010" name="TXATIF"/>
          <bitfield mask="0x00000020" name="TXERR"/>
          <bitfield mask="0x00000040" name="TXLARB"/>
          <bitfield mask="0x00000080" name="TXABT"/>
          <bitfield mask="0x00001F00" name="FIFOCI"/>
        </register>
        <register caption="" name="CFD2FIFOUA8" offset="0xb8" rw="RW" size="4">
          <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA"/>
        </register>
