Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
      <value-group caption="Receive Object Interrupt Enable bit" name="CFD2INT__RXIE">
        <value caption="Interrupts are enabled" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="CAN Timer Interrupt Enable bit" name="CFD2INT__TBCIE">
        <value caption="Interrupts are enabled" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Mode Change Interrupt Enable bit" name="CFD2INT__MODIE">
        <value caption="Interrupts are enabled" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Event FIFO Interrupt Enable bit" name="CFD2INT__TEFIE">
        <value caption="Interrupts are enabled" name="" value="0x1"/>
      </value-group>
      <value-group caption="Transmit Attempt Interrupt Enable bit" name="CFD2INT__TXATIE">
        <value caption="Interrupts are enabled" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Buffer Overflow Interrupt Enable bit" name="CFD2INT__RXOVIE">
        <value caption="Interrupts are enabled" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="System Error Interrupt Enable bit" name="CFD2INT__SERRIE">
        <value caption="Interrupts are enabled" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="CAN Bus Error Interrupt Enable bit" name="CFD2INT__CERRIE">
        <value caption="Interrupts are enabled" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Bus Wake Up Activity Interrupt Enable bit" name="CFD2INT__WAKIE">
        <value caption="Interrupts are enabled" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Invalid Message Interrupt Enable bit" name="CFD2INT__IVMIE">
        <value caption="Interrupts are enabled" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive FIFO Interrupt Pending bits" name="CFD2RXIF__RFIF">
        <value caption="One or more enabled receive FIFO interrupts are pending" name="" value="0x1"/>
        <value caption="No enabled receive FIFO interrupts are pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit FIFO/Transmit Queue Interrupt Pending bits" name="CFD2TXIF__TFIF">
        <value caption="One or more enabled transmit FIFO/Transmit Queue interrupts are pending" name="" value="0x1"/>
        <value caption="No enabled transmit FIFO/Transmit Queue interrupt are pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive FIFO Overflow Interrupt Pending bits" name="CFD2RXOVIF__RFOVIF">
        <value caption="Interrupt is pending" name="" value="0x1"/>
        <value caption="Interrupt not pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit FIFO/Transmit Queue Attempt Interrupt Pending bits" name="CFD2TXATIF__TFATIF">
        <value caption="A transmit interrupt is pending in one or more of the designated 32 FIFOs denoted by which of the 32 bits in the CxTXATIF register are set" name="" value="0x1"/>
        <value caption="No transmit FIFO interrupts are pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Error Counter bits" name="CFD2TREC__RERRCNT">
        <value caption="Greater than or equal to 255 Receive errors" name="" value="0xff"/>
        <value caption="254 receive errors" name="" value="0xfe"/>
        <value caption="1 receive error" name="" value="0x1"/>
        <value caption="No receive errors" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Error Counter bits" name="CFD2TREC__TERRCNT">
        <value caption="Greater than or equal to 255 Transmit errors." name="" value="0xff"/>
        <value caption="254 Transmit errors" name="" value="0xfe"/>
        <value caption="1 transmit error" name="" value="0x1"/>
        <value caption="No transmit errors" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmitter or Receiver is in Error State Warning bit" name="CFD2TREC__EWARN">
        <value caption="TXWARN or RXWARN is set" name="" value="0x1"/>
        <value caption="No transmit or receive warnings" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receiver in Error State Warning bit (128 &gt; RERRCNT &gt; 95)" name="CFD2TREC__RXWARN">
        <value caption="Indicates that the number of receives errors is less than 128" name="" value="0x1"/>
        <value caption="Indicates that receive errors are greater than or equal to 95" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmitter in Error State Warning bit (128 &gt; TERRCNT &gt; 95)" name="CFD2TREC__TXWARN">
        <value caption="Indicates that the number of transmit errors are less than 128" name="" value="0x1"/>
        <value caption="Indicates that transmit errors are greater than or equal to 95" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receiver in Error State Bus Passive bit (RERRCNT &gt; 127)" name="CFD2TREC__RXBP">
        <value caption="Indicates that the number of receive errors is greater than 127." name="" value="0x1"/>
        <value caption="Indicates that transmit errors are less than or equal to 127" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmitter in Error State Bus Passive bit (TERRCNT &gt; 127)" name="CFD2TREC__TXBP">
        <value caption="Indicates that the number of transmit errors is greater than 127." name="" value="0x1"/>
        <value caption="Indicates that transmit errors are less than or equal to 127" name="" value="0x0"/>
      </value-group>
