Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
      <value-group caption="Identifier Receive Mode bit" name="CFD2MASK5__MIDE">
        <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1"/>
        <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD2FLTOBJ6__SID11">
        <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1"/>
        <value caption="Do not use extended standard Identifier bits" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD2FLTOBJ6__EXIDE">
        <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1"/>
        <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD2MASK6__MSID11">
        <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1"/>
        <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD2MASK6__MIDE">
        <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1"/>
        <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD2FLTOBJ7__SID11">
        <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1"/>
        <value caption="Do not use extended standard Identifier bits" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD2FLTOBJ7__EXIDE">
        <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1"/>
        <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD2MASK7__MSID11">
        <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1"/>
        <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD2MASK7__MIDE">
        <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1"/>
        <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD2FLTOBJ8__SID11">
        <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1"/>
        <value caption="Do not use extended standard Identifier bits" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD2FLTOBJ8__EXIDE">
        <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1"/>
        <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD2MASK8__MSID11">
        <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1"/>
        <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD2MASK8__MIDE">
        <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1"/>
        <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD2FLTOBJ9__SID11">
        <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1"/>
        <value caption="Do not use extended standard Identifier bits" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD2FLTOBJ9__EXIDE">
        <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1"/>
        <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD2MASK9__MSID11">
        <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1"/>
        <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD2MASK9__MIDE">
        <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1"/>
        <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD2FLTOBJ10__SID11">
        <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1"/>
        <value caption="Do not use extended standard Identifier bits" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD2FLTOBJ10__EXIDE">
        <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1"/>
        <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD2MASK10__MSID11">
        <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1"/>
        <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0"/>
      </value-group>
