Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
    <module caption="" id="03337" name="CFG" version="">
      <register-group name="CFG">
        <register caption="" initval="0x20800009" name="CFGCON0" offset="0x0" rw="RW" size="4">
          <bitfield caption="TDO control for 2 wire JTAG protocol" mask="0x00000001" name="TDOEN" values="CFGCON0__TDOEN"/>
          <bitfield caption="Trace clock control bit" mask="0x00000004" name="TROEN" values="CFGCON0__TROEN"/>
          <bitfield caption="JTAG control bit" mask="0x00000008" name="JTAGEN" values="CFGCON0__JTAGEN"/>
          <bitfield caption="FC arbitration Priority to SRAM" mask="0x00000020" name="FCPRI" values="CFGCON0__FCPRI"/>
          <bitfield caption="DMAR and DMAW arbitration Priority to SRAM" mask="0x00000040" name="DMAPRI" values="CFGCON0__DMAPRI"/>
          <bitfield caption="CPU arbitration Priority to SRAM when servicing an Interrupt" mask="0x00000080" name="EXLPRI" values="CFGCON0__EXLPRI"/>
          <bitfield caption="USB Suspend Sleep Enable" mask="0x00000100" name="USBSSEN" values="CFGCON0__USBSSEN"/>
          <bitfield caption="PMU Controller Register LOCK" mask="0x00000400" name="PMULOCK" values="CFGCON0__PMULOCK"/>
          <bitfield caption="Permission Group LOCK" mask="0x00000800" name="PGLOCK" values="CFGCON0__PGLOCK"/>
          <bitfield caption="Peripheral Module Disable (PMD) LOCK" mask="0x00001000" name="PMDLOCK" values="CFGCON0__PMDLOCK"/>
          <bitfield caption="IO LOCK" mask="0x00002000" name="IOLOCK" values="CFGCON0__IOLOCK"/>
          <bitfield caption="Configuration Register Lock" mask="0x0000C000" name="CFGLOCK" values="CFGCON0__CFGLOCK"/>
          <bitfield caption="OCMP Alternate Clock Selection" mask="0x00010000" name="OC_ACLK" values="CFGCON0__OC_ACLK"/>
          <bitfield caption="ICAP Alternate Clock Selection" mask="0x00020000" name="IC_ACLK" values="CFGCON0__IC_ACLK"/>
          <bitfield caption="CAN-FD Back-up Clock Divider" mask="0x00300000" name="CANFDDIV" values="CFGCON0__CANFDDIV"/>
          <bitfield caption="PCHE I/D Cacheable Mode" mask="0x00800000" name="PCM" values="CFGCON0__PCM"/>
          <bitfield caption="UPLL HW Control Mode for PWDN and RESET" mask="0x01000000" name="UPLLHWMD" values="CFGCON0__UPLLHWMD"/>
          <bitfield caption="SPLL HW Control Mode for PWDN and RESET" mask="0x02000000" name="SPLLHWMD" values="CFGCON0__SPLLHWMD"/>
          <bitfield caption="BTPLL HW Control Mode for PWDN and RESET" mask="0x04000000" name="BTPLLHWMD" values="CFGCON0__BTPLLHWMD"/>
          <bitfield caption="EWPLL HW Control Mode for PWDN and RESET" mask="0x08000000" name="ETHPLLHWMD" values="CFGCON0__ETHPLLHWMD"/>
          <bitfield caption="Flash ECC Control" mask="0x30000000" name="FECCCON" values="CFGCON0__FECCCON"/>
          <bitfield caption="Ethernet Tx SOF enabled for CTR measurements" mask="0x40000000" name="ETHTPSF" values="CFGCON0__ETHTPSF"/>
          <bitfield caption="External Programming Clock enable" mask="0x80000000" name="EPGMCLK" values="CFGCON0__EPGMCLK"/>
        </register>
        <register caption="CONFIGURATION CONTROL REGISTER 1" initval="0x00009C30" name="CFGCON1" offset="0x10" rw="RW" size="4">
          <bitfield caption="Background Debugger Access Selection" mask="0x00000003" name="DEBUG" values="CFGCON1__DEBUG"/>
          <bitfield caption="EMUC/EMUD Communication Channel Select" mask="0x00000018" name="ICESEL" values="CFGCON1__ICESEL"/>
          <bitfield caption="Trace Enable" mask="0x00000020" name="TRCEN" values="CFGCON1__TRCEN"/>
          <bitfield caption="Ethernet1 MII Enable" mask="0x00000100" name="FMIIEN" values="CFGCON1__FMIIEN"/>
          <bitfield caption="Exclusive Ethernet PYHY reference clock Enable" mask="0x00000200" name="ETHEXEREF" values="CFGCON1__ETHEXEREF"/>
          <bitfield caption="Disable CLASSB Device Functionality" mask="0x00000400" name="CLASSBDIS" values="CFGCON1__CLASSBDIS"/>
          <bitfield caption="USB USBID Selection bit" mask="0x00000800" name="USBIDIO" values="CFGCON1__USBIDIO"/>
          <bitfield caption="USB VBUS_ON Selection bit" mask="0x00001000" name="VBUSIO" values="CFGCON1__VBUSIO"/>
          <bitfield caption="High Speed Mode Enable (SPI-1)" mask="0x00002000" name="HSSPIEN" values="CFGCON1__HSSPIEN"/>
          <bitfield caption="Selects CRU handling of MCLR Control" mask="0x00004000" name="SMCLR" values="CFGCON1__SMCLR"/>
          <bitfield caption="UART1 High Speed Mode Enable" mask="0x00008000" name="HSUARTEN" values="CFGCON1__HSUARTEN"/>
          <bitfield caption="USB DP Rise/Fall Trim fuse bits" mask="0x000F0000" name="USBDMTRIM" values="CFGCON1__USBDMTRIM"/>
          <bitfield caption="USB DM Rise/Fall Trim fuse bits" mask="0x00F00000" name="USBDPTRIM" values="CFGCON1__USBDPTRIM"/>
          <bitfield caption="Watchdog Timer Post-scale Select Sleep bits" mask="0x1F000000" name="WDTPSS" values="CFGCON1__WDTPSS"/>
        </register>
        <register caption="CONFIGURATION CONTROL REGISTER 2" initval="0x5F60FE30" name="CFGCON2" offset="0x20" rw="RW" size="4">
          <bitfield caption="Dead Man Timer Count Window Interval bits" mask="0x00000038" name="DMTINTV" values="CFGCON2__DMTINTV"/>
          <bitfield caption="Primary Oscillator Configuration bits" mask="0x00000300" name="POSCMOD" values="CFGCON2__POSCMOD"/>
          <bitfield caption="WDT RUN Mode Clock Select" mask="0x00000C00" name="WDTRMCS" values="CFGCON2__WDTRMCS"/>
          <bitfield caption="SOSC Selection Configuration bit" mask="0x00001000" name="SOSCSEL" values="CFGCON2__SOSCSEL"/>
          <bitfield caption="2-Speed startup enabled in Sleep mode bit" mask="0x00002000" name="WAKE2SPD" values="CFGCON2__WAKE2SPD"/>
          <bitfield caption="Software Clock Switching Enable" mask="0x00004000" name="CKSWEN" values="CFGCON2__CKSWEN"/>
          <bitfield caption="Fail-Safe Clock Monitor Enable" mask="0x00008000" name="FSCMEN" values="CFGCON2__FSCMEN"/>
          <bitfield caption="Watchdog Timer Post-scale Select Run bits" mask="0x001F0000" name="WDTPSR" values="CFGCON2__WDTPSR"/>
          <bitfield caption="Watchdog Timer Stop during Flash Programming bit" mask="0x00200000" name="WDTSPGM" values="CFGCON2__WDTSPGM"/>
          <bitfield caption="Windowed Watchdog Timer Disable bit" mask="0x00400000" name="WINDIS" values="CFGCON2__WINDIS"/>
          <bitfield caption="Watchdog Timer Enable bit" mask="0x00800000" name="WDTEN" values="CFGCON2__WDTEN"/>
          <bitfield caption="Watchdog Timer Window Size bits" mask="0x03000000" name="WDTWINSZ" values="CFGCON2__WDTWINSZ"/>
          <bitfield caption="Dead Man Timer Count Select bits" mask="0x7C000000" name="DMTCNT" values="CFGCON2__DMTCNT"/>
          <bitfield caption="Dead Man Timer Enable bit" mask="0x80000000" name="DMTEN" values="CFGCON2__DMTEN"/>
        </register>
