Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
        <register caption="CONFIGURATION CONTROL REGISTER 3" initval="0xA" name="CFGCON3" offset="0x30" rw="RW" size="4">
          <bitfield caption="EWPLL Post Divider bits for controlling second PLL clock output for WiFI" mask="0x0000003F" name="ETHPLLPOSTDIV2" values="CFGCON3__ETHPLLPOSTDIV2"/>
          <bitfield caption="SPLL Post Divider bits for controlling auxiliary second PLL clock output." mask="0x00000FC0" name="SPLLPOSTDIV2" values="CFGCON3__SPLLPOSTDIV2"/>
          <bitfield caption="BTPLL Post Divider bits for controlling auxiliary second PLL clock output." mask="0x0003F000" name="BTPLLPOSTDIV2" values="CFGCON3__BTPLLPOSTDIV2"/>
        </register>
        <register caption="CONFIGURATION CONTROL REGISTER 4" initval="0x04180000" name="CFGCON4" offset="0x40" rw="RW" size="4">
          <bitfield caption="SOSC Configuration Bits" mask="0x000000FF" name="SOSCCFG" values="CFGCON4__SOSCCFG"/>
          <bitfield caption="VBAT Zero-Power BOR Enable bit" mask="0x00080000" name="VBZPBOREN" values="CFGCON4__VBZPBOREN"/>
          <bitfield caption="Deep Sleep Zero-Power BOR Enable bit" mask="0x00100000" name="DSZPBOREN" values="CFGCON4__DSZPBOREN"/>
          <bitfield caption="Deep Sleep Watchdog Timer Postscale Select bits" mask="0x03E00000" name="DSWDTPS" values="CFGCON4__DSWDTPS"/>
          <bitfield caption="Deep Sleep Watchdog Timer Reference Clock Select bit" mask="0x04000000" name="DSWDTOSC" values="CFGCON4__DSWDTOSC"/>
          <bitfield caption="Deep Sleep Watchdog Timer Enable bit" mask="0x08000000" name="DSWDTEN" values="CFGCON4__DSWDTEN"/>
          <bitfield caption="Deep Sleep Bit Enable bit" mask="0x10000000" name="DSEN" values="CFGCON4__DSEN"/>
          <bitfield caption="Low Power (Secondary) Oscillator Enable bit" mask="0x40000000" name="SOSCEN" values="CFGCON4__SOSCEN"/>
        </register>
        <register caption="PERMISSION GROUP CONFIGURATION REGISTER" initval="0x0" name="CFGPG" offset="0x50" rw="RW" size="4">
          <bitfield caption="CPU (Code) Permission Group" mask="0x00000003" name="CPUPG" values="CFGPG__CPUPG"/>
          <bitfield caption="FC Permission Group" mask="0x0000000C" name="FCPG" values="CFGPG__FCPG"/>
          <bitfield caption="DMA Permission Group" mask="0x00000030" name="DMAPG" values="CFGPG__DMAPG"/>
          <bitfield caption="ICD-JTAG Permission Group" mask="0x000000C0" name="ICDJPG" values="CFGPG__ICDJPG"/>
          <bitfield caption="WIFI Permission Group" mask="0x00000300" name="WIFIPG" values="CFGPG__WIFIPG"/>
          <bitfield caption="ADC Permission Group" mask="0x00000C00" name="ADCPG" values="CFGPG__ADCPG"/>
          <bitfield caption="CAN1 Permission Group" mask="0x00003000" name="CAN1PG" values="CFGPG__CAN1PG"/>
          <bitfield caption="CAN2 Permission Group" mask="0x0000C000" name="CAN2PG" values="CFGPG__CAN2PG"/>
          <bitfield caption="CRY1 Permission Group" mask="0x00030000" name="CRY1PG" values="CFGPG__CRY1PG"/>
          <bitfield caption="ETH Permission Group" mask="0x000C0000" name="ETHPG" values="CFGPG__ETHPG"/>
          <bitfield caption="SQI Permission Group- drive directly the inputs cfg_sqi_pg[1-0] to the SSX" mask="0x00300000" name="SQIPG" values="CFGPG__SQIPG"/>
          <bitfield caption="USB Permission Group- drive directly the inputs cfg_usb_pg[1-0] to the SSX" mask="0x00C00000" name="USBPG" values="CFGPG__USBPG"/>
        </register>
        <register caption="" name="DEVID" offset="0x60" rw="R" size="4">
          <bitfield mask="0x0FFFFFFF" name="DEVID"/>
          <bitfield mask="0xF0000000" name="VER"/>
        </register>
        <register caption="USER UNIQUE ID REGISTER" name="USERID" offset="0x70" rw="RW" size="4">
          <bitfield caption="User ID" mask="0x0000FFFF" name="USERID" values="FUSERID__USERID"/>
        </register>
        <register caption="SYSTEM KEY REGISTER" name="SYSKEY" offset="0x80" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="SYSKEY"/>
        </register>
        <register caption="PERIPHERAL MODULE DISABLE 1 REGISTER" name="PMD1" offset="0x90" rw="RW" size="4">
          <bitfield caption="ADC SAR Core 0 Module Disable bit" mask="0x00000001" name="ADCSAR0MD" values="PMD1__ADCSAR0MD"/>
          <bitfield caption="Shared ADC SAR Core Module Disable bit" mask="0x00000080" name="ADCSARSHRMD" values="PMD1__ADCSARSHRMD"/>
          <bitfield caption="ADC Controller Module Disable" mask="0x00000100" name="ADC1MD" values="PMD1__ADC1MD"/>
          <bitfield caption="PTG Module Disable" mask="0x00000800" name="PTGMD" values="PMD1__PTGMD"/>
          <bitfield caption="CVD Module Disable" mask="0x00008000" name="CVD1MD" values="PMD1__CVD1MD"/>
          <bitfield caption="RTCC Module Disable (Unused at top level- part of XDS controller SFR)" mask="0x00010000" name="RTCC1MD" values="PMD1__RTCC1MD"/>
          <bitfield caption="DMA Controller Module Disable" mask="0x00080000" name="DMA1MD" values="PMD1__DMA1MD"/>
          <bitfield caption="BA414E Module Disable" mask="0x00800000" name="BA414MD" values="PMD1__BA414MD"/>
          <bitfield caption="CRYPTO1 Module Disable" mask="0x01000000" name="CRYPT1MD" values="PMD1__CRYPT1MD"/>
          <bitfield caption="RNG1 Module Disable" mask="0x04000000" name="RNG1MD" values="PMD1__RNG1MD"/>
          <bitfield caption="SQI Module Disable" mask="0x20000000" name="SQI1MD" values="PMD1__SQI1MD"/>
        </register>
        <register caption="PERIPHERAL MODULE DISABLE 2 REGISTER" name="PMD2" offset="0xa0" rw="RW" size="4">
          <bitfield caption="Input Capture 1 Module Disable" mask="0x00000001" name="IC1MD" values="PMD2__IC1MD"/>
          <bitfield caption="Input Capture 2 Module Disable" mask="0x00000002" name="IC2MD" values="PMD2__IC2MD"/>
          <bitfield caption="Input Capture 3 Module Disable" mask="0x00000004" name="IC3MD" values="PMD2__IC3MD"/>
          <bitfield caption="Input Capture 4 Module Disable" mask="0x00000008" name="IC4MD" values="PMD2__IC4MD"/>
          <bitfield caption="Output Compare 1 Module Disable bit" mask="0x00000100" name="OC1MD" values="PMD2__OC1MD"/>
          <bitfield caption="Output Compare 2 Module Disable bit" mask="0x00000200" name="OC2MD" values="PMD2__OC2MD"/>
          <bitfield caption="Output Compare 3 Module Disable bit" mask="0x00000400" name="OC3MD" values="PMD2__OC3MD"/>
          <bitfield caption="Output Compare 4 Module Disable bit" mask="0x00000800" name="OC4MD" values="PMD2__OC4MD"/>
          <bitfield caption="Timer 1 Module Disable" mask="0x00010000" name="T1MD" values="PMD2__T1MD"/>
          <bitfield caption="Timer 2 Module Disable" mask="0x00020000" name="T2MD" values="PMD2__T2MD"/>
          <bitfield caption="Timer 3 Module Disable" mask="0x00040000" name="T3MD" values="PMD2__T3MD"/>
          <bitfield caption="Timer 4 Module Disable" mask="0x00080000" name="T4MD" values="PMD2__T4MD"/>
          <bitfield caption="Timer 5 Module Disable" mask="0x00100000" name="T5MD" values="PMD2__T5MD"/>
          <bitfield caption="Timer 6 Module Disable" mask="0x00200000" name="T6MD" values="PMD2__T6MD"/>
          <bitfield caption="Timer 7 Module Disable" mask="0x00400000" name="T7MD" values="PMD2__T7MD"/>
          <bitfield caption="Reference (Clock) Out 1 Module Disable" mask="0x10000000" name="REFO1MD" values="PMD2__REFO1MD"/>
          <bitfield caption="Reference (Clock) Out 2 Module Disable" mask="0x20000000" name="REFO2MD" values="PMD2__REFO2MD"/>
          <bitfield caption="Reference (Clock) Out 3 Module Disable" mask="0x40000000" name="REFO3MD" values="PMD2__REFO3MD"/>
          <bitfield caption="Reference (Clock) Out 4 Module Disable" mask="0x80000000" name="REFO4MD" values="PMD2__REFO4MD"/>
        </register>
        <register caption="PERIPHERAL MODULE DISABLE 3 REGISTER" name="PMD3" offset="0xb0" rw="RW" size="4">
          <bitfield caption="UART Module Disable" mask="0x00000001" name="U1MD" values="PMD3__U1MD"/>
          <bitfield caption="UART Module Disable" mask="0x00000002" name="U2MD" values="PMD3__U2MD"/>
          <bitfield caption="UART Module Disable" mask="0x00000004" name="U3MD" values="PMD3__U3MD"/>
          <bitfield caption="Ethernet Module Disable" mask="0x00000010" name="ETH1MD" values="PMD3__ETH1MD"/>
          <bitfield caption="SPI 1 Module Disable" mask="0x00000100" name="SPI1MD" values="PMD3__SPI1MD"/>
          <bitfield caption="SPI 2 Module Disable" mask="0x00000200" name="SPI2MD" values="PMD3__SPI2MD"/>
          <bitfield caption="WiFi Module Disable" mask="0x00001000" name="W24GMD" values="PMD3__W24GMD"/>
          <bitfield caption="I2C 1 Module Disable" mask="0x00010000" name="I2C1MD" values="PMD3__I2C1MD"/>
          <bitfield caption="I2C 2 Module Disable" mask="0x00020000" name="I2C2MD" values="PMD3__I2C2MD"/>
          <bitfield caption="USB Module Disable bit" mask="0x01000000" name="USB1MD" values="PMD3__USB1MD"/>
          <bitfield caption="CAN Module Disable bit" mask="0x08000000" name="CAN1MD" values="PMD3__CAN1MD"/>
          <bitfield caption="CAN Module Disable bit" mask="0x10000000" name="CAN2MD" values="PMD3__CAN2MD"/>
        </register>
      </register-group>
