Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
      <value-group caption="Reference Frequency Divide, 1 to 63" name="SPLLCON__SPLLREFDIV">
        <value caption="Reference frequency divide by 1" name="REFDIV_1" value="0x1"/>
        <value caption="Reference frequency divide by 2" name="REFDIV_2" value="0x2"/>
        <value caption="Reference frequency divide by 3" name="REFDIV_3" value="0x3"/>
        <value caption="Reference frequency divide by 4" name="REFDIV_4" value="0x4"/>
        <value caption="Reference frequency divide by 5" name="REFDIV_5" value="0x5"/>
        <value caption="Reference frequency divide by 6" name="REFDIV_6" value="0x6"/>
        <value caption="Reference frequency divide by 7" name="REFDIV_7" value="0x7"/>
        <value caption="Reference frequency divide by 8" name="REFDIV_8" value="0x8"/>
        <value caption="Reference frequency divide by 9" name="REFDIV_9" value="0x9"/>
        <value caption="Reference frequency divide by 10" name="REFDIV_10" value="0xa"/>
        <value caption="Reference frequency divide by 11" name="REFDIV_11" value="0xb"/>
        <value caption="Reference frequency divide by 12" name="REFDIV_12" value="0xc"/>
        <value caption="Reference frequency divide by 13" name="REFDIV_13" value="0xd"/>
        <value caption="Reference frequency divide by 14" name="REFDIV_14" value="0xe"/>
        <value caption="Reference frequency divide by 15" name="REFDIV_15" value="0xf"/>
        <value caption="Reference frequency divide by 16" name="REFDIV_16" value="0x10"/>
        <value caption="Reference frequency divide by 17" name="REFDIV_17" value="0x11"/>
        <value caption="Reference frequency divide by 18" name="REFDIV_18" value="0x12"/>
        <value caption="Reference frequency divide by 19" name="REFDIV_19" value="0x13"/>
        <value caption="Reference frequency divide by 20" name="REFDIV_20" value="0x14"/>
        <value caption="Reference frequency divide by 21" name="REFDIV_21" value="0x15"/>
        <value caption="Reference frequency divide by 22" name="REFDIV_22" value="0x16"/>
        <value caption="Reference frequency divide by 23" name="REFDIV_23" value="0x17"/>
        <value caption="Reference frequency divide by 24" name="REFDIV_24" value="0x18"/>
        <value caption="Reference frequency divide by 25" name="REFDIV_25" value="0x19"/>
        <value caption="Reference frequency divide by 26" name="REFDIV_26" value="0x1a"/>
        <value caption="Reference frequency divide by 27" name="REFDIV_27" value="0x1b"/>
        <value caption="Reference frequency divide by 28" name="REFDIV_28" value="0x1c"/>
        <value caption="Reference frequency divide by 29" name="REFDIV_29" value="0x1d"/>
        <value caption="Reference frequency divide by 30" name="REFDIV_30" value="0x1e"/>
        <value caption="Reference frequency divide by 31" name="REFDIV_31" value="0x1f"/>
        <value caption="Reference frequency divide by 32" name="REFDIV_32" value="0x20"/>
        <value caption="Reference frequency divide by 33" name="REFDIV_33" value="0x21"/>
        <value caption="Reference frequency divide by 34" name="REFDIV_34" value="0x22"/>
        <value caption="Reference frequency divide by 35" name="REFDIV_35" value="0x23"/>
        <value caption="Reference frequency divide by 36" name="REFDIV_36" value="0x24"/>
        <value caption="Reference frequency divide by 37" name="REFDIV_37" value="0x25"/>
        <value caption="Reference frequency divide by 38" name="REFDIV_38" value="0x26"/>
        <value caption="Reference frequency divide by 39" name="REFDIV_39" value="0x27"/>
        <value caption="Reference frequency divide by 40" name="REFDIV_40" value="0x28"/>
        <value caption="Reference frequency divide by 41" name="REFDIV_41" value="0x29"/>
        <value caption="Reference frequency divide by 42" name="REFDIV_42" value="0x2a"/>
        <value caption="Reference frequency divide by 43" name="REFDIV_43" value="0x2b"/>
        <value caption="Reference frequency divide by 44" name="REFDIV_44" value="0x2c"/>
        <value caption="Reference frequency divide by 45" name="REFDIV_45" value="0x2d"/>
        <value caption="Reference frequency divide by 46" name="REFDIV_46" value="0x2e"/>
        <value caption="Reference frequency divide by 47" name="REFDIV_47" value="0x2f"/>
        <value caption="Reference frequency divide by 48" name="REFDIV_48" value="0x30"/>
        <value caption="Reference frequency divide by 49" name="REFDIV_49" value="0x31"/>
        <value caption="Reference frequency divide by 50" name="REFDIV_50" value="0x32"/>
        <value caption="Reference frequency divide by 51" name="REFDIV_51" value="0x33"/>
        <value caption="Reference frequency divide by 52" name="REFDIV_52" value="0x34"/>
        <value caption="Reference frequency divide by 53" name="REFDIV_53" value="0x35"/>
        <value caption="Reference frequency divide by 54" name="REFDIV_54" value="0x36"/>
        <value caption="Reference frequency divide by 55" name="REFDIV_55" value="0x37"/>
        <value caption="Reference frequency divide by 56" name="REFDIV_56" value="0x38"/>
        <value caption="Reference frequency divide by 57" name="REFDIV_57" value="0x39"/>
        <value caption="Reference frequency divide by 58" name="REFDIV_58" value="0x3a"/>
        <value caption="Reference frequency divide by 59" name="REFDIV_59" value="0x3b"/>
        <value caption="Reference frequency divide by 60" name="REFDIV_60" value="0x3c"/>
        <value caption="Reference frequency divide by 61" name="REFDIV_61" value="0x3d"/>
        <value caption="Reference frequency divide by 62" name="REFDIV_62" value="0x3e"/>
        <value caption="Reference frequency divide by 63" name="REFDIV_63" value="0x3f"/>
      </value-group>
      <value-group caption="System PLL Lock Status bit (Read-only)" name="SPLLCON__SLOCK">
        <value caption="Indicates that SPLL is in lock." name="IN_LOCK" value="0x1"/>
        <value caption="Indicates that SPLL is out of lock, start-up timer is in progress, or is turned-off." name="OUT_OF_LOCK" value="0x0"/>
      </value-group>
      <value-group caption="Source Input Clock Selection bit" name="SPLLCON__SPLLICLK">
        <value caption="POSC is the SPLL input clock source." name="POSC" value="0x0"/>
        <value caption="FRC is the SPLL input clock source." name="FRC" value="0x1"/>
      </value-group>
      <value-group caption="SPLL Bypass; when this bit is set, the input clock REF bypasses PLL to PLLOUTx." name="SPLLCON__SPLL_BYP">
        <value caption="The input clock REF bypasses PLL to PLLOUTx" name="BYPASS" value="0x1"/>
        <value caption="The input clock REF does not bypass PLL to PLLOUTx" name="NO_BYPASS" value="0x0"/>
      </value-group>
      <value-group caption="PLL Power Down Register bit" name="UPLLCON__UPLLPWDN">
        <value caption="PLL is powered down" name="PLL_OFF" value="0x1"/>
        <value caption="PLL is active" name="PLL_ON" value="0x0"/>
      </value-group>
      <value-group caption="First Post Divide Value. " name="UPLLCON__UPLLPOSTDIV1">
        <value caption="First post divide by 1" name="" value="0x1"/>
        <value caption="First post divide by 2" name="" value="0x2"/>
        <value caption="First post divide by 3" name="" value="0x3"/>
        <value caption="First post divide by 4" name="" value="0x4"/>
        <value caption="First post divide by 5" name="" value="0x5"/>
        <value caption="First post divide by 6" name="" value="0x6"/>
        <value caption="First post divide by 7" name="" value="0x7"/>
        <value caption="First post divide by 8" name="" value="0x8"/>
        <value caption="First post divide by 9" name="" value="0x9"/>
        <value caption="First post divide by 10" name="" value="0xa"/>
        <value caption="First post divide by 11" name="" value="0xb"/>
        <value caption="First post divide by 12" name="" value="0xc"/>
        <value caption="First post divide by 13" name="" value="0xd"/>
        <value caption="First post divide by 14" name="" value="0xe"/>
        <value caption="First post divide by 15" name="" value="0xf"/>
        <value caption="First post divide by 16" name="" value="0x10"/>
        <value caption="First post divide by 17" name="" value="0x11"/>
        <value caption="First post divide by 18" name="" value="0x12"/>
        <value caption="First post divide by 19" name="" value="0x13"/>
        <value caption="First post divide by 20" name="" value="0x14"/>
        <value caption="First post divide by 21" name="" value="0x15"/>
        <value caption="First post divide by 22" name="" value="0x16"/>
        <value caption="First post divide by 23" name="" value="0x17"/>
        <value caption="First post divide by 24" name="" value="0x18"/>
        <value caption="First post divide by 25" name="" value="0x19"/>
        <value caption="First post divide by 26" name="" value="0x1a"/>
        <value caption="First post divide by 27" name="" value="0x1b"/>
        <value caption="First post divide by 28" name="" value="0x1c"/>
        <value caption="First post divide by 29" name="" value="0x1d"/>
        <value caption="First post divide by 30" name="" value="0x1e"/>
        <value caption="First post divide by 31" name="" value="0x1f"/>
        <value caption="First post divide by 32" name="" value="0x20"/>
        <value caption="First post divide by 33" name="" value="0x21"/>
        <value caption="First post divide by 34" name="" value="0x22"/>
        <value caption="First post divide by 35" name="" value="0x23"/>
        <value caption="First post divide by 36" name="" value="0x24"/>
        <value caption="First post divide by 37" name="" value="0x25"/>
        <value caption="First post divide by 38" name="" value="0x26"/>
        <value caption="First post divide by 39" name="" value="0x27"/>
        <value caption="First post divide by 40" name="" value="0x28"/>
        <value caption="First post divide by 41" name="" value="0x29"/>
        <value caption="First post divide by 42" name="" value="0x2a"/>
        <value caption="First post divide by 43" name="" value="0x2b"/>
        <value caption="First post divide by 44" name="" value="0x2c"/>
        <value caption="First post divide by 45" name="" value="0x2d"/>
        <value caption="First post divide by 46" name="" value="0x2e"/>
        <value caption="First post divide by 47" name="" value="0x2f"/>
        <value caption="First post divide by 48" name="" value="0x30"/>
        <value caption="First post divide by 49" name="" value="0x31"/>
        <value caption="First post divide by 50" name="" value="0x32"/>
        <value caption="First post divide by 51" name="" value="0x33"/>
        <value caption="First post divide by 52" name="" value="0x34"/>
        <value caption="First post divide by 53" name="" value="0x35"/>
        <value caption="First post divide by 54" name="" value="0x36"/>
        <value caption="First post divide by 55" name="" value="0x37"/>
        <value caption="First post divide by 56" name="" value="0x38"/>
        <value caption="First post divide by 57" name="" value="0x39"/>
        <value caption="First post divide by 58" name="" value="0x3a"/>
        <value caption="First post divide by 59" name="" value="0x3b"/>
        <value caption="First post divide by 60" name="" value="0x3c"/>
        <value caption="First post divide by 61" name="" value="0x3d"/>
        <value caption="First post divide by 62" name="" value="0x3e"/>
        <value caption="First post divide by 63" name="" value="0x3f"/>
      </value-group>
      <value-group caption="USB PLL Force Lock" name="UPLLCON__UPLLFLOCK">
        <value caption="Force the UPLL lock signal to be asserted" name="FORCE_LOCK" value="0x1"/>
        <value caption="Do not force the UPLL lock signal to be asserted" name="NOFORCE_LOCK" value="0x0"/>
      </value-group>
      <value-group caption="USB PLL Reset" name="UPLLCON__UPLLRST">
        <value caption="Assert the reset to the UPLL" name="ASSERT_RST" value="0x1"/>
        <value caption="De-assert the reset to the UPLL" name="DEASSERT_RST" value="0x0"/>
      </value-group>
      <value-group caption="PLL feedback divider, 16 to 1023" name="UPLLCON__UPLLFBDIV">
        <value caption="PLL feedback divide by 16" name="DIV_16" value="0x10"/>
        <value caption="PLL feedback divide by 17" name="DIV_17" value="0x11"/>
        <value caption="PLL feedback divide by 18" name="DIV_18" value="0x12"/>
        <value caption="PLL feedback divide by 1022" name="DIV_1022" value="0x3fe"/>
        <value caption="PLL feedback divide by 1023" name="DIV_1023" value="0x3ff"/>
      </value-group>
      <value-group caption="Reference Frequency Divide. 1 to 63" name="UPLLCON__UPLLREFDIV">
        <value caption="Reference frequency divide by 1" name="" value="0x1"/>
        <value caption="Reference frequency divide by 2" name="" value="0x2"/>
        <value caption="Reference frequency divide by 3" name="" value="0x3"/>
        <value caption="Reference frequency divide by 4" name="" value="0x4"/>
        <value caption="Reference frequency divide by 5" name="" value="0x5"/>
        <value caption="Reference frequency divide by 6" name="" value="0x6"/>
        <value caption="Reference frequency divide by 7" name="" value="0x7"/>
        <value caption="Reference frequency divide by 8" name="" value="0x8"/>
        <value caption="Reference frequency divide by 9" name="" value="0x9"/>
        <value caption="Reference frequency divide by 10" name="" value="0xa"/>
        <value caption="Reference frequency divide by 11" name="" value="0xb"/>
        <value caption="Reference frequency divide by 12" name="" value="0xc"/>
        <value caption="Reference frequency divide by 13" name="" value="0xd"/>
        <value caption="Reference frequency divide by 14" name="" value="0xe"/>
        <value caption="Reference frequency divide by 15" name="" value="0xf"/>
        <value caption="Reference frequency divide by 16" name="" value="0x10"/>
        <value caption="Reference frequency divide by 17" name="" value="0x11"/>
        <value caption="Reference frequency divide by 18" name="" value="0x12"/>
        <value caption="Reference frequency divide by 19" name="" value="0x13"/>
        <value caption="Reference frequency divide by 20" name="" value="0x14"/>
        <value caption="Reference frequency divide by 21" name="" value="0x15"/>
        <value caption="Reference frequency divide by 22" name="" value="0x16"/>
        <value caption="Reference frequency divide by 23" name="" value="0x17"/>
        <value caption="Reference frequency divide by 24" name="" value="0x18"/>
        <value caption="Reference frequency divide by 25" name="" value="0x19"/>
        <value caption="Reference frequency divide by 26" name="" value="0x1a"/>
        <value caption="Reference frequency divide by 27" name="" value="0x1b"/>
        <value caption="Reference frequency divide by 28" name="" value="0x1c"/>
        <value caption="Reference frequency divide by 29" name="" value="0x1d"/>
        <value caption="Reference frequency divide by 30" name="" value="0x1e"/>
        <value caption="Reference frequency divide by 31" name="" value="0x1f"/>
        <value caption="Reference frequency divide by 32" name="" value="0x20"/>
        <value caption="Reference frequency divide by 33" name="" value="0x21"/>
        <value caption="Reference frequency divide by 34" name="" value="0x22"/>
        <value caption="Reference frequency divide by 35" name="" value="0x23"/>
        <value caption="Reference frequency divide by 36" name="" value="0x24"/>
        <value caption="Reference frequency divide by 37" name="" value="0x25"/>
        <value caption="Reference frequency divide by 38" name="" value="0x26"/>
        <value caption="Reference frequency divide by 39" name="" value="0x27"/>
        <value caption="Reference frequency divide by 40" name="" value="0x28"/>
        <value caption="Reference frequency divide by 41" name="" value="0x29"/>
        <value caption="Reference frequency divide by 42" name="" value="0x2a"/>
        <value caption="Reference frequency divide by 43" name="" value="0x2b"/>
        <value caption="Reference frequency divide by 44" name="" value="0x2c"/>
        <value caption="Reference frequency divide by 45" name="" value="0x2d"/>
        <value caption="Reference frequency divide by 46" name="" value="0x2e"/>
        <value caption="Reference frequency divide by 47" name="" value="0x2f"/>
        <value caption="Reference frequency divide by 48" name="" value="0x30"/>
        <value caption="Reference frequency divide by 49" name="" value="0x31"/>
        <value caption="Reference frequency divide by 50" name="" value="0x32"/>
        <value caption="Reference frequency divide by 51" name="" value="0x33"/>
        <value caption="Reference frequency divide by 52" name="" value="0x34"/>
        <value caption="Reference frequency divide by 53" name="" value="0x35"/>
        <value caption="Reference frequency divide by 54" name="" value="0x36"/>
        <value caption="Reference frequency divide by 55" name="" value="0x37"/>
        <value caption="Reference frequency divide by 56" name="" value="0x38"/>
        <value caption="Reference frequency divide by 57" name="" value="0x39"/>
        <value caption="Reference frequency divide by 58" name="" value="0x3a"/>
        <value caption="Reference frequency divide by 59" name="" value="0x3b"/>
        <value caption="Reference frequency divide by 60" name="" value="0x3c"/>
        <value caption="Reference frequency divide by 61" name="" value="0x3d"/>
        <value caption="Reference frequency divide by 62" name="" value="0x3e"/>
        <value caption="Reference frequency divide by 63" name="" value="0x3f"/>
      </value-group>
