Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
      <value-group caption="BT Clock Out pin Enable Bit" name="BTPLLCON__BTCLKOUTEN">
        <value caption="BT_CLK_OUT Pin is enabled" name="ENABLED" value="0x1"/>
        <value caption="BT_CLK_OUT Pin is disabled" name="DISABLED" value="0x0"/>
      </value-group>
      <value-group caption="BT PLL Lock Status bit (Read-only)" name="BTPLLCON__BTLOCK">
        <value caption="Indicates that BTPLL is in lock." name="" value="0x1"/>
        <value caption="Indicates that BTPLL is out of lock, start-up timer is in progress, or is turned-off." name="" value="0x0"/>
      </value-group>
      <value-group caption="Source Input Clock Selection bit" name="BTPLLCON__BTPLLCLK">
        <value caption="POSC is the BTPLL input clock source." name="POSC" value="0x0"/>
        <value caption="FRC is the BTPLL input clock source." name="FRC" value="0x1"/>
      </value-group>
      <value-group caption="BTPLL Bypass" name="BTPLLCON__BTPLL_BYP">
        <value caption="input clock REF bypasses PLL to PLLOUTx" name="BYPASS" value="0x1"/>
        <value caption="input clock REF does not bypass PLL to PLLOUTx" name="NO_BYPASS" value="0x0"/>
      </value-group>
      <value-group caption="PLL Power Down Register bit" name="EWPLLCON__EWPLLPWDN">
        <value caption="PLL is powered down" name="PLL_OFF" value="0x1"/>
        <value caption="PLL is active" name="PLL_ON" value="0x0"/>
      </value-group>
      <value-group caption="First Post Divide Value" name="EWPLLCON__EWPLLPOSTDIV1">
        <value caption="First post divide by 1" name="" value="0x1"/>
        <value caption="First post divide by 2" name="" value="0x2"/>
        <value caption="First post divide by 3" name="" value="0x3"/>
        <value caption="First post divide by 4" name="" value="0x4"/>
        <value caption="First post divide by 5" name="" value="0x5"/>
        <value caption="First post divide by 6" name="" value="0x6"/>
        <value caption="First post divide by 7" name="" value="0x7"/>
        <value caption="First post divide by 8" name="" value="0x8"/>
        <value caption="First post divide by 9" name="" value="0x9"/>
        <value caption="First post divide by 10" name="" value="0xa"/>
        <value caption="First post divide by 11" name="" value="0xb"/>
        <value caption="First post divide by 12" name="" value="0xc"/>
        <value caption="First post divide by 13" name="" value="0xd"/>
        <value caption="First post divide by 14" name="" value="0xe"/>
        <value caption="First post divide by 15" name="" value="0xf"/>
        <value caption="First post divide by 16" name="" value="0x10"/>
        <value caption="First post divide by 17" name="" value="0x11"/>
        <value caption="First post divide by 18" name="" value="0x12"/>
        <value caption="First post divide by 19" name="" value="0x13"/>
        <value caption="First post divide by 20" name="" value="0x14"/>
        <value caption="First post divide by 21" name="" value="0x15"/>
        <value caption="First post divide by 22" name="" value="0x16"/>
        <value caption="First post divide by 23" name="" value="0x17"/>
        <value caption="First post divide by 24" name="" value="0x18"/>
        <value caption="First post divide by 25" name="" value="0x19"/>
        <value caption="First post divide by 26" name="" value="0x1a"/>
        <value caption="First post divide by 27" name="" value="0x1b"/>
        <value caption="First post divide by 28" name="" value="0x1c"/>
        <value caption="First post divide by 29" name="" value="0x1d"/>
        <value caption="First post divide by 30" name="" value="0x1e"/>
        <value caption="First post divide by 31" name="" value="0x1f"/>
        <value caption="First post divide by 32" name="" value="0x20"/>
        <value caption="First post divide by 33" name="" value="0x21"/>
        <value caption="First post divide by 34" name="" value="0x22"/>
        <value caption="First post divide by 35" name="" value="0x23"/>
        <value caption="First post divide by 36" name="" value="0x24"/>
        <value caption="First post divide by 37" name="" value="0x25"/>
        <value caption="First post divide by 38" name="" value="0x26"/>
        <value caption="First post divide by 39" name="" value="0x27"/>
        <value caption="First post divide by 40" name="" value="0x28"/>
        <value caption="First post divide by 41" name="" value="0x29"/>
        <value caption="First post divide by 42" name="" value="0x2a"/>
        <value caption="First post divide by 43" name="" value="0x2b"/>
        <value caption="First post divide by 44" name="" value="0x2c"/>
        <value caption="First post divide by 45" name="" value="0x2d"/>
        <value caption="First post divide by 46" name="" value="0x2e"/>
        <value caption="First post divide by 47" name="" value="0x2f"/>
        <value caption="First post divide by 48" name="" value="0x30"/>
        <value caption="First post divide by 49" name="" value="0x31"/>
        <value caption="First post divide by 50" name="" value="0x32"/>
        <value caption="First post divide by 51" name="" value="0x33"/>
        <value caption="First post divide by 52" name="" value="0x34"/>
        <value caption="First post divide by 53" name="" value="0x35"/>
        <value caption="First post divide by 54" name="" value="0x36"/>
        <value caption="First post divide by 55" name="" value="0x37"/>
        <value caption="First post divide by 56" name="" value="0x38"/>
        <value caption="First post divide by 57" name="" value="0x39"/>
        <value caption="First post divide by 58" name="" value="0x3a"/>
        <value caption="First post divide by 59" name="" value="0x3b"/>
        <value caption="First post divide by 60" name="" value="0x3c"/>
        <value caption="First post divide by 61" name="" value="0x3d"/>
        <value caption="First post divide by 62" name="" value="0x3e"/>
        <value caption="First post divide by 63" name="" value="0x3f"/>
      </value-group>
      <value-group caption="EW PLL Force Lock" name="EWPLLCON__EWPLLFLOCK">
        <value caption="Force the EWPLL lock signal to be asserted" name="FORCE_ASSERT" value="0x1"/>
        <value caption="Do not force the EWPLL lock signal to be asserted" name="NO_FORCE" value="0x0"/>
      </value-group>
      <value-group caption="EW PLL Reset" name="EWPLLCON__EWPLLRST">
        <value caption="Assert the reset to the EWPLL" name="RESET_EWPLL" value="0x1"/>
        <value caption="De-assert the reset to the EWPLL" name="NORESET_EWPLL" value="0x0"/>
      </value-group>
