Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
      <value-group caption="Output Enable bit" name="REFO2CON__ON">
        <value caption="Reference Oscillator Module enabled" name="" value="0x1"/>
        <value caption="Reference Oscillator Module disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Reference Clock Divider bits" name="REFO2CON__RODIV">
        <value caption="REFO1 clock is Base clock frequency divided by 65,534 (32,767 *2)" name="" value="0x7fff"/>
        <value caption="REFO1 clock is Base clock frequency divided by 4 (2*2)" name="" value="0x2"/>
        <value caption="REFO1 clock is Base clock frequency divided by 2 (1*2)" name="" value="0x1"/>
        <value caption="REFO1 clock is same frequency as Base clock (no divider)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock" name="REFO2TRIM__ROTRIM">
        <value caption="0/512 (0.0) divisor added to RODIV value" name="" value="0x0"/>
        <value caption="1/512 (0.001953125) divisor added to RODIV value" name="" value="0x1"/>
        <value caption="2/512 (0.00390625) divisor added to RODIV value" name="" value="0x2"/>
        <value caption="256/512 (0.5000) divisor added to RODIV value" name="" value="0x100"/>
        <value caption="511/512 (0.998046875) divisor added to RODIV value" name="" value="0x1ff"/>
      </value-group>
      <value-group caption="Reference Clock Source Select bits" name="REFO3CON__ROSEL">
        <value caption="REFI Pin" name="REFCLKIx" value="0xb"/>
        <value caption="BTPLL Clock" name="BTPLL" value="0xa"/>
        <value caption="EWPLL WiFi Clock" name="WCLK" value="0x9"/>
        <value caption="EWPLL Ethernet Clock" name="ECLK" value="0x8"/>
        <value caption="System PLL" name="SPLL" value="0x7"/>
        <value caption="USB PLL" name="UPLL" value="0x6"/>
        <value caption="SOSC" name="SOSC" value="0x5"/>
        <value caption="LPRC" name="LPRC" value="0x4"/>
        <value caption="FRC" name="FRC" value="0x3"/>
        <value caption="POSC" name="POSC" value="0x2"/>
        <value caption="Peripheral clock (reference clock reflects any peripheral clock switching)" name="PBCLK" value="0x1"/>
        <value caption="System clock (reference clock reflects any device clock switching)" name="SYSCLK" value="0x0"/>
      </value-group>
      <value-group caption="Reference Clock Request Status bit" name="REFO3CON__ACTIVE">
        <value caption="Reference clock request is active (User should not update this REFOCON register)" name="" value="0x1"/>
        <value caption="Reference clock request is not active (User can update this REFOCON register)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Clock RODIV/ROTRIM switch enabled." name="REFO3CON__DIVSWEN">
        <value caption="Clock Divider Switching currently in progress." name="" value="0x1"/>
        <value caption="Clock Divider Switch has completed." name="" value="0x0"/>
      </value-group>
      <value-group caption="Reference Oscillator Run in Sleep bit" name="REFO3CON__RSLP">
        <value caption="Reference Oscillator output continues to run in Sleep" name="" value="0x1"/>
        <value caption="Reference Oscillator output is disabled in Sleep" name="" value="0x0"/>
      </value-group>
      <value-group caption="Reference Clock Output Enable bit" name="REFO3CON__OE">
        <value caption="Reference clock is driven out on REFO1 pin" name="" value="0x1"/>
        <value caption="Reference clock is not driven out on REFO1 pin." name="" value="0x0"/>
      </value-group>
      <value-group caption="Peripheral Stop in Idle Mode bit" name="REFO3CON__SIDL">
        <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1"/>
        <value caption="Continue module operation in Idle mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Freeze in Debug mode bit" name="REFO3CON__FRZ">
        <value caption="When emulator is in Debug mode, module freezes operation" name="" value="0x1"/>
        <value caption="When emulator is in Debug mode, module continues operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Output Enable bit" name="REFO3CON__ON">
        <value caption="Reference Oscillator Module enabled" name="" value="0x1"/>
        <value caption="Reference Oscillator Module disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Reference Clock Divider bits" name="REFO3CON__RODIV">
        <value caption="REFO1 clock is Base clock frequency divided by 65,534 (32,767 *2)" name="" value="0x7fff"/>
        <value caption="REFO1 clock is Base clock frequency divided by 4 (2*2)" name="" value="0x2"/>
        <value caption="REFO1 clock is Base clock frequency divided by 2 (1*2)" name="" value="0x1"/>
        <value caption="REFO1 clock is same frequency as Base clock (no divider)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock" name="REFO3TRIM__ROTRIM">
        <value caption="0/512 (0.0) divisor added to RODIV value" name="" value="0x0"/>
        <value caption="1/512 (0.001953125) divisor added to RODIV value" name="" value="0x1"/>
        <value caption="2/512 (0.00390625) divisor added to RODIV value" name="" value="0x2"/>
        <value caption="256/512 (0.5000) divisor added to RODIV value" name="" value="0x100"/>
        <value caption="511/512 (0.998046875) divisor added to RODIV value" name="" value="0x1ff"/>
      </value-group>
      <value-group caption="Reference Clock Source Select bits" name="REFO4CON__ROSEL">
        <value caption="REFI Pin" name="REFCLKIx" value="0xb"/>
        <value caption="BTPLL Clock" name="BTPLL" value="0xa"/>
        <value caption="EWPLL WiFi Clock" name="WCLK" value="0x9"/>
        <value caption="EWPLL Ethernet Clock" name="ECLK" value="0x8"/>
        <value caption="System PLL" name="SPLL" value="0x7"/>
        <value caption="USB PLL" name="UPLL" value="0x6"/>
        <value caption="SOSC" name="SOSC" value="0x5"/>
        <value caption="LPRC" name="LPRC" value="0x4"/>
        <value caption="FRC" name="FRC" value="0x3"/>
        <value caption="POSC" name="POSC" value="0x2"/>
        <value caption="Peripheral clock (reference clock reflects any peripheral clock switching)" name="PBCLK" value="0x1"/>
        <value caption="System clock (reference clock reflects any device clock switching)" name="SYSCLK" value="0x0"/>
      </value-group>
