Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
        <register caption="" name="CVDSD1T2" offset="0x11c" rw="RW" size="4">
          <bitfield mask="0x0000007F" name="SD1CONTIME"/>
          <bitfield mask="0x00007F00" name="SD1CHNTIME"/>
          <bitfield mask="0x007F0000" name="SD1OVRTIME"/>
          <bitfield mask="0x7F000000" name="SD1POLTIME"/>
        </register>
        <register caption="" name="CVDSD2C1" offset="0x120" rw="RW" size="4">
          <bitfield mask="0x000000FF" name="SD2OVRSAMP"/>
          <bitfield mask="0xFFFFFF00" name="SD2THRESH"/>
        </register>
        <register caption="" name="CVDSD2C2" offset="0x124" rw="RW" size="4">
          <bitfield mask="0x0000003F" name="SD2RXBEG"/>
          <bitfield mask="0x000000C0" name="SD2RXSTRIDE1"/>
          <bitfield mask="0x00003F00" name="SD2RXEND"/>
          <bitfield mask="0x0000C000" name="SD2RXSTRIDE2"/>
          <bitfield mask="0x003F0000" name="SD2TXBEG"/>
          <bitfield mask="0x00C00000" name="SD2TXSTRIDE1"/>
          <bitfield mask="0x3F000000" name="SD2TXEND"/>
          <bitfield mask="0xC0000000" name="SD2TXSTRIDE2"/>
        </register>
        <register caption="" name="CVDSD2T1" offset="0x128" rw="RW" size="4">
          <bitfield mask="0x0000007F" name="SD2CHGTIME"/>
          <bitfield mask="0x00007F00" name="SD2ACQTIME"/>
          <bitfield mask="0x00FF0000" name="SD2ADCCON"/>
          <bitfield mask="0x01000000" name="SD2MUT"/>
          <bitfield mask="0x02000000" name="SD2SELF"/>
          <bitfield mask="0x04000000" name="SD2IEN"/>
          <bitfield mask="0x08000000" name="SD2BUF"/>
          <bitfield mask="0xC0000000" name="SD2EN"/>
        </register>
        <register caption="" name="CVDSD2T2" offset="0x12c" rw="RW" size="4">
          <bitfield mask="0x0000007F" name="SD2CONTIME"/>
          <bitfield mask="0x00007F00" name="SD2CHNTIME"/>
          <bitfield mask="0x007F0000" name="SD2OVRTIME"/>
          <bitfield mask="0x7F000000" name="SD2POLTIME"/>
        </register>
        <register caption="" name="CVDSD3C1" offset="0x130" rw="RW" size="4">
          <bitfield mask="0x000000FF" name="SD3OVRSAMP"/>
          <bitfield mask="0xFFFFFF00" name="SD3THRESH"/>
        </register>
        <register caption="" name="CVDSD3C2" offset="0x134" rw="RW" size="4">
          <bitfield mask="0x0000003F" name="SD3RXBEG"/>
          <bitfield mask="0x000000C0" name="SD3RXSTRIDE1"/>
          <bitfield mask="0x00003F00" name="SD3RXEND"/>
          <bitfield mask="0x0000C000" name="SD3RXSTRIDE2"/>
          <bitfield mask="0x003F0000" name="SD3TXBEG"/>
          <bitfield mask="0x00C00000" name="SD3TXSTRIDE1"/>
          <bitfield mask="0x3F000000" name="SD3TXEND"/>
          <bitfield mask="0xC0000000" name="SD3TXSTRIDE2"/>
        </register>
        <register caption="" name="CVDSD3T1" offset="0x138" rw="RW" size="4">
          <bitfield mask="0x0000007F" name="SD3CHGTIME"/>
          <bitfield mask="0x00007F00" name="SD3ACQTIME"/>
          <bitfield mask="0x00FF0000" name="SD3ADCCON"/>
          <bitfield mask="0x01000000" name="SD3MUT"/>
          <bitfield mask="0x02000000" name="SD3SELF"/>
          <bitfield mask="0x04000000" name="SD3IEN"/>
          <bitfield mask="0x08000000" name="SD3BUF"/>
          <bitfield mask="0xC0000000" name="SD3EN"/>
        </register>
        <register caption="" name="CVDSD3T2" offset="0x13c" rw="RW" size="4">
          <bitfield mask="0x0000007F" name="SD3CONTIME"/>
          <bitfield mask="0x00007F00" name="SD3CHNTIME"/>
          <bitfield mask="0x007F0000" name="SD3OVRTIME"/>
          <bitfield mask="0x7F000000" name="SD3POLTIME"/>
        </register>
        <register caption="" name="CVDDBG" offset="0x200" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="SEL_L"/>
          <bitfield mask="0xFFFF0000" name="SEL_H"/>
        </register>
      </register-group>
    </module>
    <module caption="" id="01500" name="DMAC" version="2">
      <register-group name="DMAC">
        <register caption="DMA Controller Control Register" name="DMACON" offset="0x0" rw="RW" size="4">
          <bitfield caption="DMA Module Busy bit" mask="0x00000800" name="DMABUSY" values="DMACON__DMABUSY"/>
          <bitfield caption="DMA Suspend bit" mask="0x00001000" name="SUSPEND" values="DMACON__SUSPEND"/>
          <bitfield caption="DMA On bit" mask="0x00010000" name="ON" values="DMACON__ON"/>
        </register>
        <register caption="DMA Status Register" name="DMASTAT" offset="0x10" rw="R" size="4">
          <bitfield mask="0x00000007" name="DMACH"/>
          <bitfield caption="Read/Write Status bit" mask="0x80000000" name="RDWR" values="DMASTAT__RDWR"/>
        </register>
        <register caption="DMA Address Register" name="DMAADDR" offset="0x20" rw="R" size="4">
          <bitfield mask="0xFFFFFFFF" name="DMAADDR"/>
        </register>
        <register caption="DMA CRC Control Register" name="DCRCCON" offset="0x30" rw="RW" size="4">
          <bitfield caption="CRC Channel Select bits" mask="0x00000007" name="CRCCH" values="DCRCCON__CRCCH"/>
          <bitfield caption="CRC Type Selection bit" mask="0x00000020" name="CRCTYP" values="DCRCCON__CRCTYP"/>
          <bitfield caption="CRC Append Mode bit" mask="0x00000040" name="CRCAPP" values="DCRCCON__CRCAPP"/>
          <bitfield caption="CRC Enable bit" mask="0x00000080" name="CRCEN" values="DCRCCON__CRCEN"/>
          <bitfield caption="Polynomial Length bits" mask="0x00001F00" name="PLEN" values="DCRCCON__PLEN"/>
          <bitfield caption="CRC Bit Order Selection bit" mask="0x01000000" name="BITO" values="DCRCCON__BITO"/>
          <bitfield caption="CRC Write Byte Order Selection bit" mask="0x08000000" name="WBO" values="DCRCCON__WBO"/>
          <bitfield caption="CRC Byte Order Selection bits" mask="0x30000000" name="BYTO" values="DCRCCON__BYTO"/>
        </register>
        <register caption="DMA CRC Data Register" name="DCRCDATA" offset="0x40" rw="RW" size="4">
          <bitfield caption="CRC Data Register bits" mask="0xFFFFFFFF" name="DCRCDATA" values="DCRCDATA__DCRCDATA"/>
        </register>
        <register caption="DMA CRCXOR Enable Register" name="DCRCXOR" offset="0x50" rw="RW" size="4">
          <bitfield caption="CRC XOR Register bits" mask="0xFFFFFFFF" name="DCRCXOR" values="DCRCXOR__DCRCXOR"/>
        </register>
