Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
        <register caption="DMA Channel x Pattern Data Register" name="DCH1DAT" offset="0x1d0" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="CHPDAT"/>
        </register>
        <register caption="DMA Channel x Pattern Data Register" name="DCH2DAT" offset="0x290" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="CHPDAT"/>
        </register>
        <register caption="DMA Channel x Pattern Data Register" name="DCH3DAT" offset="0x350" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="CHPDAT"/>
        </register>
        <register caption="DMA Channel x Pattern Data Register" name="DCH4DAT" offset="0x410" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="CHPDAT"/>
        </register>
        <register caption="DMA Channel x Pattern Data Register" name="DCH5DAT" offset="0x4d0" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="CHPDAT"/>
        </register>
        <register caption="DMA Channel x Pattern Data Register" name="DCH6DAT" offset="0x590" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="CHPDAT"/>
        </register>
        <register caption="DMA Channel x Pattern Data Register" name="DCH7DAT" offset="0x650" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="CHPDAT"/>
        </register>
      </register-group>
      <value-group caption="DMA Module Busy bit" name="DMACON__DMABUSY">
        <value caption="DMA module is active and is transferring data" name="" value="0x1"/>
        <value caption="DMA module is disabled and not actively transferring data" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Suspend bit" name="DMACON__SUSPEND">
        <value caption="DMA transfers are suspended to allow CPU uninterrupted access to data bus" name="" value="0x1"/>
        <value caption="DMA operates normally" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA On bit" name="DMACON__ON">
        <value caption="DMA module is enabled" name="" value="0x0"/>
        <value caption="DMA module is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Read/Write Status bit" name="DMASTAT__RDWR">
        <value caption="Last DMA bus access when an error was detected was a read" name="" value="0x1"/>
        <value caption="Last DMA bus access when an error was detected was a write" name="" value="0x0"/>
      </value-group>
      <value-group caption="CRC Channel Select bits" name="DCRCCON__CRCCH">
        <value caption="CRC is assigned to Channel 7" name="" value="0x7"/>
        <value caption="CRC is assigned to Channel 6" name="" value="0x6"/>
        <value caption="CRC is assigned to Channel 5" name="" value="0x5"/>
        <value caption="CRC is assigned to Channel 4" name="" value="0x4"/>
        <value caption="CRC is assigned to Channel 3" name="" value="0x3"/>
        <value caption="CRC is assigned to Channel 2" name="" value="0x2"/>
        <value caption="CRC is assigned to Channel 1" name="" value="0x1"/>
        <value caption="CRC is assigned to Channel 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="CRC Type Selection bit" name="DCRCCON__CRCTYP">
        <value caption="The CRC module will calculate an IP header checksum" name="" value="0x1"/>
        <value caption="The CRC module will calculate a LFSR CRC" name="" value="0x0"/>
      </value-group>
      <value-group caption="CRC Append Mode bit" name="DCRCCON__CRCAPP">
        <value caption="The DMA transfers data from the source into the CRC but NOT to the destination. When a block transfer completes the DMA writes the calculated CRC value to the location given by CHxDSA" name="" value="0x1"/>
        <value caption="The DMA transfers data from the source through the CRC obeying WBO as it writes the data to the destination" name="" value="0x0"/>
      </value-group>
      <value-group caption="CRC Enable bit" name="DCRCCON__CRCEN">
        <value caption="CRC module is enabled and channel transfers are routed through the CRC module" name="" value="0x1"/>
        <value caption="CRC module is disabled and channel transfers proceed normally" name="" value="0x0"/>
      </value-group>
      <value-group caption="Polynomial Length bits" name="DCRCCON__PLEN">
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 30" name="" value="0x1f"/>
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 29" name="" value="0x1e"/>
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 28" name="" value="0x1d"/>
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 27" name="" value="0x1c"/>
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 26" name="" value="0x1b"/>
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 25" name="" value="0x1a"/>
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 24" name="" value="0x19"/>
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 23" name="" value="0x18"/>
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 22" name="" value="0x17"/>
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 21" name="" value="0x16"/>
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 20" name="" value="0x15"/>
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 19" name="" value="0x14"/>
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 18" name="" value="0x13"/>
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 17" name="" value="0x12"/>
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 16" name="" value="0x11"/>
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 15" name="" value="0x10"/>
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 14" name="" value="0xf"/>
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 13" name="" value="0xe"/>
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 12" name="" value="0xd"/>
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 11" name="" value="0xc"/>
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 10" name="" value="0xb"/>
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 9" name="" value="0xa"/>
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 8" name="" value="0x9"/>
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 7" name="" value="0x8"/>
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 6" name="" value="0x7"/>
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 5" name="" value="0x6"/>
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 4" name="" value="0x5"/>
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 3" name="" value="0x4"/>
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 2" name="" value="0x3"/>
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 1" name="" value="0x2"/>
        <value caption="(CRC module is in IP Header mode)These bits are unused. / (CRC module is in LFSR mode) Denotes polynomial length of 0" name="" value="0x1"/>
      </value-group>
