Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
      <value-group caption="RMII Speed bit" name="EMAC1SUPP__SPEEDRMII">
        <value caption="RMII is running at 100 Mbps" name="" value="0x1"/>
        <value caption="RMII is running at 10 Mbps" name="" value="0x0"/>
      </value-group>
      <value-group caption="Reset RMII Logic bit" name="EMAC1SUPP__RESETRMII">
        <value caption="Reset the MAC RMII module" name="" value="0x1"/>
        <value caption="Normal operation." name="" value="0x0"/>
      </value-group>
      <value-group caption="Shortcut PAUSE Quanta bit" name="EMAC1TEST__SHRTQNTA">
        <value caption="The MAC reduces the effective PAUSE Quanta from 64 byte-times to 1 byte-time" name="" value="0x1"/>
        <value caption="Normal operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Test PAUSE bit" name="EMAC1TEST__TESTPAUSE">
        <value caption="The MAC Control sub-layer will inhibit transmissions" name="" value="0x1"/>
        <value caption="Normal operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Test Backpressure bit" name="EMAC1TEST__TESTBP">
        <value caption="The MAC will assert backpressure on the link. Backpressure causes preamble to be transmitted" name="" value="0x1"/>
        <value caption="Normal operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Scan Increment bit" name="EMAC1MCFG__SCANINC">
        <value caption="The MII Management module will perform read cycles across a range of PHYs. The read cycles will start from address 1 through the value set in EMAC1MADR" name="" value="0x1"/>
        <value caption="Continuous reads of the same PHY" name="" value="0x0"/>
      </value-group>
      <value-group caption="Suppress Preamble bit" name="EMAC1MCFG__NOPRE">
        <value caption="The MII Management will perform read/write cycles without the 32-bit preamble field. Some PHYs support suppressed preamble" name="" value="0x1"/>
        <value caption="Normal read/write cycles are performed" name="" value="0x0"/>
      </value-group>
      <value-group caption="Test Reset MII Management bit" name="EMAC1MCFG__RESETMGMT">
        <value caption="Reset the MII Management module" name="" value="0x1"/>
        <value caption="Normal Operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="MII Management Read Command bit" name="EMAC1MCMD__READ">
        <value caption="The MII Management module will perform a single read cycle. The read data is returned in the EMAC1MRDD register" name="" value="0x1"/>
        <value caption="The MII Management module will perform a write cycle. The write data is taken from the EMAC1MWTD register" name="" value="0x0"/>
      </value-group>
      <value-group caption="MII Management Scan Mode bit" name="EMAC1MCMD__SCAN">
        <value caption="The MII Management module will perform read cycles continuously (for example" name="" value="0x1"/>
        <value caption="Normal Operation" name="" value="0x0"/>
      </value-group>
    </module>
    <module caption="" id="03337" name="FUSECONFIG" version="">
      <register-group name="FUSECONFIG">
        <register caption="" initval="0x0000FFFF" name="FUSERID" offset="0x0" rw="RW" size="4">
          <bitfield caption="User ID" mask="0x0000FFFF" name="USERID" values="FUSERID__USERID"/>
        </register>
        <register caption="Device Configuration Word 4" initval="0x04180000" name="DEVCFG4" offset="0x4" rw="RW" size="4">
          <bitfield caption="SOSC Configuration Bits" mask="0x000000FF" name="SOSCCFG" values="CFGCON4__SOSCCFG"/>
          <bitfield caption="VBAT Zero-Power BOR Enable bit" mask="0x00080000" name="VBZPBOREN" values="DEVCFG4__VBZPBOREN"/>
          <bitfield caption="Deep Sleep Zero-Power BOR Enable bit" mask="0x00100000" name="DSZPBOREN" values="DEVCFG4__DSZPBOREN"/>
          <bitfield caption="Deep Sleep Watchdog Timer Postscaler" mask="0x03E00000" name="DSWDTPS" values="DEVCFG4__DSWDTPS"/>
          <bitfield caption="Deep Sleep WDT Reference Clock Selection" mask="0x04000000" name="DSWDTOSC" values="DEVCFG4__DSWDTOSC"/>
          <bitfield caption="Deep Sleep Watchdog Timer Enable" mask="0x08000000" name="DSWDTEN" values="DEVCFG4__DSWDTEN"/>
          <bitfield caption="Deep Sleep Enable" mask="0x10000000" name="DSEN" values="DEVCFG4__DSEN"/>
          <bitfield caption="Secondary Oscillator Enable" mask="0x40000000" name="SOSCEN" values="DEVCFG4__SOSCEN"/>
        </register>
        <register caption="Device Configuration Word 2" initval="0x5F60FE30" name="DEVCFG2" offset="0x8" rw="RW" size="4">
          <bitfield caption="DMT Count Window Interval" mask="0x00000038" name="DMTINTV" values="DEVCFG2__DMTINTV"/>
          <bitfield caption="Primary Oscillator Configuration" mask="0x00000300" name="POSCMOD" values="DEVCFG2__POSCMOD"/>
          <bitfield caption="WDT Run mode clock selection" mask="0x00000C00" name="WDTRMCS" values="DEVCFG2__WDTRMCS"/>
          <bitfield caption="Secondary Oscillator selection" mask="0x00001000" name="SOSCSEL" values="DEVCFG2__SOSCSEL"/>
          <bitfield caption="2 speed startup control for sleep mode" mask="0x00002000" name="WAKE2SPD" values="DEVCFG2__WAKE2SPD"/>
          <bitfield caption="software clock switching enable" mask="0x00004000" name="CKSWEN" values="DEVCFG2__CKSWEN"/>
          <bitfield caption="Fail safe clock monitor enabled" mask="0x00008000" name="FSCMEN" values="DEVCFG2__FSCMEN"/>
          <bitfield caption="Run mode watchdog timer postscaler" mask="0x001F0000" name="WDTPS" values="DEVCFG2__WDTPS"/>
          <bitfield caption="Watchdog Timer Stop During Flash Programming" mask="0x00200000" name="WDTSPGM" values="DEVCFG2__WDTSPGM"/>
          <bitfield caption="Watchdog Timer Window Mode" mask="0x00400000" name="WINDIS" values="DEVCFG2__WINDIS"/>
          <bitfield caption="Watchdog Timer Enable bit" mask="0x00800000" name="WDTEN" values="DEVCFG2__WDTEN"/>
          <bitfield caption="Watchdog Timer Window Size" mask="0x03000000" name="WDTWINSZ" values="DEVCFG2__WDTWINSZ"/>
          <bitfield caption="Dead Man Timer Count Select bits" mask="0x7C000000" name="DMTCNT" values="DEVCFG2__DMTCNT"/>
          <bitfield caption="Deadman Timer Enable" mask="0x80000000" name="DMTEN" values="DEVCFG2__DMTEN"/>
        </register>
        <register caption="Device Configuration Word 1" initval="0x0000DC31" name="DEVCFG1" offset="0xc" rw="RW" size="4">
          <bitfield caption="Background Debugger Access Selection" mask="0x00000003" name="DEBUG" values="DEVCFG1__DEBUG"/>
          <bitfield caption="EMUC/EMUD Communication Channel Select" mask="0x00000018" name="ICESEL" values="DEVCFG1__ICESEL"/>
          <bitfield caption="Trace Enable" mask="0x00000020" name="TRCEN" values="DEVCFG1__TRCEN"/>
          <bitfield caption="Ethernet RMII/MII Enable" mask="0x00000100" name="FMIIEN" values="DEVCFG1__FMIIEN"/>
          <bitfield caption="Exclusive Ethernet PYHY reference clock Enable" mask="0x00000200" name="ETHEXEREF" values="DEVCFG1__ETHEXEREF"/>
          <bitfield caption="Disable CLASSB Device Functionality" mask="0x00000400" name="CLASSBDIS" values="DEVCFG1__CLASSBDIS"/>
          <bitfield caption="USB USBID Selection bit" mask="0x00000800" name="USBIDIO" values="DEVCFG1__USBIDIO"/>
          <bitfield caption="USB VBUS_ON Selection bit" mask="0x00001000" name="VBUSIO" values="DEVCFG1__VBUSIO"/>
          <bitfield caption="SPI1 High Speed Mode Enable" mask="0x00002000" name="HSSPIEN" values="DEVCFG1__HSSPIEN"/>
          <bitfield caption="Selects CRU handling of MCLR Control" mask="0x00004000" name="SMCLR" values="DEVCFG1__SMCLR"/>
          <bitfield caption="UART1 High Speed Mode Enable" mask="0x00008000" name="HSUARTEN" values="DEVCFG1__HSUARTEN"/>
          <bitfield caption="USB DP Rise/Fall Trim fuse bits" mask="0x000F0000" name="USBDMTRIM" values="DEVCFG1__USBDMTRIM"/>
          <bitfield caption="USB DM Rise/Fall Trim fuse bits" mask="0x00F00000" name="USBDPTRIM" values="DEVCFG1__USBDPTRIM"/>
          <bitfield caption="Watchdog Timer Post-scale Select Sleep bits" mask="0x1F000000" name="WDTPSS" values="DEVCFG1__WDTPSS"/>
        </register>
        <register caption="Device Configuration Word 0" initval="0x20800001" name="DEVCFG0" offset="0x10" rw="RW" size="4">
          <bitfield caption="TDO control for 2 wire JTAG protocol" mask="0x00000001" name="TDOEN" values="DEVCFG0__TDOEN"/>
          <bitfield caption="Trace clock control bit" mask="0x00000004" name="TROEN" values="DEVCFG0__TROEN"/>
          <bitfield caption="JTAG control bit" mask="0x00000008" name="JTAGEN" values="DEVCFG0__JTAGEN"/>
          <bitfield caption="Flash controller RAM access priority" mask="0x00000020" name="FCPRI" values="DEVCFG0__FCPRI"/>
          <bitfield caption="DMA RAM access priority" mask="0x00000040" name="DMAPRI" values="DEVCFG0__DMAPRI"/>
          <bitfield caption="CPU RAM access priority" mask="0x00000080" name="EXLPRI" values="DEVCFG0__EXLPRI"/>
          <bitfield caption="USB Suspend Sleep Enable" mask="0x00000100" name="USBSSEN" values="DEVCFG0__USBSSEN"/>
          <bitfield caption="PMU Controller Register LOCK" mask="0x00000400" name="PMULOCK" values="DEVCFG0__PMULOCK"/>
          <bitfield caption="Permission Group LOCK" mask="0x00000800" name="PGLOCK" values="DEVCFG0__PGLOCK"/>
          <bitfield caption="Peripheral Module Disable (PMD) LOCK" mask="0x00001000" name="PMDLOCK" values="DEVCFG0__PMDLOCK"/>
          <bitfield caption="IO LOCK" mask="0x00002000" name="IOLOCK" values="DEVCFG0__IOLOCK"/>
          <bitfield caption="Configuration Register Lock" mask="0x0000C000" name="CFGLOCK" values="DEVCFG0__CFGLOCK"/>
          <bitfield caption="OCMP Alternate Clock Selection" mask="0x00010000" name="OC_ACLK" values="DEVCFG0__OC_ACLK"/>
          <bitfield caption="ICAP Alternate Clock Selection" mask="0x00020000" name="IC_ACLK" values="DEVCFG0__IC_ACLK"/>
          <bitfield caption="CAN-FD Back-up Clock Divider" mask="0x00300000" name="CANFDDIV"/>
          <bitfield caption="P-Cache cache-ability control" mask="0x00800000" name="PCM" values="DEVCFG0__PCM"/>
          <bitfield caption="UPLL HW Control Mode for power down and RESET" mask="0x01000000" name="UPLLHWMD" values="DEVCFG0__UPLLHWMD"/>
          <bitfield caption="SPLL HW Control Mode for power down and RESET" mask="0x02000000" name="SPLLHWMD" values="DEVCFG0__SPLLHWMD"/>
          <bitfield caption="BTPLL HW Control Mode for power down and RESET" mask="0x04000000" name="BTPLLHWMD" values="DEVCFG0__BTPLLHWMD"/>
          <bitfield caption="Ethernet PLL HW Control Mode for power down and RESET" mask="0x08000000" name="ETHPLLHWMD" values="DEVCFG0__ETHPLLHWMD"/>
          <bitfield caption="Dynamic Flash ECC Configuration" mask="0x30000000" name="FECCCON" values="DEVCFG0__FECCCON"/>
          <bitfield caption="Ethernet Tx SOF control for CTR measurements" mask="0x40000000" name="ETHTPSF" values="DEVCFG0__ETHTPSF"/>
          <bitfield caption="External Programming Clock enable" mask="0x80000000" name="EPGMCLK" values="DEVCFG0__EPGMCLK"/>
        </register>
        <register caption="NVR BCFG User Configuration Area" initval="0x00000008" name="FBCFG0" offset="0x14" rw="RW" size="4">
          <bitfield caption="Buck mode switching control" mask="0x00000001" name="BUHSWEN" values="FBCFG0__BUHSWEN"/>
          <bitfield caption="PCache Single cache Mode" mask="0x00000002" name="PCSCMODE" values="FBCFG0__PCSCMODE"/>
          <bitfield caption="Boot and exception code mode" mask="0x00000008" name="BOOTISA" values="FBCFG0__BOOTISA"/>
        </register>
