Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
        <register caption="NVR CPN Register" initval="0x10000000" name="FCPN0" offset="0x34" rw="RW" size="4">
          <bitfield caption="Boot Code Protect" mask="0x00000001" name="CP" values="FCPN0__CP"/>
        </register>
      </register-group>
      <value-group caption="VBAT Zero-Power BOR Enable bit" name="DEVCFG4__VBZPBOREN">
        <value caption="Enabled" name="ON" value="0x1"/>
        <value caption="Disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Deep Sleep Zero-Power BOR Enable bit" name="DEVCFG4__DSZPBOREN">
        <value caption="Enabled" name="ON" value="0x1"/>
        <value caption="Disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Deep Sleep Watchdog Timer Postscaler" name="DEVCFG4__DSWDTPS">
        <value caption="1:2^5" name="DSPS1" value="0x0"/>
        <value caption="1:2^6" name="DSPS2" value="0x1"/>
        <value caption="1:2^7" name="DSPS3" value="0x2"/>
        <value caption="1:2^8" name="DSPS4" value="0x3"/>
        <value caption="1:2^9" name="DSPS5" value="0x4"/>
        <value caption="1:2^10" name="DSPS6" value="0x5"/>
        <value caption="1:2^11" name="DSPS7" value="0x6"/>
        <value caption="1:2^12" name="DSPS8" value="0x7"/>
        <value caption="1:2^13" name="DSPS9" value="0x8"/>
        <value caption="1:2^14" name="DSPS10" value="0x9"/>
        <value caption="1:2^15" name="DSPS11" value="0xa"/>
        <value caption="1:2^16" name="DSPS12" value="0xb"/>
        <value caption="1:2^17" name="DSPS13" value="0xc"/>
        <value caption="1:2^18" name="DSPS14" value="0xd"/>
        <value caption="1:2^19" name="DSPS15" value="0xe"/>
        <value caption="1:2^20" name="DSPS16" value="0xf"/>
        <value caption="1:2^21" name="DSPS17" value="0x10"/>
        <value caption="1:2^22" name="DSPS18" value="0x11"/>
        <value caption="1:2^23" name="DSPS19" value="0x12"/>
        <value caption="1:2^24" name="DSPS20" value="0x13"/>
        <value caption="1:2^25" name="DSPS21" value="0x14"/>
        <value caption="1:2^26" name="DSPS22" value="0x15"/>
        <value caption="1:2^27" name="DSPS23" value="0x16"/>
        <value caption="1:2^28" name="DSPS24" value="0x17"/>
        <value caption="1:2^29" name="DSPS25" value="0x18"/>
        <value caption="1:2^30" name="DSPS26" value="0x19"/>
        <value caption="1:2^31" name="DSPS27" value="0x1a"/>
        <value caption="1:2^32" name="DSPS28" value="0x1b"/>
        <value caption="1:2^33" name="DSPS29" value="0x1c"/>
        <value caption="1:2^34" name="DSPS30" value="0x1d"/>
        <value caption="1:2^35" name="DSPS31" value="0x1e"/>
        <value caption="1:2^36" name="DSPS32" value="0x1f"/>
      </value-group>
      <value-group caption="Deep Sleep WDT Reference Clock Selection" name="DEVCFG4__DSWDTOSC">
        <value caption="Select SOSC as DSWDT Reference Clock" name="SOSC" value="0x0"/>
        <value caption="Select LPRC as DSWDT Reference Clock" name="LPRC" value="0x1"/>
      </value-group>
      <value-group caption="Deep Sleep Watchdog Timer Enable" name="DEVCFG4__DSWDTEN">
        <value caption="Enabled" name="ON" value="0x1"/>
        <value caption="Disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Deep Sleep Enable" name="DEVCFG4__DSEN">
        <value caption="Enabled" name="ON" value="0x1"/>
        <value caption="Disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Secondary Oscillator Enable" name="DEVCFG4__SOSCEN">
        <value caption="Enabled" name="ON" value="0x1"/>
        <value caption="Disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="DMT Count Window Interval" name="DEVCFG2__DMTINTV">
        <value caption="Window/Interval value is zero" name="WIN_0" value="0x0"/>
        <value caption="Window/Interval value is 1/2 counter value" name="WIN_1_2" value="0x1"/>
        <value caption="Window/Interval value is 3/4 counter value" name="WIN_3_4" value="0x2"/>
        <value caption="Window/Interval value is 7/8 counter value" name="WIN_7_8" value="0x3"/>
        <value caption="Window/Interval value is 15/16 counter value" name="WIN_15_16" value="0x4"/>
        <value caption="Window/Interval value is 31/32 counter value" name="WIN_31_32" value="0x5"/>
        <value caption="Window/Interval value is 63/64 counter value" name="WIN_63_64" value="0x6"/>
        <value caption="Window/Interval value is 127/128 counter value" name="WIN_127_128" value="0x7"/>
      </value-group>
      <value-group caption="Primary Oscillator Configuration" name="DEVCFG2__POSCMOD">
        <value caption="Primary oscillator disabled" name="OFF" value="0x3"/>
        <value caption="HS oscillator mode selected" name="HS" value="0x2"/>
      </value-group>
      <value-group caption="WDT Run mode clock selection" name="DEVCFG2__WDTRMCS">
        <value caption="LPRC used as WDT run mode clock source" name="LPRC" value="0x3"/>
        <value caption="Peripheral bus clock used as WDT run mode clock source" name="PBCLK" value="0x0"/>
      </value-group>
      <value-group caption="Secondary Oscillator selection" name="DEVCFG2__SOSCSEL">
        <value caption="Crystal (SOSCI/SOSCO) mode" name="CRYSTAL" value="0x1"/>
        <value caption="Digital (SCLKI) mode" name="DIGITAL" value="0x0"/>
      </value-group>
      <value-group caption="2 speed startup control for sleep mode" name="DEVCFG2__WAKE2SPD">
        <value caption="the sys_clk will be from FRC until the selected clock is ready on wakeup" name="ON" value="0x1"/>
        <value caption="the sys_clk will be from the selected clock on wakeup" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="software clock switching enable" name="DEVCFG2__CKSWEN">
        <value caption="Software Clock Switching Enabled" name="ON" value="0x1"/>
        <value caption="Software Clock Switching Disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Fail safe clock monitor enabled" name="DEVCFG2__FSCMEN">
        <value caption="FSCM Enabled" name="ON" value="0x1"/>
        <value caption="FSCM Disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Run mode watchdog timer postscaler" name="DEVCFG2__WDTPS">
        <value caption="1:1" name="PS1" value="0x0"/>
        <value caption="1:2" name="PS2" value="0x1"/>
        <value caption="1:4" name="PS4" value="0x2"/>
        <value caption="1:8" name="PS8" value="0x3"/>
        <value caption="1:16" name="PS16" value="0x4"/>
        <value caption="1:32" name="PS32" value="0x5"/>
        <value caption="1:64" name="PS64" value="0x6"/>
        <value caption="1:128" name="PS128" value="0x7"/>
        <value caption="1:256" name="PS256" value="0x8"/>
        <value caption="1:512" name="PS512" value="0x9"/>
        <value caption="1:1024" name="PS1024" value="0xa"/>
        <value caption="1:2048" name="PS2048" value="0xb"/>
        <value caption="1:4096" name="PS4096" value="0xc"/>
        <value caption="1:8192" name="PS8192" value="0xd"/>
        <value caption="1:16384" name="PS16384" value="0xe"/>
        <value caption="1:32768" name="PS32768" value="0xf"/>
        <value caption="1:65536" name="PS65536" value="0x10"/>
        <value caption="1:131072" name="PS131072" value="0x11"/>
        <value caption="1:262144" name="PS262144" value="0x12"/>
        <value caption="1:524288" name="PS524288" value="0x13"/>
        <value caption="1:1048576" name="PS1048576" value="0x14"/>
      </value-group>
      <value-group caption="Watchdog Timer Stop During Flash Programming" name="DEVCFG2__WDTSPGM">
        <value caption="WDT runs during Flash programming" name="RUN" value="0x0"/>
        <value caption="WDT stops during Flash programming" name="STOP" value="0x1"/>
      </value-group>
      <value-group caption="Watchdog Timer Window Mode" name="DEVCFG2__WINDIS">
        <value caption="Watchdog Timer is in non-Window mode" name="NORMAL" value="0x1"/>
        <value caption="Watchdog Timer is in Window mode" name="WINDOW" value="0x0"/>
      </value-group>
      <value-group caption="Watchdog Timer Enable bit" name="DEVCFG2__WDTEN">
        <value caption="WDT Disabled" name="OFF" value="0x0"/>
        <value caption="WDT Enabled" name="ON" value="0x1"/>
      </value-group>
      <value-group caption="Watchdog Timer Window Size" name="DEVCFG2__WDTWINSZ">
        <value caption="Window size is 25%" name="WINSZ_25" value="0x3"/>
        <value caption="Window size is 37.5%" name="WINSZ_37" value="0x2"/>
        <value caption="Window size is 50%" name="WINSZ_50" value="0x1"/>
        <value caption="Window size is 75%" name="WINSZ_75" value="0x0"/>
      </value-group>
