Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
      <value-group caption="Dead Man Timer Count Select bits" name="DEVCFG2__DMTCNT">
        <value caption="2^8 (256)" name="DMT8" value="0x0"/>
        <value caption="2^9 (512)" name="DMT9" value="0x1"/>
        <value caption="2^10 (1024)" name="DMT10" value="0x2"/>
        <value caption="2^11 (2048)" name="DMT11" value="0x3"/>
        <value caption="2^12 (4096)" name="DMT12" value="0x4"/>
        <value caption="2^13 (8192)" name="DMT13" value="0x5"/>
        <value caption="2^14 (16384)" name="DMT14" value="0x6"/>
        <value caption="2^15 (32768)" name="DMT15" value="0x7"/>
        <value caption="2^16 (65536)" name="DMT16" value="0x8"/>
        <value caption="2^17 (131072)" name="DMT17" value="0x9"/>
        <value caption="2^18 (262144)" name="DMT18" value="0xa"/>
        <value caption="2^19 (524288)" name="DMT19" value="0xb"/>
        <value caption="2^20 (1048576)" name="DMT20" value="0xc"/>
        <value caption="2^21 (2097152)" name="DMT21" value="0xd"/>
        <value caption="2^22 (4194304)" name="DMT22" value="0xe"/>
        <value caption="2^23 (8388608)" name="DMT23" value="0xf"/>
        <value caption="2^24 (16777216)" name="DMT24" value="0x10"/>
        <value caption="2^25 (33554432)" name="DMT25" value="0x11"/>
        <value caption="2^26 (67108864)" name="DMT26" value="0x12"/>
        <value caption="2^27 (134217728)" name="DMT27" value="0x13"/>
        <value caption="2^28 (268435456)" name="DMT28" value="0x14"/>
        <value caption="2^29 (536870912)" name="DMT29" value="0x15"/>
        <value caption="2^30 (1073741824)" name="DMT30" value="0x16"/>
        <value caption="2^31 (2147483648)" name="DMT31" value="0x17"/>
      </value-group>
      <value-group caption="Deadman Timer Enable" name="DEVCFG2__DMTEN">
        <value caption="Deadman Timer is enabled" name="ON" value="0x1"/>
        <value caption="Deadman Timer is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Background Debugger Access Selection" name="DEVCFG1__DEBUG">
        <value caption="4-wire JTAG I/F Enabled - EMUC/EMUD Disabled - ICD Module Disabled" name="JTAG" value="0x3"/>
        <value caption="4-wire JTAG I/F Enabled - EMUC/EMUD Disabled - ICD Module Enabled" name="JTAG_ICD" value="0x2"/>
        <value caption="EMUC/EMUD Enabled - 4-wire JTAG I/F Disabled - ICD Module Disabled" name="EMUC" value="0x1"/>
        <value caption="EMUC/EMUD Enabled - 4-wire JTAG I/F Disabled - ICD Module Enabled" name="EMUC_ICD" value="0x0"/>
      </value-group>
      <value-group caption="EMUC/EMUD Communication Channel Select" name="DEVCFG1__ICESEL">
        <value caption="ICE EMUC1/EMUD1 pins are shared with PGC1/PGD1" name="ICS_PGx1" value="0x3"/>
        <value caption="ICE EMUC2/EMUD2 pins are shared with PGC2/PGD2" name="ICS_PGx2" value="0x2"/>
        <value caption="ICE EMUC3/EMUD3 pins are shared with PGC3/PGD3" name="ICS_PGx3" value="0x1"/>
        <value caption="ICE EMUC4/EMUD4 pins are shared with PGC4/PGD4" name="ICS_PGx4" value="0x0"/>
      </value-group>
      <value-group caption="Trace Enable" name="DEVCFG1__TRCEN">
        <value caption="Trace features in the CPU are enabled" name="ON" value="0x1"/>
        <value caption="Trace features in the CPU are disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Ethernet RMII/MII Enable" name="DEVCFG1__FMIIEN">
        <value caption="RMII Enabled" name="OFF" value="0x0"/>
        <value caption="MII Enabled" name="ON" value="0x1"/>
      </value-group>
      <value-group caption="Exclusive Ethernet PYHY reference clock Enable" name="DEVCFG1__ETHEXEREF">
        <value caption="PHY reference clock is made available on ETH EXCLK out" name="ON" value="0x1"/>
        <value caption="ETH CLK out will be used as PHY reference clock if needed" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Disable CLASSB Device Functionality" name="DEVCFG1__CLASSBDIS">
        <value caption="CLASSB functions enabled" name="ENABLE" value="0x0"/>
        <value caption="CLASSB functions disabled" name="DISABLE" value="0x1"/>
      </value-group>
      <value-group caption="USB USBID Selection bit" name="DEVCFG1__USBIDIO">
        <value caption="USBID pin is controlled by the USB Module" name="ON" value="0x1"/>
        <value caption="USBID pin is controlled by the Port Function" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="USB VBUS_ON Selection bit" name="DEVCFG1__VBUSIO">
        <value caption="VBUS_ON pin is controlled by the USB Module" name="ON" value="0x1"/>
        <value caption="VBUS_ON pin is controlled by the Port Function" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="SPI1 High Speed Mode Enable" name="DEVCFG1__HSSPIEN">
        <value caption="SPI1 is driven from/to dedicated pins, resulting in the highest interface speed" name="ON" value="0x1"/>
        <value caption="SPI1 is driven through PPS (I/O remap), resulting in a lower interface speed" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Selects CRU handling of MCLR Control" name="DEVCFG1__SMCLR">
        <value caption="Legacy mode (system clear does not reset all state of device)" name="MCLR_NORM" value="0x1"/>
        <value caption="MCLR causes a faux POR" name="MCLR_POR" value="0x0"/>
      </value-group>
      <value-group caption="UART1 High Speed Mode Enable" name="DEVCFG1__HSUARTEN">
        <value caption="UART1 is driven from/to dedicated pins, resulting in the highest possible maximum baud rate" name="ON" value="0x1"/>
        <value caption="UART1 is driven through PPS (I/O remap), resulting in a lower maximum baud rate" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Watchdog Timer Post-scale Select Sleep bits" name="DEVCFG1__WDTPSS">
        <value caption="1:1048576" name="PSS1048576" value="0x14"/>
        <value caption="1:524288" name="PSS524288" value="0x13"/>
        <value caption="1:262144" name="PSS262144" value="0x12"/>
        <value caption="1:131072" name="PSS131072" value="0x11"/>
        <value caption="1:65536" name="PSS65536" value="0x10"/>
        <value caption="1:32768" name="PSS32768" value="0xf"/>
        <value caption="1:16384" name="PSS16384" value="0xe"/>
        <value caption="1:8192" name="PSS8192" value="0xd"/>
        <value caption="1:4096" name="PSS4096" value="0xc"/>
        <value caption="1:2048" name="PSS2048" value="0xb"/>
        <value caption="1:1024" name="PSS1024" value="0xa"/>
        <value caption="1:512" name="PSS512" value="0x9"/>
        <value caption="1:256" name="PSS256" value="0x8"/>
        <value caption="1:128" name="PSS128" value="0x7"/>
        <value caption="1:64" name="PSS64" value="0x6"/>
        <value caption="1:32" name="PSS32" value="0x5"/>
        <value caption="1:16" name="PSS16" value="0x4"/>
        <value caption="1:8" name="PSS8" value="0x3"/>
        <value caption="1:4" name="PSS4" value="0x2"/>
        <value caption="1:2" name="PSS2" value="0x1"/>
        <value caption="1:1" name="PSS1" value="0x0"/>
      </value-group>
      <value-group caption="TDO control for 2 wire JTAG protocol" name="DEVCFG0__TDOEN">
        <value caption="2-wire JTAG protocol uses TDO" name="ON" value="0x1"/>
        <value caption="2-wire JTAG protocol does not use TDO" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Trace clock control bit" name="DEVCFG0__TROEN">
        <value caption="Start Trace Clock and enable Trace Outputs (Trace Probe must be present)" name="ON" value="0x1"/>
        <value caption="Stop Trace Clock and disable Trace Outputs" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="JTAG control bit" name="DEVCFG0__JTAGEN">
        <value caption="JTAG port enabled" name="ON" value="0x1"/>
        <value caption="JTAG port disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Flash controller RAM access priority" name="DEVCFG0__FCPRI">
        <value caption="flash gets higher priority access to RAM" name="HIGH" value="0x1"/>
        <value caption="flash gets least recently used arbitration to RAM" name="LRSA" value="0x0"/>
      </value-group>
