Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
        <register caption="" name="CNPDK" offset="0x360" rw="RW" size="4">
          <bitfield mask="0x1" name="CNPDK0"/>
          <bitfield mask="0x2" name="CNPDK1"/>
          <bitfield mask="0x4" name="CNPDK2"/>
          <bitfield mask="0x8" name="CNPDK3"/>
          <bitfield mask="0x10" name="CNPDK4"/>
          <bitfield mask="0x20" name="CNPDK5"/>
          <bitfield mask="0x40" name="CNPDK6"/>
          <bitfield mask="0x80" name="CNPDK7"/>
          <bitfield mask="0x100" name="CNPDK8"/>
          <bitfield mask="0x200" name="CNPDK9"/>
          <bitfield mask="0x400" name="CNPDK10"/>
          <bitfield mask="0x800" name="CNPDK11"/>
          <bitfield mask="0x1000" name="CNPDK12"/>
          <bitfield mask="0x2000" name="CNPDK13"/>
          <bitfield mask="0x4000" name="CNPDK14"/>
        </register>
        <register caption="Change Notice control for PORTx Register" name="CNCONA" offset="0x70" rw="RW" size="4">
          <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONA__EDGEDETECT"/>
          <bitfield mask="0x00002000" name="SIDL"/>
          <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONA__ON"/>
        </register>
        <register caption="Change Notice control for PORTx Register" name="CNCONB" offset="0x170" rw="RW" size="4">
          <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONB__EDGEDETECT"/>
          <bitfield mask="0x00002000" name="SIDL"/>
          <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONB__ON"/>
        </register>
        <register caption="Change Notice control for PORTx Register" name="CNCONC" offset="0x270" rw="RW" size="4">
          <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONC__EDGEDETECT"/>
          <bitfield mask="0x00002000" name="SIDL"/>
          <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONC__ON"/>
        </register>
        <register caption="Change Notice control for PORTx Register" name="CNCONK" offset="0x370" rw="RW" size="4">
          <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONK__EDGEDETECT"/>
          <bitfield mask="0x00002000" name="SIDL"/>
          <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONK__ON"/>
        </register>
        <register caption="" name="CNENA" offset="0x80" rw="RW" size="4">
          <bitfield mask="0x00000001" name="CNENA"/>
          <bitfield mask="0x00000002" name="CNENA"/>
          <bitfield mask="0x00000004" name="CNENA"/>
          <bitfield mask="0x00000008" name="CNENA"/>
          <bitfield mask="0x00000010" name="CNENA"/>
          <bitfield mask="0x00000020" name="CNENA"/>
          <bitfield mask="0x00000040" name="CNENA"/>
          <bitfield mask="0x00000080" name="CNENA"/>
          <bitfield mask="0x00000100" name="CNENA"/>
          <bitfield mask="0x00000200" name="CNENA"/>
          <bitfield mask="0x00000400" name="CNENA"/>
          <bitfield mask="0x00000800" name="CNENA"/>
          <bitfield mask="0x00001000" name="CNENA"/>
          <bitfield mask="0x00002000" name="CNENA"/>
          <bitfield mask="0x00004000" name="CNENA"/>
          <bitfield mask="0x00008000" name="CNENA"/>
        </register>
        <register caption="" name="CNENB" offset="0x180" rw="RW" size="4">
          <bitfield mask="0x00000001" name="CNENB"/>
          <bitfield mask="0x00000002" name="CNENB"/>
          <bitfield mask="0x00000004" name="CNENB"/>
          <bitfield mask="0x00000008" name="CNENB"/>
          <bitfield mask="0x00000010" name="CNENB"/>
          <bitfield mask="0x00000020" name="CNENB"/>
          <bitfield mask="0x00000040" name="CNENB"/>
          <bitfield mask="0x00000080" name="CNENB"/>
          <bitfield mask="0x00000100" name="CNENB"/>
          <bitfield mask="0x00000200" name="CNENB"/>
          <bitfield mask="0x00000400" name="CNENB"/>
          <bitfield mask="0x00000800" name="CNENB"/>
          <bitfield mask="0x00001000" name="CNENB"/>
          <bitfield mask="0x00002000" name="CNENB"/>
          <bitfield mask="0x00004000" name="CNENB"/>
          <bitfield mask="0x00008000" name="CNENB"/>
        </register>
        <register caption="" name="CNENC" offset="0x280" rw="RW" size="4">
          <bitfield mask="0x00000001" name="CNENC"/>
          <bitfield mask="0x00000002" name="CNENC"/>
          <bitfield mask="0x00000004" name="CNENC"/>
          <bitfield mask="0x00000008" name="CNENC"/>
          <bitfield mask="0x00000010" name="CNENC"/>
          <bitfield mask="0x00000020" name="CNENC"/>
          <bitfield mask="0x00000040" name="CNENC"/>
          <bitfield mask="0x00000080" name="CNENC"/>
          <bitfield mask="0x00000100" name="CNENC"/>
          <bitfield mask="0x00000200" name="CNENC"/>
          <bitfield mask="0x00000400" name="CNENC"/>
          <bitfield mask="0x00000800" name="CNENC"/>
          <bitfield mask="0x00001000" name="CNENC"/>
          <bitfield mask="0x00002000" name="CNENC"/>
          <bitfield mask="0x00004000" name="CNENC"/>
          <bitfield mask="0x00008000" name="CNENC"/>
        </register>
        <register caption="" name="CNENK" offset="0x380" rw="RW" size="4">
          <bitfield mask="0x00000001" name="CNENK"/>
          <bitfield mask="0x00000002" name="CNENK"/>
          <bitfield mask="0x00000004" name="CNENK"/>
          <bitfield mask="0x00000008" name="CNENK"/>
          <bitfield mask="0x00000010" name="CNENK"/>
          <bitfield mask="0x00000020" name="CNENK"/>
          <bitfield mask="0x00000040" name="CNENK"/>
          <bitfield mask="0x00000080" name="CNENK"/>
          <bitfield mask="0x00000100" name="CNENK"/>
          <bitfield mask="0x00000200" name="CNENK"/>
          <bitfield mask="0x00000400" name="CNENK"/>
          <bitfield mask="0x00000800" name="CNENK"/>
          <bitfield mask="0x00001000" name="CNENK"/>
          <bitfield mask="0x00002000" name="CNENK"/>
          <bitfield mask="0x00004000" name="CNENK"/>
          <bitfield mask="0x00008000" name="CNENK"/>
        </register>
        <register caption="" name="CNSTATA" offset="0x90" rw="RW" size="4">
          <bitfield mask="0x00000001" name="CNSTATA"/>
          <bitfield mask="0x00000002" name="CNSTATA"/>
          <bitfield mask="0x00000004" name="CNSTATA"/>
          <bitfield mask="0x00000008" name="CNSTATA"/>
          <bitfield mask="0x00000010" name="CNSTATA"/>
          <bitfield mask="0x00000020" name="CNSTATA"/>
          <bitfield mask="0x00000040" name="CNSTATA"/>
          <bitfield mask="0x00000080" name="CNSTATA"/>
          <bitfield mask="0x00000100" name="CNSTATA"/>
          <bitfield mask="0x00000200" name="CNSTATA"/>
          <bitfield mask="0x00000400" name="CNSTATA"/>
          <bitfield mask="0x00000800" name="CNSTATA"/>
          <bitfield mask="0x00001000" name="CNSTATA"/>
          <bitfield mask="0x00002000" name="CNSTATA"/>
          <bitfield mask="0x00004000" name="CNSTATA"/>
          <bitfield mask="0x00008000" name="CNSTATA"/>
        </register>
        <register caption="" name="CNSTATB" offset="0x190" rw="RW" size="4">
          <bitfield mask="0x00000001" name="CNSTATB"/>
          <bitfield mask="0x00000002" name="CNSTATB"/>
          <bitfield mask="0x00000004" name="CNSTATB"/>
          <bitfield mask="0x00000008" name="CNSTATB"/>
          <bitfield mask="0x00000010" name="CNSTATB"/>
          <bitfield mask="0x00000020" name="CNSTATB"/>
          <bitfield mask="0x00000040" name="CNSTATB"/>
          <bitfield mask="0x00000080" name="CNSTATB"/>
          <bitfield mask="0x00000100" name="CNSTATB"/>
          <bitfield mask="0x00000200" name="CNSTATB"/>
          <bitfield mask="0x00000400" name="CNSTATB"/>
          <bitfield mask="0x00000800" name="CNSTATB"/>
          <bitfield mask="0x00001000" name="CNSTATB"/>
          <bitfield mask="0x00002000" name="CNSTATB"/>
          <bitfield mask="0x00004000" name="CNSTATB"/>
          <bitfield mask="0x00008000" name="CNSTATB"/>
        </register>
        <register caption="" name="CNSTATC" offset="0x290" rw="RW" size="4">
          <bitfield mask="0x00000001" name="CNSTATC"/>
          <bitfield mask="0x00000002" name="CNSTATC"/>
          <bitfield mask="0x00000004" name="CNSTATC"/>
          <bitfield mask="0x00000008" name="CNSTATC"/>
          <bitfield mask="0x00000010" name="CNSTATC"/>
          <bitfield mask="0x00000020" name="CNSTATC"/>
          <bitfield mask="0x00000040" name="CNSTATC"/>
          <bitfield mask="0x00000080" name="CNSTATC"/>
          <bitfield mask="0x00000100" name="CNSTATC"/>
          <bitfield mask="0x00000200" name="CNSTATC"/>
          <bitfield mask="0x00000400" name="CNSTATC"/>
          <bitfield mask="0x00000800" name="CNSTATC"/>
          <bitfield mask="0x00001000" name="CNSTATC"/>
          <bitfield mask="0x00002000" name="CNSTATC"/>
          <bitfield mask="0x00004000" name="CNSTATC"/>
          <bitfield mask="0x00008000" name="CNSTATC"/>
        </register>
        <register caption="" name="CNSTATK" offset="0x390" rw="RW" size="4">
          <bitfield mask="0x00000001" name="CNSTATK"/>
          <bitfield mask="0x00000002" name="CNSTATK"/>
          <bitfield mask="0x00000004" name="CNSTATK"/>
          <bitfield mask="0x00000008" name="CNSTATK"/>
          <bitfield mask="0x00000010" name="CNSTATK"/>
          <bitfield mask="0x00000020" name="CNSTATK"/>
          <bitfield mask="0x00000040" name="CNSTATK"/>
          <bitfield mask="0x00000080" name="CNSTATK"/>
          <bitfield mask="0x00000100" name="CNSTATK"/>
          <bitfield mask="0x00000200" name="CNSTATK"/>
          <bitfield mask="0x00000400" name="CNSTATK"/>
          <bitfield mask="0x00000800" name="CNSTATK"/>
          <bitfield mask="0x00001000" name="CNSTATK"/>
          <bitfield mask="0x00002000" name="CNSTATK"/>
          <bitfield mask="0x00004000" name="CNSTATK"/>
          <bitfield mask="0x00008000" name="CNSTATK"/>
        </register>
        <register caption="" name="CNNEA" offset="0xa0" rw="RW" size="4">
          <bitfield mask="0x00000001" name="CNNEA"/>
          <bitfield mask="0x00000002" name="CNNEA"/>
          <bitfield mask="0x00000004" name="CNNEA"/>
          <bitfield mask="0x00000008" name="CNNEA"/>
          <bitfield mask="0x00000010" name="CNNEA"/>
          <bitfield mask="0x00000020" name="CNNEA"/>
          <bitfield mask="0x00000040" name="CNNEA"/>
          <bitfield mask="0x00000080" name="CNNEA"/>
          <bitfield mask="0x00000100" name="CNNEA"/>
          <bitfield mask="0x00000200" name="CNNEA"/>
          <bitfield mask="0x00000400" name="CNNEA"/>
          <bitfield mask="0x00000800" name="CNNEA"/>
          <bitfield mask="0x00001000" name="CNNEA"/>
          <bitfield mask="0x00002000" name="CNNEA"/>
          <bitfield mask="0x00004000" name="CNNEA"/>
          <bitfield mask="0x00008000" name="CNNEA"/>
        </register>
        <register caption="" name="CNNEB" offset="0x1a0" rw="RW" size="4">
          <bitfield mask="0x00000001" name="CNNEB"/>
          <bitfield mask="0x00000002" name="CNNEB"/>
          <bitfield mask="0x00000004" name="CNNEB"/>
          <bitfield mask="0x00000008" name="CNNEB"/>
          <bitfield mask="0x00000010" name="CNNEB"/>
          <bitfield mask="0x00000020" name="CNNEB"/>
          <bitfield mask="0x00000040" name="CNNEB"/>
          <bitfield mask="0x00000080" name="CNNEB"/>
          <bitfield mask="0x00000100" name="CNNEB"/>
          <bitfield mask="0x00000200" name="CNNEB"/>
          <bitfield mask="0x00000400" name="CNNEB"/>
          <bitfield mask="0x00000800" name="CNNEB"/>
          <bitfield mask="0x00001000" name="CNNEB"/>
          <bitfield mask="0x00002000" name="CNNEB"/>
          <bitfield mask="0x00004000" name="CNNEB"/>
          <bitfield mask="0x00008000" name="CNNEB"/>
        </register>
        <register caption="" name="CNNEC" offset="0x2a0" rw="RW" size="4">
          <bitfield mask="0x00000001" name="CNNEC"/>
          <bitfield mask="0x00000002" name="CNNEC"/>
          <bitfield mask="0x00000004" name="CNNEC"/>
          <bitfield mask="0x00000008" name="CNNEC"/>
          <bitfield mask="0x00000010" name="CNNEC"/>
          <bitfield mask="0x00000020" name="CNNEC"/>
          <bitfield mask="0x00000040" name="CNNEC"/>
          <bitfield mask="0x00000080" name="CNNEC"/>
          <bitfield mask="0x00000100" name="CNNEC"/>
          <bitfield mask="0x00000200" name="CNNEC"/>
          <bitfield mask="0x00000400" name="CNNEC"/>
          <bitfield mask="0x00000800" name="CNNEC"/>
          <bitfield mask="0x00001000" name="CNNEC"/>
          <bitfield mask="0x00002000" name="CNNEC"/>
          <bitfield mask="0x00004000" name="CNNEC"/>
          <bitfield mask="0x00008000" name="CNNEC"/>
        </register>
        <register caption="" name="CNNEK" offset="0x3a0" rw="RW" size="4">
          <bitfield mask="0x00000001" name="CNNEK"/>
          <bitfield mask="0x00000002" name="CNNEK"/>
          <bitfield mask="0x00000004" name="CNNEK"/>
          <bitfield mask="0x00000008" name="CNNEK"/>
          <bitfield mask="0x00000010" name="CNNEK"/>
          <bitfield mask="0x00000020" name="CNNEK"/>
          <bitfield mask="0x00000040" name="CNNEK"/>
          <bitfield mask="0x00000080" name="CNNEK"/>
          <bitfield mask="0x00000100" name="CNNEK"/>
          <bitfield mask="0x00000200" name="CNNEK"/>
          <bitfield mask="0x00000400" name="CNNEK"/>
          <bitfield mask="0x00000800" name="CNNEK"/>
          <bitfield mask="0x00001000" name="CNNEK"/>
          <bitfield mask="0x00002000" name="CNNEK"/>
          <bitfield mask="0x00004000" name="CNNEK"/>
          <bitfield mask="0x00008000" name="CNNEK"/>
        </register>
        <register caption="" name="CNFA" offset="0xb0" rw="RW" size="4">
          <bitfield mask="0x00000001" name="CNFA"/>
          <bitfield mask="0x00000002" name="CNFA"/>
          <bitfield mask="0x00000004" name="CNFA"/>
          <bitfield mask="0x00000008" name="CNFA"/>
          <bitfield mask="0x00000010" name="CNFA"/>
          <bitfield mask="0x00000020" name="CNFA"/>
          <bitfield mask="0x00000040" name="CNFA"/>
          <bitfield mask="0x00000080" name="CNFA"/>
          <bitfield mask="0x00000100" name="CNFA"/>
          <bitfield mask="0x00000200" name="CNFA"/>
          <bitfield mask="0x00000400" name="CNFA"/>
          <bitfield mask="0x00000800" name="CNFA"/>
          <bitfield mask="0x00001000" name="CNFA"/>
          <bitfield mask="0x00002000" name="CNFA"/>
          <bitfield mask="0x00004000" name="CNFA"/>
          <bitfield mask="0x00008000" name="CNFA"/>
        </register>
        <register caption="" name="CNFB" offset="0x1b0" rw="RW" size="4">
          <bitfield mask="0x00000001" name="CNFB"/>
          <bitfield mask="0x00000002" name="CNFB"/>
          <bitfield mask="0x00000004" name="CNFB"/>
          <bitfield mask="0x00000008" name="CNFB"/>
          <bitfield mask="0x00000010" name="CNFB"/>
          <bitfield mask="0x00000020" name="CNFB"/>
          <bitfield mask="0x00000040" name="CNFB"/>
          <bitfield mask="0x00000080" name="CNFB"/>
          <bitfield mask="0x00000100" name="CNFB"/>
          <bitfield mask="0x00000200" name="CNFB"/>
          <bitfield mask="0x00000400" name="CNFB"/>
          <bitfield mask="0x00000800" name="CNFB"/>
          <bitfield mask="0x00001000" name="CNFB"/>
          <bitfield mask="0x00002000" name="CNFB"/>
          <bitfield mask="0x00004000" name="CNFB"/>
          <bitfield mask="0x00008000" name="CNFB"/>
        </register>
        <register caption="" name="CNFC" offset="0x2b0" rw="RW" size="4">
          <bitfield mask="0x00000001" name="CNFC"/>
          <bitfield mask="0x00000002" name="CNFC"/>
          <bitfield mask="0x00000004" name="CNFC"/>
          <bitfield mask="0x00000008" name="CNFC"/>
          <bitfield mask="0x00000010" name="CNFC"/>
          <bitfield mask="0x00000020" name="CNFC"/>
          <bitfield mask="0x00000040" name="CNFC"/>
          <bitfield mask="0x00000080" name="CNFC"/>
          <bitfield mask="0x00000100" name="CNFC"/>
          <bitfield mask="0x00000200" name="CNFC"/>
          <bitfield mask="0x00000400" name="CNFC"/>
          <bitfield mask="0x00000800" name="CNFC"/>
          <bitfield mask="0x00001000" name="CNFC"/>
          <bitfield mask="0x00002000" name="CNFC"/>
          <bitfield mask="0x00004000" name="CNFC"/>
          <bitfield mask="0x00008000" name="CNFC"/>
        </register>
