Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
        <register caption="I2C Status Register" name="I2C2STAT" offset="0x20010" rw="R" size="4">
          <bitfield caption="Transmit Buffer Full Status bit" mask="0x00000001" name="TBF" values="I2C2STAT__TBF"/>
          <bitfield caption="Receive Buffer Full Status bit" mask="0x00000002" name="RBF" values="I2C2STAT__RBF"/>
          <bitfield caption="Read/Write Information bit" mask="0x00000004" name="R_W" values="I2C2STAT__R_W"/>
          <bitfield caption="Start bit" mask="0x00000008" name="S" values="I2C2STAT__S"/>
          <bitfield caption="Stop bit" mask="0x00000010" name="P" values="I2C2STAT__P"/>
          <bitfield caption="Data/Address bit" mask="0x00000020" name="D_A" values="I2C2STAT__D_A"/>
          <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="I2COV" values="I2C2STAT__I2COV"/>
          <bitfield caption="Write Collision Detect bit" mask="0x00000080" name="IWCOL" values="I2C2STAT__IWCOL"/>
          <bitfield caption="10-bit Address Status bit" mask="0x00000100" name="ADD10" values="I2C2STAT__ADD10"/>
          <bitfield caption="General Call Status bit" mask="0x00000200" name="GCSTAT" values="I2C2STAT__GCSTAT"/>
          <bitfield caption="Master Bus Collision Detect bit" mask="0x00000400" name="BCL" values="I2C2STAT__BCL"/>
          <bitfield caption="Acknowledge Time Status bit" mask="0x00002000" name="ACKTIM" values="I2C2STAT__ACKTIM"/>
          <bitfield caption="Transmit Status bit" mask="0x00004000" name="TRSTAT" values="I2C2STAT__TRSTAT"/>
          <bitfield caption="Acknowledge Status bit" mask="0x00008000" name="ACKSTAT" values="I2C2STAT__ACKSTAT"/>
        </register>
        <register caption="" name="I2C1ADD" offset="0x20" rw="RW" size="4">
          <bitfield mask="0x000003FF" name="I2CADD"/>
        </register>
        <register caption="" name="I2C2ADD" offset="0x20020" rw="RW" size="4">
          <bitfield mask="0x000003FF" name="I2CADD"/>
        </register>
        <register caption="" name="I2C1MSK" offset="0x30" rw="RW" size="4">
          <bitfield mask="0x000003FF" name="I2CMSK"/>
        </register>
        <register caption="" name="I2C2MSK" offset="0x20030" rw="RW" size="4">
          <bitfield mask="0x000003FF" name="I2CMSK"/>
        </register>
        <register caption="" name="I2C1BRG" offset="0x40" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="I2CBRG"/>
        </register>
        <register caption="" name="I2C2BRG" offset="0x20040" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="I2CBRG"/>
        </register>
        <register caption="" name="I2C1TRN" offset="0x50" rw="W" size="4">
          <bitfield mask="0x000000FF" name="I2CTRN"/>
        </register>
        <register caption="" name="I2C2TRN" offset="0x20050" rw="W" size="4">
          <bitfield mask="0x000000FF" name="I2CTRN"/>
        </register>
        <register caption="" name="I2C1RCV" offset="0x60" rw="R" size="4">
          <bitfield mask="0x000000FF" name="I2CRCV"/>
        </register>
        <register caption="" name="I2C2RCV" offset="0x20060" rw="R" size="4">
          <bitfield mask="0x000000FF" name="I2CRCV"/>
        </register>
      </register-group>
      <value-group caption="Start Condition Enable bit" name="I2C1CON__SEN">
        <value caption="Initiate Start condition on SDAx and SCLx pins. Hardware clear at end of master Start sequence." name="" value="0x1"/>
        <value caption="Start condition not in progress" name="" value="0x0"/>
      </value-group>
      <value-group caption="Repeated Start Condition Enable bit" name="I2C1CON__RSEN">
        <value caption="Initiate Repeated Start condition on SDAx and SCLx pins. Hardware clear at end of master Repeated Start sequence." name="" value="0x1"/>
        <value caption="Repeated Start condition not in progress" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop Condition Enable bit" name="I2C1CON__PEN">
        <value caption="Initiate Stop condition on SDAx and SCLx pins. Hardware clear at end of master Stop sequence." name="" value="0x1"/>
        <value caption="Stop condition not in progress" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Enable bit" name="I2C1CON__RCEN">
        <value caption="Enables Receive mode for I2C. Hardware clear at end of eighth bit of master receive data byte." name="" value="0x1"/>
        <value caption="Receive sequence not in progress" name="" value="0x0"/>
      </value-group>
      <value-group caption="Acknowledge Sequence Enable bit" name="I2C1CON__ACKEN">
        <value caption="Initiate Acknowledge sequence on SDAx and SCLx pins and transmit ACKDT data bit. Hardware clear at end of master Acknowledge sequence." name="" value="0x1"/>
        <value caption="Acknowledge sequence not in progress" name="" value="0x0"/>
      </value-group>
      <value-group caption="Acknowledge Data bit" name="I2C1CON__ACKDT">
        <value caption="Send NACK during Acknowledge" name="" value="0x1"/>
        <value caption="Send ACK during Acknowledge" name="" value="0x0"/>
      </value-group>
      <value-group caption="SCLx Clock Stretch Enable bit" name="I2C1CON__STREN">
        <value caption="Enable software or receive clock stretching" name="" value="0x1"/>
        <value caption="Disable software or receive clock stretching" name="" value="0x0"/>
      </value-group>
      <value-group caption="General Call Enable bit" name="I2C1CON__GCEN">
        <value caption="Enable interrupt when a general call address is received in the I2CxRSR(module is enabled for reception)" name="" value="0x1"/>
        <value caption="General call address is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="SMBus Input Levels bit" name="I2C1CON__SMEN">
        <value caption="Enable I/O pin thresholds compliant with SMBus specification" name="" value="0x1"/>
        <value caption="Disable SMBus input thresholds" name="" value="0x0"/>
      </value-group>
      <value-group caption="Disable Slew Rate Control bit" name="I2C1CON__DISSLW">
        <value caption="Slew rate control is disabled" name="" value="0x1"/>
        <value caption="Slew rate control is enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="10-bit Slave Address bit" name="I2C1CON__A10M">
        <value caption="I2CxADD is a 10-bit slave address" name="" value="0x1"/>
        <value caption="I2CxADD is a 7-bit slave address" name="" value="0x0"/>
      </value-group>
      <value-group caption="Strict I 2 C Reserved Address Rule Enable bit" name="I2C1CON__STRICT">
        <value caption="Strict reserved addressing is enforced. Device does not respond to reserved address space or generate addresses in reserved address space." name="" value="0x1"/>
        <value caption="Strict I2C Reserved Address Rule is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="SCLx Release Control bit" name="I2C1CON__SCLREL">
        <value caption="Release SCLx clock" name="" value="0x1"/>
        <value caption="Hold SCLx clock low (clock stretch)" name="" value="0x0"/>
      </value-group>
