Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
        <register caption="Interrupt Priority Control Register 2" name="IPC2" offset="0x160" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="INT1IS" values="IPC2__INT1IS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="INT1IP" values="IPC2__INT1IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00000300" name="T2IS" values="IPC2__T2IS"/>
          <bitfield caption="Interrupt priority" mask="0x00001C00" name="T2IP" values="IPC2__T2IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="IC2EIS" values="IPC2__IC2EIS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="IC2EIP" values="IPC2__IC2EIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="IC2IS" values="IPC2__IC2IS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="IC2IP" values="IPC2__IC2IP"/>
        </register>
        <register caption="Interrupt Priority Control Register 3" name="IPC3" offset="0x170" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="OC2IS" values="IPC3__OC2IS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="OC2IP" values="IPC3__OC2IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00000300" name="INT2IS" values="IPC3__INT2IS"/>
          <bitfield caption="Interrupt priority" mask="0x00001C00" name="INT2IP" values="IPC3__INT2IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="T3IS" values="IPC3__T3IS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="T3IP" values="IPC3__T3IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="IC3EIS" values="IPC3__IC3EIS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="IC3EIP" values="IPC3__IC3EIP"/>
        </register>
        <register caption="Interrupt Priority Control Register 4" name="IPC4" offset="0x180" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="IC3IS" values="IPC4__IC3IS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="IC3IP" values="IPC4__IC3IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00000300" name="OC3IS" values="IPC4__OC3IS"/>
          <bitfield caption="Interrupt priority" mask="0x00001C00" name="OC3IP" values="IPC4__OC3IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="INT3IS" values="IPC4__INT3IS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="INT3IP" values="IPC4__INT3IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="T4IS" values="IPC4__T4IS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="T4IP" values="IPC4__T4IP"/>
        </register>
        <register caption="Interrupt Priority Control Register 5" name="IPC5" offset="0x190" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="IC4EIS" values="IPC5__IC4EIS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="IC4EIP" values="IPC5__IC4EIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00000300" name="IC4IS" values="IPC5__IC4IS"/>
          <bitfield caption="Interrupt priority" mask="0x00001C00" name="IC4IP" values="IPC5__IC4IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="OC4IS" values="IPC5__OC4IS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="OC4IP" values="IPC5__OC4IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="INT4IS" values="IPC5__INT4IS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="INT4IP" values="IPC5__INT4IP"/>
        </register>
        <register caption="Interrupt Priority Control Register 6" name="IPC6" offset="0x1a0" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="T5IS" values="IPC6__T5IS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="T5IP" values="IPC6__T5IP"/>
        </register>
        <register caption="Interrupt Priority Control Register 7" name="IPC7" offset="0x1b0" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="FCEIS" values="IPC7__FCEIS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="FCEIP" values="IPC7__FCEIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="PREIS" values="IPC7__PREIS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="PREIP" values="IPC7__PREIP"/>
        </register>
        <register caption="Interrupt Priority Control Register 8" name="IPC8" offset="0x1c0" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="PFWCRCIS" values="IPC8__PFWCRCIS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="PFWCRCIP" values="IPC8__PFWCRCIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00000300" name="RTCCIS" values="IPC8__RTCCIS"/>
          <bitfield caption="Interrupt priority" mask="0x00001C00" name="RTCCIP" values="IPC8__RTCCIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="USBIS" values="IPC8__USBIS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="USBIP" values="IPC8__USBIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="SPI1EIS" values="IPC8__SPI1EIS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="SPI1EIP" values="IPC8__SPI1EIP"/>
        </register>
        <register caption="Interrupt Priority Control Register 9" name="IPC9" offset="0x1d0" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="SPI1RXIS" values="IPC9__SPI1RXIS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="SPI1RXIP" values="IPC9__SPI1RXIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00000300" name="SPI1TXIS" values="IPC9__SPI1TXIS"/>
          <bitfield caption="Interrupt priority" mask="0x00001C00" name="SPI1TXIP" values="IPC9__SPI1TXIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="U1EIS" values="IPC9__U1EIS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="U1EIP" values="IPC9__U1EIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="U1RXIS" values="IPC9__U1RXIS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="U1RXIP" values="IPC9__U1RXIP"/>
        </register>
        <register caption="Interrupt Priority Control Register 10" name="IPC10" offset="0x1e0" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="U1TXIS" values="IPC10__U1TXIS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="U1TXIP" values="IPC10__U1TXIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00000300" name="I2C1BIS" values="IPC10__I2C1BIS"/>
          <bitfield caption="Interrupt priority" mask="0x00001C00" name="I2C1BIP" values="IPC10__I2C1BIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="I2C1SIS" values="IPC10__I2C1SIS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="I2C1SIP" values="IPC10__I2C1SIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="I2C1MIS" values="IPC10__I2C1MIS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="I2C1MIP" values="IPC10__I2C1MIP"/>
        </register>
        <register caption="Interrupt Priority Control Register 11" name="IPC11" offset="0x1f0" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="CNAIS" values="IPC11__CNAIS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="CNAIP" values="IPC11__CNAIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00000300" name="CNBIS" values="IPC11__CNBIS"/>
          <bitfield caption="Interrupt priority" mask="0x00001C00" name="CNBIP" values="IPC11__CNBIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="CNCIS" values="IPC11__CNCIS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="CNCIP" values="IPC11__CNCIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="CNKIS" values="IPC11__CNKIS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="CNKIP" values="IPC11__CNKIP"/>
        </register>
        <register caption="Interrupt Priority Control Register 13" name="IPC13" offset="0x210" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000300" name="SPI2EIS" values="IPC13__SPI2EIS"/>
          <bitfield caption="Interrupt priority" mask="0x00001C00" name="SPI2EIP" values="IPC13__SPI2EIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="SPI2RXIS" values="IPC13__SPI2RXIS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="SPI2RXIP" values="IPC13__SPI2RXIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="SPI2TXIS" values="IPC13__SPI2TXIS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="SPI2TXIP" values="IPC13__SPI2TXIP"/>
        </register>
        <register caption="Interrupt Priority Control Register 14" name="IPC14" offset="0x220" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="U2EIS" values="IPC14__U2EIS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="U2EIP" values="IPC14__U2EIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00000300" name="U2RXIS" values="IPC14__U2RXIS"/>
          <bitfield caption="Interrupt priority" mask="0x00001C00" name="U2RXIP" values="IPC14__U2RXIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="U2TXIS" values="IPC14__U2TXIS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="U2TXIP" values="IPC14__U2TXIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="I2C2BIS" values="IPC14__I2C2BIS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="I2C2BIP" values="IPC14__I2C2BIP"/>
        </register>
        <register caption="Interrupt Priority Control Register 15" name="IPC15" offset="0x230" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="I2C2SIS" values="IPC15__I2C2SIS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="I2C2SIP" values="IPC15__I2C2SIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00000300" name="I2C2MIS" values="IPC15__I2C2MIS"/>
          <bitfield caption="Interrupt priority" mask="0x00001C00" name="I2C2MIP" values="IPC15__I2C2MIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="U3EIS" values="IPC15__U3EIS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="U3EIP" values="IPC15__U3EIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="U3RXIS" values="IPC15__U3RXIS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="U3RXIP" values="IPC15__U3RXIP"/>
        </register>
        <register caption="Interrupt Priority Control Register 16" name="IPC16" offset="0x240" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="U3TXIS" values="IPC16__U3TXIS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="U3TXIP" values="IPC16__U3TXIP"/>
        </register>
