Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
        <register caption="Interrupt Priority Control Register 17" name="IPC17" offset="0x250" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="DMA0IS" values="IPC17__DMA0IS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="DMA0IP" values="IPC17__DMA0IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00000300" name="DMA1IS" values="IPC17__DMA1IS"/>
          <bitfield caption="Interrupt priority" mask="0x00001C00" name="DMA1IP" values="IPC17__DMA1IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="DMA2IS" values="IPC17__DMA2IS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="DMA2IP" values="IPC17__DMA2IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="DMA3IS" values="IPC17__DMA3IS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="DMA3IP" values="IPC17__DMA3IP"/>
        </register>
        <register caption="Interrupt Priority Control Register 18" name="IPC18" offset="0x260" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="DMA4IS" values="IPC18__DMA4IS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="DMA4IP" values="IPC18__DMA4IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00000300" name="DMA5IS" values="IPC18__DMA5IS"/>
          <bitfield caption="Interrupt priority" mask="0x00001C00" name="DMA5IP" values="IPC18__DMA5IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="DMA6IS" values="IPC18__DMA6IS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="DMA6IP" values="IPC18__DMA6IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="DMA7IS" values="IPC18__DMA7IS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="DMA7IP" values="IPC18__DMA7IP"/>
        </register>
        <register caption="Interrupt Priority Control Register 19" name="IPC19" offset="0x270" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="T6IS" values="IPC19__T6IS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="T6IP" values="IPC19__T6IP"/>
        </register>
        <register caption="Interrupt Priority Control Register 20" name="IPC20" offset="0x280" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="T7IS" values="IPC20__T7IS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="T7IP" values="IPC20__T7IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="RFSMCIS" values="IPC20__RFSMCIS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="RFSMCIP" values="IPC20__RFSMCIP"/>
        </register>
        <register caption="Interrupt Priority Control Register 21" name="IPC21" offset="0x290" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="RFMACIS" values="IPC21__RFMACIS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="RFMACIP" values="IPC21__RFMACIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00000300" name="CTREVIS" values="IPC21__CTREVIS"/>
          <bitfield caption="Interrupt priority" mask="0x00001C00" name="CTREVIP" values="IPC21__CTREVIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="RFTM0IS" values="IPC21__RFTM0IS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="RFTM0IP" values="IPC21__RFTM0IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="RFTM1IS" values="IPC21__RFTM1IS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="RFTM1IP" values="IPC21__RFTM1IP"/>
        </register>
        <register caption="Interrupt Priority Control Register 22" name="IPC22" offset="0x2a0" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="RFTM2IS" values="IPC22__RFTM2IS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="RFTM2IP" values="IPC22__RFTM2IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00000300" name="RFTM3IS" values="IPC22__RFTM3IS"/>
          <bitfield caption="Interrupt priority" mask="0x00001C00" name="RFTM3IP" values="IPC22__RFTM3IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="CTRTRGIS" values="IPC22__CTRTRGIS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="CTRTRGIP" values="IPC22__CTRTRGIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="RFWCOEIS" values="IPC22__RFWCOEIS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="RFWCOEIP" values="IPC22__RFWCOEIP"/>
        </register>
        <register caption="Interrupt Priority Control Register 23" name="IPC23" offset="0x2b0" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="AD1IS" values="IPC23__AD1IS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="AD1IP" values="IPC23__AD1IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="AD1DC1IS" values="IPC23__AD1DC1IS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="AD1DC1IP" values="IPC23__AD1DC1IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="AD1DC2IS" values="IPC23__AD1DC2IS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="AD1DC2IP" values="IPC23__AD1DC2IP"/>
        </register>
        <register caption="Interrupt Priority Control Register 24" name="IPC24" offset="0x2c0" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="AD1DF1IS" values="IPC24__AD1DF1IS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="AD1DF1IP" values="IPC24__AD1DF1IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00000300" name="AD1DF2IS" values="IPC24__AD1DF2IS"/>
          <bitfield caption="Interrupt priority" mask="0x00001C00" name="AD1DF2IP" values="IPC24__AD1DF2IP"/>
        </register>
