Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
        <register caption="Interrupt Priority Control Register 25" name="IPC25" offset="0x2d0" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="AD1DFIIS" values="IPC25__AD1DFIIS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="AD1DFIIP" values="IPC25__AD1DFIIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00000300" name="AD1EOSIS" values="IPC25__AD1EOSIS"/>
          <bitfield caption="Interrupt priority" mask="0x00001C00" name="AD1EOSIP" values="IPC25__AD1EOSIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="AD1ARIS" values="IPC25__AD1ARIS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="AD1ARIP" values="IPC25__AD1ARIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="AD1RSIS" values="IPC25__AD1RSIS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="AD1RSIP" values="IPC25__AD1RSIP"/>
        </register>
        <register caption="Interrupt Priority Control Register 26" name="IPC26" offset="0x2e0" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="AD1FCIS" values="IPC26__AD1FCIS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="AD1FCIP" values="IPC26__AD1FCIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="AD1I00IS" values="IPC26__AD1I00IS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="AD1I00IP" values="IPC26__AD1I00IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="AD1I01IS" values="IPC26__AD1I01IS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="AD1I01IP" values="IPC26__AD1I01IP"/>
        </register>
        <register caption="Interrupt Priority Control Register 27" name="IPC27" offset="0x2f0" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="AD1I02IS" values="IPC27__AD1I02IS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="AD1I02IP" values="IPC27__AD1I02IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00000300" name="AD1I03IS" values="IPC27__AD1I03IS"/>
          <bitfield caption="Interrupt priority" mask="0x00001C00" name="AD1I03IP" values="IPC27__AD1I03IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="AD1I04IS" values="IPC27__AD1I04IS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="AD1I04IP" values="IPC27__AD1I04IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="AD1I05IS" values="IPC27__AD1I05IS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="AD1I05IP" values="IPC27__AD1I05IP"/>
        </register>
        <register caption="Interrupt Priority Control Register 28" name="IPC28" offset="0x300" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="AD1I06IS" values="IPC28__AD1I06IS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="AD1I06IP" values="IPC28__AD1I06IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00000300" name="AD1I07IS" values="IPC28__AD1I07IS"/>
          <bitfield caption="Interrupt priority" mask="0x00001C00" name="AD1I07IP" values="IPC28__AD1I07IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="AD1I08IS" values="IPC28__AD1I08IS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="AD1I08IP" values="IPC28__AD1I08IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="AD1I09IS" values="IPC28__AD1I09IS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="AD1I09IP" values="IPC28__AD1I09IP"/>
        </register>
        <register caption="Interrupt Priority Control Register 29" name="IPC29" offset="0x310" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="AD1I10IS" values="IPC29__AD1I10IS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="AD1I10IP" values="IPC29__AD1I10IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00000300" name="AD1I11IS" values="IPC29__AD1I11IS"/>
          <bitfield caption="Interrupt priority" mask="0x00001C00" name="AD1I11IP" values="IPC29__AD1I11IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="AD1I12IS" values="IPC29__AD1I12IS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="AD1I12IP" values="IPC29__AD1I12IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="AD1I13IS" values="IPC29__AD1I13IS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="AD1I13IP" values="IPC29__AD1I13IP"/>
        </register>
        <register caption="Interrupt Priority Control Register 30" name="IPC30" offset="0x320" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="AD1I14IS" values="IPC30__AD1I14IS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="AD1I14IP" values="IPC30__AD1I14IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00000300" name="AD1I15IS" values="IPC30__AD1I15IS"/>
          <bitfield caption="Interrupt priority" mask="0x00001C00" name="AD1I15IP" values="IPC30__AD1I15IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="AD1I16IS" values="IPC30__AD1I16IS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="AD1I16IP" values="IPC30__AD1I16IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="AD1I17IS" values="IPC30__AD1I17IS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="AD1I17IP" values="IPC30__AD1I17IP"/>
        </register>
        <register caption="Interrupt Priority Control Register 31" name="IPC31" offset="0x330" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="AD1I18IS" values="IPC31__AD1I18IS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="AD1I18IP" values="IPC31__AD1I18IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00000300" name="AD1I19IS" values="IPC31__AD1I19IS"/>
          <bitfield caption="Interrupt priority" mask="0x00001C00" name="AD1I19IP" values="IPC31__AD1I19IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="AD1I20IS" values="IPC31__AD1I20IS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="AD1I20IP" values="IPC31__AD1I20IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="AD1I21IS" values="IPC31__AD1I21IS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="AD1I21IP" values="IPC31__AD1I21IP"/>
        </register>
