Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
        <register caption="Interrupt Vector Address Offset Register" name="OFF002" offset="0x548" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 002 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF002__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF003" offset="0x54c" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 003 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF003__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF004" offset="0x550" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 004 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF004__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF005" offset="0x554" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 005 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF005__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF006" offset="0x558" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 006 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF006__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF007" offset="0x55c" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 007 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF007__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF008" offset="0x560" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 008 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF008__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF009" offset="0x564" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 009 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF009__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF010" offset="0x568" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 010 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF010__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF011" offset="0x56c" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 011 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF011__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF012" offset="0x570" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 012 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF012__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF013" offset="0x574" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 013 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF013__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF014" offset="0x578" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 014 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF014__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF015" offset="0x57c" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 015 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF015__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF016" offset="0x580" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 016 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF016__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF017" offset="0x584" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 017 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF017__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF018" offset="0x588" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 018 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF018__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF019" offset="0x58c" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 019 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF019__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF020" offset="0x590" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 020 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF020__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF021" offset="0x594" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 021 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF021__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF022" offset="0x598" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 022 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF022__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF023" offset="0x59c" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 023 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF023__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF024" offset="0x5a0" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 024 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF024__VOFF"/>
        </register>
