Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
        <register caption="Interrupt Vector Address Offset Register" name="OFF030" offset="0x5b8" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 030 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF030__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF031" offset="0x5bc" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 031 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF031__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF032" offset="0x5c0" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 032 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF032__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF033" offset="0x5c4" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 033 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF033__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF034" offset="0x5c8" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 034 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF034__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF035" offset="0x5cc" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 035 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF035__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF036" offset="0x5d0" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 036 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF036__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF037" offset="0x5d4" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 037 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF037__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF038" offset="0x5d8" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 038 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF038__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF039" offset="0x5dc" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 039 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF039__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF040" offset="0x5e0" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 040 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF040__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF041" offset="0x5e4" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 041 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF041__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF042" offset="0x5e8" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 042 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF042__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF043" offset="0x5ec" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 043 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF043__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF044" offset="0x5f0" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 044 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF044__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF045" offset="0x5f4" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 045 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF045__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF046" offset="0x5f8" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 046 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF046__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF047" offset="0x5fc" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 047 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF047__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF053" offset="0x614" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 053 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF053__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF054" offset="0x618" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 054 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF054__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF055" offset="0x61c" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 055 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF055__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF056" offset="0x620" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 056 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF056__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF057" offset="0x624" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 057 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF057__VOFF"/>
        </register>
