Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
        <register caption="Interrupt Vector Address Offset Register" name="OFF095" offset="0x6bc" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 095 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF095__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF096" offset="0x6c0" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 096 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF096__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF097" offset="0x6c4" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 097 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF097__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF100" offset="0x6d0" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 100 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF100__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF101" offset="0x6d4" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 101 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF101__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF102" offset="0x6d8" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 102 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF102__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF103" offset="0x6dc" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 103 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF103__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF104" offset="0x6e0" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 104 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF104__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF106" offset="0x6e8" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 106 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF106__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF107" offset="0x6ec" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 107 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF107__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF108" offset="0x6f0" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 108 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF108__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF109" offset="0x6f4" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 109 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF109__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF110" offset="0x6f8" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 110 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF110__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF111" offset="0x6fc" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 111 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF111__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF112" offset="0x700" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 112 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF112__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF113" offset="0x704" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 113 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF113__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF114" offset="0x708" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 114 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF114__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF115" offset="0x70c" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 115 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF115__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF116" offset="0x710" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 116 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF116__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF117" offset="0x714" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 117 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF117__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF118" offset="0x718" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 118 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF118__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF119" offset="0x71c" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 119 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF119__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF120" offset="0x720" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 120 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF120__VOFF"/>
        </register>
