Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
        <register caption="Interrupt Vector Address Offset Register" name="OFF121" offset="0x724" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 121 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF121__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF122" offset="0x728" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 122 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF122__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF123" offset="0x72c" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 123 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF123__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF124" offset="0x730" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 124 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF124__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF125" offset="0x734" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 125 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF125__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF126" offset="0x738" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 126 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF126__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF127" offset="0x73c" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 127 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF127__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF128" offset="0x740" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 128 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF128__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF129" offset="0x744" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 129 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF129__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF142" offset="0x778" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 142 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF142__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF143" offset="0x77c" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 143 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF143__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF144" offset="0x780" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 144 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF144__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF145" offset="0x784" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 145 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF145__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF152" offset="0x7a0" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 152 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF152__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF153" offset="0x7a4" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 153 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF153__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF154" offset="0x7a8" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 154 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF154__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF155" offset="0x7ac" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 155 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF155__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF156" offset="0x7b0" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 156 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF156__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF157" offset="0x7b4" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 157 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF157__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF162" offset="0x7c8" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 162 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF162__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF163" offset="0x7cc" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 163 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF163__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF164" offset="0x7d0" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 164 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF164__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF165" offset="0x7d4" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 165 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF165__VOFF"/>
        </register>
