Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
      <value-group caption="Interrupt Enable bit 7" name="IEC0__OC1IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 8" name="IEC0__INT1IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 9" name="IEC0__T2IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 10" name="IEC0__IC2EIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 11" name="IEC0__IC2IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 12" name="IEC0__OC2IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 13" name="IEC0__INT2IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 14" name="IEC0__T3IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 15" name="IEC0__IC3EIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 16" name="IEC0__IC3IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 17" name="IEC0__OC3IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 18" name="IEC0__INT3IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 19" name="IEC0__T4IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 20" name="IEC0__IC4EIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 21" name="IEC0__IC4IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 22" name="IEC0__OC4IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 23" name="IEC0__INT4IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 24" name="IEC0__T5IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 30" name="IEC0__FCEIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 31" name="IEC0__PREIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 0" name="IEC1__PFWCRCIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 1" name="IEC1__RTCCIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 2" name="IEC1__USBIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 3" name="IEC1__SPI1EIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 4" name="IEC1__SPI1RXIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 5" name="IEC1__SPI1TXIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 6" name="IEC1__U1EIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 7" name="IEC1__U1RXIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 8" name="IEC1__U1TXIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 9" name="IEC1__I2C1BIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 10" name="IEC1__I2C1SIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 11" name="IEC1__I2C1MIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 12" name="IEC1__CNAIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 13" name="IEC1__CNBIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 14" name="IEC1__CNCIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
