Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
      <value-group caption="Interrupt Enable bit 24" name="IEC3__ADCD14IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 25" name="IEC3__ADCD15IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 26" name="IEC3__ADCD16IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 27" name="IEC3__ADCD17IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 28" name="IEC3__ADCD18IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 29" name="IEC3__ADCD19IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 30" name="IEC3__ADCD20IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 31" name="IEC3__ADCD21IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 0" name="IEC4__ADCD22IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 1" name="IEC4__ADCD23IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 14" name="IEC4__CAN1IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 15" name="IEC4__CAN2RXIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 16" name="IEC4__CAN2TXIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 17" name="IEC4__CAN2IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 22" name="IEC4__SQIIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 24" name="IEC4__PTGSTEPIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 25" name="IEC4__PTGWDTIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 26" name="IEC4__PTG0TR0IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 27" name="IEC4__PTG0TR1IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 28" name="IEC4__PTG0TR2IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 29" name="IEC4__PTG0TR3IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 2" name="IEC5__MPUPCIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 3" name="IEC5__FDCIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 4" name="IEC5__CRPTIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 5" name="IEC5__ETHIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 6" name="IEC5__CRPT1IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
