Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
      <value-group caption="Interrupt Vector 058 Address Offset bits" name="OFF058__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 059 Address Offset bits" name="OFF059__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 060 Address Offset bits" name="OFF060__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 061 Address Offset bits" name="OFF061__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 062 Address Offset bits" name="OFF062__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 063 Address Offset bits" name="OFF063__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 064 Address Offset bits" name="OFF064__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 068 Address Offset bits" name="OFF068__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 069 Address Offset bits" name="OFF069__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 070 Address Offset bits" name="OFF070__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 071 Address Offset bits" name="OFF071__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 072 Address Offset bits" name="OFF072__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 073 Address Offset bits" name="OFF073__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 074 Address Offset bits" name="OFF074__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 075 Address Offset bits" name="OFF075__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 076 Address Offset bits" name="OFF076__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 080 Address Offset bits" name="OFF080__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 083 Address Offset bits" name="OFF083__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 084 Address Offset bits" name="OFF084__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 085 Address Offset bits" name="OFF085__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 086 Address Offset bits" name="OFF086__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 087 Address Offset bits" name="OFF087__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 088 Address Offset bits" name="OFF088__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 089 Address Offset bits" name="OFF089__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
