Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
      <value-group caption="Interrupt Vector 115 Address Offset bits" name="OFF115__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 116 Address Offset bits" name="OFF116__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 117 Address Offset bits" name="OFF117__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 118 Address Offset bits" name="OFF118__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 119 Address Offset bits" name="OFF119__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 120 Address Offset bits" name="OFF120__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 121 Address Offset bits" name="OFF121__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 122 Address Offset bits" name="OFF122__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 123 Address Offset bits" name="OFF123__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 124 Address Offset bits" name="OFF124__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 125 Address Offset bits" name="OFF125__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 126 Address Offset bits" name="OFF126__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 127 Address Offset bits" name="OFF127__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 128 Address Offset bits" name="OFF128__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 129 Address Offset bits" name="OFF129__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 142 Address Offset bits" name="OFF142__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 143 Address Offset bits" name="OFF143__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 144 Address Offset bits" name="OFF144__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 145 Address Offset bits" name="OFF145__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 152 Address Offset bits" name="OFF152__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 153 Address Offset bits" name="OFF153__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 154 Address Offset bits" name="OFF154__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 155 Address Offset bits" name="OFF155__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 156 Address Offset bits" name="OFF156__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 157 Address Offset bits" name="OFF157__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 162 Address Offset bits" name="OFF162__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 163 Address Offset bits" name="OFF163__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 164 Address Offset bits" name="OFF164__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 165 Address Offset bits" name="OFF165__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 166 Address Offset bits" name="OFF166__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 167 Address Offset bits" name="OFF167__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
    </module>
    <module caption="" id="02869" name="JTAG" version="2">
      <register-group name="JTAG">
        <register caption="" name="_ICDCON" offset="0x0" rw="RW" size="4">
          <bitfield mask="0x00000001" name="CKSWBKEN"/>
          <bitfield mask="0x00000002" name="SLPBKEN"/>
          <bitfield mask="0x00000004" name="WDTBKEN"/>
          <bitfield mask="0x00000008" name="WDTEN"/>
          <bitfield mask="0x00000010" name="RSTBUG"/>
          <bitfield mask="0x00000020" name="DMTBKEN"/>
          <bitfield mask="0x00000040" name="DMTEN"/>
          <bitfield mask="0x00004000" name="FRZ"/>
        </register>
        <register caption="" name="_ICDSTAT" offset="0x10" rw="RW" size="4">
          <bitfield mask="0x00000001" name="CKSWBF"/>
          <bitfield mask="0x00000002" name="SLPBF"/>
          <bitfield mask="0x00000004" name="WDTBF"/>
          <bitfield mask="0x00000008" name="DMTBF"/>
          <bitfield mask="0x00000010" name="WDTRUNBF"/>
          <bitfield mask="0x00000020" name="WDTSLPBF"/>
        </register>
      </register-group>
    </module>
    <module caption="" id="01471" name="LVD" version="1">
      <register-group name="LVD">
        <register caption="" name="LVDCON" offset="0x0" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="LVDL"/>
          <bitfield mask="0x00000080" name="DISOUT"/>
          <bitfield mask="0x00000100" name="EVENT"/>
          <bitfield mask="0x00000200" name="IRVST"/>
          <bitfield mask="0x00000400" name="BGVST"/>
          <bitfield mask="0x00000800" name="VDIR"/>
          <bitfield mask="0x00002000" name="SIDL"/>
          <bitfield mask="0x00004000" name="FRZ"/>
          <bitfield mask="0x00008000" name="ON"/>
        </register>
      </register-group>
    </module>
