Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
    <module caption="" id="03140" name="NVM" version="4">
      <register-group name="NVM">
        <register caption="PROGRAMMING CONTROL REGISTER" name="NVMCON" offset="0x0" rw="RW" size="4">
          <bitfield caption=" NVM Operation bits" mask="0x0000000F" name="NVMOP" values="NVMCON__NVMOP"/>
          <bitfield caption="Boot Flash Bank Alias Swap Control bit" mask="0x00000040" name="BFSWAP" values="NVMCON__BFSWAP"/>
          <bitfield caption="Program Flash Bank Swap Control bit" mask="0x00000080" name="PFSWAP" values="NVMCON__PFSWAP"/>
          <bitfield caption="High Temperature Detected during Program/Erase Operation Bit" mask="0x00000100" name="HTDPGM" values="NVMCON__HTDPGM"/>
          <bitfield caption="Low-Voltage Detect Error bit" mask="0x00001000" name="LVDERR" values="NVMCON__LVDERR"/>
          <bitfield caption="Write Error bit" mask="0x00002000" name="WRERR" values="NVMCON__WRERR"/>
          <bitfield caption="Write Enable bit" mask="0x00004000" name="WREN" values="NVMCON__WREN"/>
          <bitfield caption="Write Control bit" mask="0x00008000" name="WR" values="NVMCON__WR"/>
        </register>
        <register caption="PROGRAMMING CONTROL 2 REGISTER" name="NVMCON2" offset="0x10" rw="RW" size="4">
          <bitfield caption="NVM Pre-Program Control Bit" mask="0x00000001" name="PREPG" values="NVMCON2__PREPG"/>
          <bitfield caption="Flash Memory Swap Lock Control bits" mask="0x000000C0" name="SWAPLOCK" values="NVMCON2__SWAPLOCK"/>
          <bitfield mask="0x00000300" name="RETRY"/>
          <bitfield mask="0x00001000" name="VREAD1"/>
          <bitfield mask="0x00002000" name="CREAD1"/>
          <bitfield mask="0x00004000" name="TEMP"/>
          <bitfield mask="0x001F0000" name="WS"/>
          <bitfield mask="0x01000000" name="SLEEP"/>
          <bitfield mask="0xF0000000" name="ERS"/>
        </register>
        <register caption="Programming Unlock Register" name="NVMKEY" offset="0x20" rw="W" size="4">
          <bitfield mask="0xFFFFFFFF" name="NVMKEY"/>
        </register>
        <register caption="Flash Address Register" name="NVMADDR" offset="0x30" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="NVMADDR"/>
        </register>
        <register caption="Flash Data Register (x = 0-3" name="NVMDATA0" offset="0x40" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="NVMDATA0"/>
        </register>
        <register caption="Flash Data Register (x = 0-3" name="NVMDATA1" offset="0x50" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="NVMDATA1"/>
        </register>
        <register caption="Flash Data Register (x = 0-3" name="NVMDATA2" offset="0x60" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="NVMDATA2"/>
        </register>
        <register caption="Flash Data Register (x = 0-3" name="NVMDATA3" offset="0x70" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="NVMDATA3"/>
        </register>
        <register caption="Flash Data Register" name="NVMDATA4" offset="0x80" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="NVMDATA3"/>
        </register>
        <register caption="Flash Data Register" name="NVMDATA5" offset="0x90" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="NVMDATA3"/>
        </register>
        <register caption="Flash Data Register" name="NVMDATA6" offset="0xa0" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="NVMDATA3"/>
        </register>
        <register caption="Flash Data Register" name="NVMDATA7" offset="0xb0" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="NVMDATA3"/>
        </register>
        <register caption="Source Data Address Register" name="NVMSRCADDR" offset="0xc0" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="NVMSRCADDR"/>
        </register>
        <register caption="FLASH PROGRAM WRITE PROTECT (WATERMARK) REGISTER" name="NVMPWPLT" offset="0xd0" rw="RW" size="4">
          <bitfield mask="0x00FFFFFF" name="PWPLT"/>
          <bitfield caption="NVMPWPLT Register Unlock Bit" mask="0x80000000" name="ULOCK" values="NVMPWPLT__ULOCK"/>
        </register>
        <register caption="FLASH PROGRAM WRITE PROTECT" name="NVMPWPGTE" offset="0xe0" rw="RW" size="4">
          <bitfield mask="0x00FFFFFF" name="PWPGTE"/>
          <bitfield caption="Program Flash Memory Page Write-protect Unlock bit" mask="0x80000000" name="ULOCK" values="NVMPWPGTE__ULOCK"/>
        </register>
        <register caption="Program Flash Write-Protect Register" name="NVMLBWP" offset="0xf0" rw="RW" size="4">
          <bitfield mask="0x00000001" name="LBWP0"/>
          <bitfield mask="0x00000002" name="LBWP1"/>
          <bitfield mask="0x00000004" name="LBWP2"/>
          <bitfield mask="0x00000008" name="LBWP3"/>
          <bitfield mask="0x00000010" name="LBWP4"/>
          <bitfield mask="0x00000020" name="LBWP5"/>
          <bitfield mask="0x00000040" name="LBWP6"/>
          <bitfield mask="0x00000080" name="LBWP7"/>
          <bitfield mask="0x00000100" name="LBWP8"/>
          <bitfield mask="0x00000200" name="LBWP9"/>
          <bitfield mask="0x00000400" name="LBWP10"/>
          <bitfield mask="0x00000800" name="LBWP11"/>
          <bitfield mask="0x00001000" name="LBWP12"/>
          <bitfield mask="0x00002000" name="LBWP13"/>
          <bitfield mask="0x00004000" name="LBWP14"/>
          <bitfield mask="0x00008000" name="LBWP15"/>
          <bitfield mask="0x00010000" name="LBWP16"/>
          <bitfield mask="0x00020000" name="LBWP17"/>
          <bitfield mask="0x00040000" name="LBWP18"/>
          <bitfield mask="0x00080000" name="LBWP19"/>
          <bitfield mask="0x00100000" name="LBWP20"/>
          <bitfield mask="0x00200000" name="LBWP21"/>
          <bitfield mask="0x00400000" name="LBWP22"/>
          <bitfield mask="0x00800000" name="LBWP23"/>
          <bitfield mask="0x80000000" name="ULOCK"/>
        </register>
        <register caption="" name="NVMUBWP" offset="0x100" rw="RW" size="4">
          <bitfield mask="0x00000001" name="UBWP0"/>
          <bitfield mask="0x00000002" name="UBWP1"/>
          <bitfield mask="0x00000004" name="UBWP2"/>
          <bitfield mask="0x00000008" name="UBWP3"/>
          <bitfield mask="0x00000010" name="UBWP4"/>
          <bitfield mask="0x00000020" name="UBWP5"/>
          <bitfield mask="0x00000040" name="UBWP6"/>
          <bitfield mask="0x00000080" name="UBWP7"/>
          <bitfield mask="0x00000100" name="UBWP8"/>
          <bitfield mask="0x00000200" name="UBWP9"/>
          <bitfield mask="0x00000400" name="UBWP10"/>
          <bitfield mask="0x00000800" name="UBWP11"/>
          <bitfield mask="0x00001000" name="UBWP12"/>
          <bitfield mask="0x00002000" name="UBWP13"/>
          <bitfield mask="0x00004000" name="UBWP14"/>
          <bitfield mask="0x00008000" name="UBWP15"/>
          <bitfield mask="0x00010000" name="UBWP16"/>
          <bitfield mask="0x00020000" name="UBWP17"/>
          <bitfield mask="0x00040000" name="UBWP18"/>
          <bitfield mask="0x00080000" name="UBWP19"/>
          <bitfield mask="0x00100000" name="UBWP20"/>
          <bitfield mask="0x00200000" name="UBWP21"/>
          <bitfield mask="0x00400000" name="UBWP22"/>
          <bitfield mask="0x00800000" name="UBWP23"/>
          <bitfield mask="0x80000000" name="ULOCK"/>
        </register>
      </register-group>
      <value-group caption=" NVM Operation bits" name="NVMCON__NVMOP">
        <value caption="Reserved" name="" value="0x7"/>
        <value caption="Reserved" name="" value="0x4"/>
        <value caption="Program erase operation: erase all of program Flash memory (all pages must be unprotected" name="" value="0x3"/>
        <value caption="Upper program Flash memory erase operation: erases only the upper mapped region of program Flash (all pages in that region must be unprotected)" name="" value="0x6"/>
        <value caption="Lower program Flash memory erase operation: erases only the lower mapped region of program Flash (all pages in that region must be unprotected)" name="" value="0x5"/>
        <value caption="Page erase operation: erases page selected by NVMADDR" name="" value="0x4"/>
        <value caption="Row program operation: programs row selected by NVMADDR" name="" value="0x3"/>
        <value caption="Quad Word (128-bit) program operation: programs the 128-bit Flash word selected by NVMADDR" name="" value="0x2"/>
        <value caption="Word program operation: programs word selected by NVMADDR" name="" value="0x1"/>
        <value caption="No operation" name="" value="0x0"/>
      </value-group>
