Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
        <register caption="" name="PMUCMODE" offset="0x20" rw="R" size="4">
          <bitfield mask="0x0000001F" name="CVREG4OCTRL"/>
          <bitfield mask="0x00001F00" name="CVREG3OCTRL"/>
          <bitfield mask="0x001F0000" name="CVREG2OCTRL"/>
          <bitfield mask="0x1F000000" name="CVREG1OCTRL"/>
          <bitfield mask="0x20000000" name="CBUCKMODE"/>
          <bitfield mask="0x40000000" name="CMLDOEN"/>
          <bitfield mask="0x80000000" name="CBUCKEN"/>
        </register>
        <register caption="" name="PMUSTATUS" offset="0x24" rw="R" size="4">
          <bitfield mask="0x0000001F" name="STATUS"/>
          <bitfield mask="0x00000020" name="WCMRM"/>
          <bitfield mask="0x00FFFF00" name="BSSEDATA"/>
          <bitfield mask="0x7F000000" name="BSSENUM"/>
          <bitfield mask="0x80000000" name="BSSERR"/>
        </register>
        <register caption="" name="PMUSEQ0" offset="0x28" rw="R" size="4">
          <bitfield mask="0x0000003F" name="DELAY"/>
          <bitfield mask="0x00000040" name="CMPBVAL"/>
          <bitfield mask="0x00000080" name="CMD"/>
          <bitfield mask="0x0000FF00" name="SPIADDR"/>
          <bitfield mask="0xFFFF0000" name="SPIDATA"/>
        </register>
        <register caption="" name="PMUSEQ1" offset="0x2c" rw="R" size="4">
          <bitfield mask="0x0000003F" name="DELAY"/>
          <bitfield mask="0x00000040" name="CMPBVAL"/>
          <bitfield mask="0x00000080" name="CMD"/>
          <bitfield mask="0x0000FF00" name="SPIADDR"/>
          <bitfield mask="0xFFFF0000" name="SPIDATA"/>
        </register>
        <register caption="" name="PMUSEQ2" offset="0x30" rw="R" size="4">
          <bitfield mask="0x0000003F" name="DELAY"/>
          <bitfield mask="0x00000040" name="CMPBVAL"/>
          <bitfield mask="0x00000080" name="CMD"/>
          <bitfield mask="0x0000FF00" name="SPIADDR"/>
          <bitfield mask="0xFFFF0000" name="SPIDATA"/>
        </register>
        <register caption="" name="PMUCFG" offset="0x38" rw="R" size="4">
          <bitfield mask="0x0000003F" name="DELAY"/>
        </register>
        <register caption="" name="PMUWCMCMD" offset="0x3c" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="WCMADDR"/>
          <bitfield mask="0x00070000" name="WCMCLKDIV"/>
          <bitfield mask="0x10000000" name="WCMRDY"/>
          <bitfield mask="0x40000000" name="CMD"/>
          <bitfield mask="0x80000000" name="MODE"/>
        </register>
        <register caption="" name="PMUWCMWDATA" offset="0x40" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="WDATA"/>
        </register>
        <register caption="" name="PMUWCMRDATA" offset="0x44" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="RDATA"/>
        </register>
      </register-group>
    </module>
    <module caption="" id="03337" name="PPS" version="1">
      <register-group name="PPS">
        <register caption="" name="INT0R" offset="0x0" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="INT0R"/>
        </register>
        <register caption="" name="INT1R" offset="0x4" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="INT1R"/>
        </register>
        <register caption="" name="INT2R" offset="0x8" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="INT2R"/>
        </register>
        <register caption="" name="INT3R" offset="0xc" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="INT3R"/>
        </register>
        <register caption="" name="INT4R" offset="0x10" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="INT4R"/>
        </register>
        <register caption="" name="T1CKR" offset="0x14" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="T1CKR"/>
        </register>
        <register caption="" name="T2CKR" offset="0x18" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="T2CKR"/>
        </register>
        <register caption="" name="T3CKR" offset="0x1c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="T3CKR"/>
        </register>
        <register caption="" name="T4CKR" offset="0x20" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="T4CKR"/>
        </register>
        <register caption="" name="T5CKR" offset="0x24" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="T5CKR"/>
        </register>
        <register caption="" name="T6CKR" offset="0x28" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="T6CKR"/>
        </register>
        <register caption="" name="T7CKR" offset="0x2c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="T7CKR"/>
        </register>
        <register caption="" name="IC1R" offset="0x38" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="IC1R"/>
        </register>
        <register caption="" name="IC2R" offset="0x3c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="IC2R"/>
        </register>
        <register caption="" name="IC3R" offset="0x40" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="IC3R"/>
        </register>
        <register caption="" name="IC4R" offset="0x44" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="IC4R"/>
        </register>
        <register caption="" name="OCFAR" offset="0x5c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="OCFAR"/>
        </register>
        <register caption="" name="OCFBR" offset="0x60" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="OCFBR"/>
        </register>
        <register caption="" name="OCFCR" offset="0x64" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="OCFCR"/>
        </register>
        <register caption="" name="OCFDR" offset="0x68" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="OCFDR"/>
        </register>
        <register caption="" name="U1RXR" offset="0x6c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="U1RXR"/>
        </register>
        <register caption="" name="U1CTSR" offset="0x70" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="U1CTSR"/>
        </register>
        <register caption="" name="U2RXR" offset="0x74" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="U2RXR"/>
        </register>
        <register caption="" name="U2CTSR" offset="0x78" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="U2CTSR"/>
        </register>
