Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
        <register caption="" name="U3RXR" offset="0x7c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="U3RXR"/>
        </register>
        <register caption="" name="U3CTSR" offset="0x80" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="U3CTSR"/>
        </register>
        <register caption="" name="PTG30R" offset="0x8c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="PTG30R"/>
        </register>
        <register caption="" name="PTG31R" offset="0x90" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="PTG31R"/>
        </register>
        <register caption="" name="SDI1R" offset="0x98" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="SDI1R"/>
        </register>
        <register caption="" name="SS1INR" offset="0x9c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="SS1INR"/>
        </register>
        <register caption="" name="SDI2R" offset="0xa4" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="SDI2R"/>
        </register>
        <register caption="" name="SS2INR" offset="0xa8" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="SS2INR"/>
        </register>
        <register caption="" name="C1RXR" offset="0xc4" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="C1RXR"/>
        </register>
        <register caption="" name="C2RXR" offset="0xc8" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="C2RXR"/>
        </register>
        <register caption="" name="REFIR" offset="0xcc" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="REFIR"/>
        </register>
        <register caption="" name="ECOLR" offset="0x174" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="ECOLR"/>
        </register>
        <register caption="" name="ECRSR" offset="0x178" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="ECRSR"/>
        </register>
        <register caption="" name="ETXCLKR" offset="0x17c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="ETXCLKR"/>
        </register>
        <register caption="" name="ERXD3R" offset="0x180" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="ERXD3R"/>
        </register>
        <register caption="" name="ERXD2R" offset="0x184" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="ERXD2R"/>
        </register>
        <register caption="" name="RPA0R" offset="0x200" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPA0R"/>
        </register>
        <register caption="" name="RPA1R" offset="0x204" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPA1R"/>
        </register>
        <register caption="" name="RPA2R" offset="0x208" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPA2R"/>
        </register>
        <register caption="" name="RPA3R" offset="0x20c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPA3R"/>
        </register>
        <register caption="" name="RPA4R" offset="0x210" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPA4R"/>
        </register>
        <register caption="" name="RPA5R" offset="0x214" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPA5R"/>
        </register>
        <register caption="" name="RPA10R" offset="0x228" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPA10R"/>
        </register>
        <register caption="" name="RPA11R" offset="0x22c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPA11R"/>
        </register>
        <register caption="" name="RPA12R" offset="0x230" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPA12R"/>
        </register>
        <register caption="" name="RPA13R" offset="0x234" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPA13R"/>
        </register>
        <register caption="" name="RPA14R" offset="0x238" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPA14R"/>
        </register>
        <register caption="" name="RPA15R" offset="0x23c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPA15R"/>
        </register>
        <register caption="" name="RPB0R" offset="0x240" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPB0R"/>
        </register>
        <register caption="" name="RPB1R" offset="0x244" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPB1R"/>
        </register>
        <register caption="" name="RPB2R" offset="0x248" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPB2R"/>
        </register>
        <register caption="" name="RPB3R" offset="0x24c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPB3R"/>
        </register>
        <register caption="" name="RPB4R" offset="0x250" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPB4R"/>
        </register>
        <register caption="" name="RPB5R" offset="0x254" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPB5R"/>
        </register>
        <register caption="" name="RPB6R" offset="0x258" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPB6R"/>
        </register>
        <register caption="" name="RPB7R" offset="0x25c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPB7R"/>
        </register>
        <register caption="" name="RPB8R" offset="0x260" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPB8R"/>
        </register>
        <register caption="" name="RPB9R" offset="0x264" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPB9R"/>
        </register>
        <register caption="" name="RPB10R" offset="0x268" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPB10R"/>
        </register>
        <register caption="" name="RPB11R" offset="0x26c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPB11R"/>
        </register>
        <register caption="" name="RPB12R" offset="0x270" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPB12R"/>
        </register>
        <register caption="" name="RPB13R" offset="0x274" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPB13R"/>
        </register>
        <register caption="" name="RPB14R" offset="0x278" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPB14R"/>
        </register>
        <register caption="" name="RPC0R" offset="0x280" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC0R"/>
        </register>
        <register caption="" name="RPC1R" offset="0x284" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC1R"/>
        </register>
