Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
        <register caption="" name="RPC2R" offset="0x288" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC2R"/>
        </register>
        <register caption="" name="RPC3R" offset="0x28c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC3R"/>
        </register>
        <register caption="" name="RPC4R" offset="0x290" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC4R"/>
        </register>
        <register caption="" name="RPC5R" offset="0x294" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC5R"/>
        </register>
        <register caption="" name="RPC6R" offset="0x298" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC6R"/>
        </register>
        <register caption="" name="RPC7R" offset="0x29c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC7R"/>
        </register>
        <register caption="" name="RPC8R" offset="0x2a0" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC8R"/>
        </register>
        <register caption="" name="RPC9R" offset="0x2a4" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC9R"/>
        </register>
        <register caption="" name="RPC10R" offset="0x2a8" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC10R"/>
        </register>
        <register caption="" name="RPC11R" offset="0x2ac" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC11R"/>
        </register>
        <register caption="" name="RPC12R" offset="0x2b0" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC12R"/>
        </register>
        <register caption="" name="RPC13R" offset="0x2b4" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC13R"/>
        </register>
        <register caption="" name="RPC14R" offset="0x2b8" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC14R"/>
        </register>
        <register caption="" name="RPC15R" offset="0x2bc" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC15R"/>
        </register>
        <register caption="" name="RPK0R" offset="0x2c0" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPK0R"/>
        </register>
        <register caption="" name="RPK1R" offset="0x2c4" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPK1R"/>
        </register>
        <register caption="" name="RPK2R" offset="0x2c8" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPK2R"/>
        </register>
        <register caption="" name="RPK3R" offset="0x2cc" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPK3R"/>
        </register>
        <register caption="" name="RPK4R" offset="0x2d0" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPK4R"/>
        </register>
        <register caption="" name="RPK5R" offset="0x2d4" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPK5R"/>
        </register>
        <register caption="" name="RPK6R" offset="0x2d8" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPK6R"/>
        </register>
        <register caption="" name="RPK7R" offset="0x2dc" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPK7R"/>
        </register>
        <register caption="" name="RPK8R" offset="0x2e0" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPK8R"/>
        </register>
        <register caption="" name="RPK9R" offset="0x2e4" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPK9R"/>
        </register>
        <register caption="" name="RPK10R" offset="0x2e8" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPK10R"/>
        </register>
        <register caption="" name="RPK11R" offset="0x2ec" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPK11R"/>
        </register>
        <register caption="" name="RPK12R" offset="0x2f0" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPK12R"/>
        </register>
        <register caption="" name="RPK13R" offset="0x2f4" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPK13R"/>
        </register>
        <register caption="" name="RPK14R" offset="0x2f8" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPK14R"/>
        </register>
      </register-group>
    </module>
    <module caption="" id="01459" name="PTG" version="">
      <register-group name="PTG">
        <register caption="" name="PTGCON" offset="0x0" rw="RW" size="4">
          <bitfield mask="0x00000003" name="PTGITM"/>
          <bitfield mask="0x00000020" name="PTGBUSY"/>
          <bitfield mask="0x00000040" name="PTGWDTO"/>
          <bitfield mask="0x00000080" name="PTGSTRT"/>
          <bitfield mask="0x00000100" name="PTGIVIS"/>
          <bitfield mask="0x00000200" name="PTGSSEN"/>
          <bitfield mask="0x00000400" name="PTGSWT"/>
          <bitfield mask="0x00000800" name="RESERVED"/>
          <bitfield mask="0x00001000" name="PTGTOGL"/>
          <bitfield mask="0x00002000" name="PTGSIDL"/>
          <bitfield mask="0x00004000" name="PTGFRZ"/>
          <bitfield mask="0x00008000" name="PTGON"/>
          <bitfield mask="0x00070000" name="PTGWDT"/>
          <bitfield mask="0x00F00000" name="PTGPWD"/>
          <bitfield mask="0x1F000000" name="PTGDIV"/>
          <bitfield mask="0xE0000000" name="PTGCLK"/>
        </register>
        <register caption="" name="PTGBTE" offset="0x10" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="PTGBTE"/>
        </register>
        <register caption="" name="PTGHOLD" offset="0x20" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="PTGHOLD"/>
        </register>
        <register caption="" name="PTGT0LIM" offset="0x30" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="PTGT0LIM"/>
        </register>
        <register caption="" name="PTGT1LIM" offset="0x40" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="PTGT1LIM"/>
        </register>
        <register caption="" name="PTGSDLIM" offset="0x50" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="PTGSDLIM"/>
        </register>
        <register caption="" name="PTGC0LIM" offset="0x60" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="PTGC0LIM"/>
        </register>
        <register caption="" name="PTGC1LIM" offset="0x70" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="PTGC1LIM"/>
        </register>
