Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
      <value-group caption="Enable Interrupt Events via SPITUR bit" name="SPI1CON2__SPITUREN">
        <value caption="Transmit Underrun Generates Error Events" name="" value="0x1"/>
        <value caption="Transmit Underrun Does Not Generates Error Events" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Interrupt Events via SPIROV bit" name="SPI1CON2__SPIROVEN">
        <value caption="Receive overflow generates error events" name="" value="0x1"/>
        <value caption="Receive overflow does not generate error events" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Interrupt Events via FRMERR bit" name="SPI1CON2__FRMERREN">
        <value caption="Frame Error overflow generates error events" name="" value="0x1"/>
        <value caption="Frame Error does not generate error events" name="" value="0x0"/>
      </value-group>
      <value-group caption="Sign Extend Read Data from the RX FIFO bit" name="SPI1CON2__SPISGNEXT">
        <value caption="Data from RX FIFO is sign extended" name="" value="0x1"/>
        <value caption="Data from RX FIFO is not sign extened" name="" value="0x0"/>
      </value-group>
      <value-group caption="Audio Protocol Mode bit" name="SPI2CON2__AUDMOD">
        <value caption="PCM/DSP mode" name="" value="0x3"/>
        <value caption="Right Justified mode" name="" value="0x2"/>
        <value caption="Left Justified mode" name="" value="0x1"/>
        <value caption="I2S mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Audio Data Format bit" name="SPI2CON2__AUDMONO">
        <value caption="Audio data is mono (Each data word is transmitted on both left and right channels)" name="" value="0x1"/>
        <value caption="Audio data is stereo" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Audio CODEC Support bit" name="SPI2CON2__AUDEN">
        <value caption="Audio protocol enabled" name="" value="0x1"/>
        <value caption="Audio protocol disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Ignore Transmit Underrun bit" name="SPI2CON2__IGNTUR">
        <value caption="A TUR is not a critical error and zeros are transmitted until the SPIxTXB is not empty" name="" value="0x1"/>
        <value caption="A TUR is a critical error which stop SPI operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Ignore Receive Overflow bit" name="SPI2CON2__IGNROV">
        <value caption="A ROV is not a critical error; during ROV data in the fifo is not overwritten by receive data" name="" value="0x1"/>
        <value caption="A ROV is a critical error which stop SPI operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Interrupt Events via SPITUR bit" name="SPI2CON2__SPITUREN">
        <value caption="Transmit Underrun Generates Error Events" name="" value="0x1"/>
        <value caption="Transmit Underrun Does Not Generates Error Events" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Interrupt Events via SPIROV bit" name="SPI2CON2__SPIROVEN">
        <value caption="Receive overflow generates error events" name="" value="0x1"/>
        <value caption="Receive overflow does not generate error events" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Interrupt Events via FRMERR bit" name="SPI2CON2__FRMERREN">
        <value caption="Frame Error overflow generates error events" name="" value="0x1"/>
        <value caption="Frame Error does not generate error events" name="" value="0x0"/>
      </value-group>
      <value-group caption="Sign Extend Read Data from the RX FIFO bit" name="SPI2CON2__SPISGNEXT">
        <value caption="Data from RX FIFO is sign extended" name="" value="0x1"/>
        <value caption="Data from RX FIFO is not sign extened" name="" value="0x0"/>
      </value-group>
    </module>
    <module caption="" id="00307" name="SQI" version="3">
      <register-group name="SQI">
        <register caption="SQI XIP Control Register 1" name="SQI1XCON1" offset="0x0" rw="RW" size="4">
          <bitfield caption="The boot controller will send the command in Single Lane, Dual Lane, or Quad Lane." mask="0x00000003" name="TYPECMD" values="SQI1XCON1__TYPECMD"/>
          <bitfield caption="The boot controller will send the address in Single Lane, Dual Lane, or Quad Lane." mask="0x0000000C" name="TYPEADDR" values="SQI1XCON1__TYPEADDR"/>
          <bitfield caption="The boot controller will send the mode in Single Lane, Dual Lane, or Quad Lane." mask="0x00000030" name="TYPEMODE" values="SQI1XCON1__TYPEMODE"/>
          <bitfield caption="The boot controller will send the dummy in Single Lange, Dual Lane, or Quad Lane" mask="0x000000C0" name="TYPEDUMMY" values="SQI1XCON1__TYPEDUMMY"/>
          <bitfield caption="The boot controller will receive the data in Single Lane, Dual Lane, or Quad Lane." mask="0x00000300" name="TYPEDATA" values="SQI1XCON1__TYPEDATA"/>
          <bitfield mask="0x0003FC00" name="READOPCODE"/>
          <bitfield caption="" mask="0x001C0000" name="ADDRBYTES" values="SQI1XCON1__ADDRBYTES"/>
          <bitfield caption="Transmit Dummy Bytes bits" mask="0x00E00000" name="DUMMYBYTES" values="SQI1XCON1__DUMMYBYTES"/>
          <bitfield caption="SQI DDR Command Mode bit" mask="0x01000000" name="DDRCMD" values="SQI1XCON1__DDRCMD"/>
          <bitfield caption="SQI Address Mode bit" mask="0x02000000" name="DDRADDR" values="SQI1XCON1__DDRADDR"/>
          <bitfield caption="SQI DDR Mode bit" mask="0x04000000" name="DDRMODE" values="SQI1XCON1__DDRMODE"/>
          <bitfield caption="SQI Dummy DDR Mode bit" mask="0x08000000" name="DDRDUMMY" values="SQI1XCON1__DDRDUMMY"/>
          <bitfield caption="SQI Data DDR Mode bit" mask="0x10000000" name="DDRDATA" values="SQI1XCON1__DDRDATA"/>
          <bitfield caption="SQI Command in SDR Mode bit" mask="0x20000000" name="SDRCMD" values="SQI1XCON1__SDRCMD"/>
        </register>
