Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
        <register caption="" name="U3TXREG" offset="0x20" rw="RW" size="4">
          <bitfield mask="0x000001FF" name="U3TXREG"/>
        </register>
        <register caption="" name="U1TXREG" offset="0x3F020" rw="RW" size="4">
          <bitfield mask="0x000001FF" name="U1TXREG"/>
        </register>
        <register caption="" name="U2TXREG" offset="0x3F220" rw="RW" size="4">
          <bitfield mask="0x000001FF" name="U2TXREG"/>
        </register>
        <register caption="" name="U3RXREG" offset="0x30" rw="R" size="4">
          <bitfield mask="0x000001FF" name="U3RXREG"/>
        </register>
        <register caption="" name="U1RXREG" offset="0x3F030" rw="R" size="4">
          <bitfield mask="0x000001FF" name="U1RXREG"/>
        </register>
        <register caption="" name="U2RXREG" offset="0x3F230" rw="R" size="4">
          <bitfield mask="0x000001FF" name="U2RXREG"/>
        </register>
        <register caption="" name="U3BRG" offset="0x40" rw="RW" size="4">
          <bitfield caption="Baud Rate Generator" mask="0x000FFFFF" name="BRG" values="U3BRG__BRG"/>
        </register>
        <register caption="" name="U1BRG" offset="0x3F040" rw="RW" size="4">
          <bitfield caption="Baud Rate Generator" mask="0x000FFFFF" name="BRG" values="U1BRG__BRG"/>
        </register>
        <register caption="" name="U2BRG" offset="0x3F240" rw="RW" size="4">
          <bitfield caption="Baud Rate Generator" mask="0x000FFFFF" name="BRG" values="U2BRG__BRG"/>
        </register>
      </register-group>
      <value-group caption="Stop Selection bit" name="U3MODE__STSEL">
        <value caption="2 Stop bits" name="" value="0x1"/>
        <value caption="1 Stop bit" name="" value="0x0"/>
      </value-group>
      <value-group caption="Parity and Data Selection bits" name="U3MODE__PDSEL">
        <value caption="9-bit data, no parity" name="" value="0x3"/>
        <value caption="8-bit data, odd parity" name="" value="0x2"/>
        <value caption="8-bit data, even parity" name="" value="0x1"/>
        <value caption="8-bit data, no parity" name="" value="0x0"/>
      </value-group>
      <value-group caption="High Baud Rate Enable bit" name="U3MODE__BRGH">
        <value caption="High-Speed mode 4x baud clock enabled" name="" value="0x1"/>
        <value caption="Standard Speed mode 16x baud clock enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Polarity Inversion bit" name="U3MODE__RXINV">
        <value caption="UxRX Idle state is 0" name="" value="0x1"/>
        <value caption="UxRX Idle state is 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Auto-Baud Enable bit" name="U3MODE__ABAUD">
        <value caption="Enable baud rate measurement on the next character requires reception of Sync character (0x55); cleared by hardware upon completion" name="" value="0x1"/>
        <value caption="Baud rate measurement disabled or completed" name="" value="0x0"/>
      </value-group>
      <value-group caption="UARTx Loopback Mode Select bit" name="U3MODE__LPBACK">
        <value caption="Loopback mode is enabled" name="" value="0x1"/>
        <value caption="Loopback mode is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" name="U3MODE__WAKE">
        <value caption="Wake-up enabled" name="" value="0x1"/>
        <value caption="Wake-up disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="UARTx Module Enable bits" name="U3MODE__UEN">
        <value caption="UxTX, UxRX and UxBCLK pins are enabled and used" name="" value="0x3"/>
        <value caption="UxTX, UxRX, UxCTS and UxRTS pins are enabled and used" name="" value="0x2"/>
        <value caption="UxTX, UxRX and UxRTS pins are enabled and used; UxCTS pin is controlled by corresponding bits in the PORTx register" name="" value="0x1"/>
        <value caption="UxTX and UxRX pins are enabled and used; UxCTS and UxRTS/UxBCLK pins are controlled by corresponding bits in the PORTx register" name="" value="0x0"/>
      </value-group>
      <value-group caption="Mode Selection for UxRTS Pin bit" name="U3MODE__RTSMD">
        <value caption="UxRTS pin is in Simplex mode" name="" value="0x1"/>
        <value caption="UxRTS pin is in Flow Control mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="IrDA  Encoder and Decoder Enable bit" name="U3MODE__IREN">
        <value caption="IrDA is enabled" name="" value="0x1"/>
        <value caption="IrDA is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="U3MODE__SIDL">
        <value caption="Discontinue operation when device enters Idle mode" name="" value="0x1"/>
        <value caption="Continue operation in Idle mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="UARTx Enable bit" name="U3MODE__ON">
        <value caption="UARTx module is enabled. UARTx pins are controlled by UARTx as defined by UEN and UTXEN control bits" name="" value="0x1"/>
        <value caption="UARTx module is disabled. All UARTx pins are controlled by corresponding bits in the PORTx, TRISx, and LATx registers; UARTx power consumption is minimal" name="" value="0x0"/>
      </value-group>
      <value-group caption="Run During Overflow Condition Mode bit" name="U3MODE__RUNOVF">
        <value caption="When an Overflow Error (OERR) condition is detected, the shift register continues to run to remain synchronized" name="" value="0x2"/>
        <value caption="When an Overflow Error (OERR) condition is detected, the shift register stops accepting new data (Legacy mode)" name="" value="0x0"/>
      </value-group>
      <value-group caption="UARTx Module Clock Selection bits" name="U3MODE__CLKSEL">
        <value caption="BRG clock is REFCLK1" name="" value="0x3"/>
        <value caption="BRG clock is FRC" name="" value="0x2"/>
        <value caption="BRG clock is SYSCLK" name="" value="0x1"/>
        <value caption="BRG clock is PBCLK1" name="" value="0x0"/>
      </value-group>
      <value-group caption="UARTx Module Running Status bit" name="U3MODE__ACTIVE">
        <value caption="UARTx module is active (UxMODE register should not be updated)" name="" value="0x8"/>
        <value caption="UARTx module is not active (UxMODE register can be updated)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Run During Sleep Enable bit" name="U3MODE__SLPEN">
        <value caption="UARTx BRG clock runs during Sleep mode" name="" value="0x1"/>
        <value caption="UARTx BRG clock is turned off during Sleep mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop Selection bit" name="U1MODE__STSEL">
        <value caption="2 Stop bits" name="" value="0x1"/>
        <value caption="1 Stop bit" name="" value="0x0"/>
      </value-group>
      <value-group caption="Parity and Data Selection bits" name="U1MODE__PDSEL">
        <value caption="9-bit data, no parity" name="" value="0x3"/>
        <value caption="8-bit data, odd parity" name="" value="0x2"/>
        <value caption="8-bit data, even parity" name="" value="0x1"/>
        <value caption="8-bit data, no parity" name="" value="0x0"/>
      </value-group>
      <value-group caption="High Baud Rate Enable bit" name="U1MODE__BRGH">
        <value caption="High-Speed mode 4x baud clock enabled" name="" value="0x1"/>
        <value caption="Standard Speed mode 16x baud clock enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Polarity Inversion bit" name="U1MODE__RXINV">
        <value caption="UxRX Idle state is 0" name="" value="0x1"/>
        <value caption="UxRX Idle state is 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Auto-Baud Enable bit" name="U1MODE__ABAUD">
        <value caption="Enable baud rate measurement on the next character requires reception of Sync character (0x55); cleared by hardware upon completion" name="" value="0x1"/>
        <value caption="Baud rate measurement disabled or completed" name="" value="0x0"/>
      </value-group>
      <value-group caption="UARTx Loopback Mode Select bit" name="U1MODE__LPBACK">
        <value caption="Loopback mode is enabled" name="" value="0x1"/>
        <value caption="Loopback mode is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" name="U1MODE__WAKE">
        <value caption="Wake-up enabled" name="" value="0x1"/>
        <value caption="Wake-up disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="UARTx Module Enable bits" name="U1MODE__UEN">
        <value caption="UxTX, UxRX and UxBCLK pins are enabled and used" name="" value="0x3"/>
        <value caption="UxTX, UxRX, UxCTS and UxRTS pins are enabled and used" name="" value="0x2"/>
        <value caption="UxTX, UxRX and UxRTS pins are enabled and used; UxCTS pin is controlled by corresponding bits in the PORTx register" name="" value="0x1"/>
        <value caption="UxTX and UxRX pins are enabled and used; UxCTS and UxRTS/UxBCLK pins are controlled by corresponding bits in the PORTx register" name="" value="0x0"/>
      </value-group>
      <value-group caption="Mode Selection for UxRTS Pin bit" name="U1MODE__RTSMD">
        <value caption="UxRTS pin is in Simplex mode" name="" value="0x1"/>
        <value caption="UxRTS pin is in Flow Control mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="IrDA  Encoder and Decoder Enable bit" name="U1MODE__IREN">
        <value caption="IrDA is enabled" name="" value="0x1"/>
        <value caption="IrDA is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="U1MODE__SIDL">
        <value caption="Discontinue operation when device enters Idle mode" name="" value="0x1"/>
        <value caption="Continue operation in Idle mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="UARTx Enable bit" name="U1MODE__ON">
        <value caption="UARTx module is enabled. UARTx pins are controlled by UARTx as defined by UEN and UTXEN control bits" name="" value="0x1"/>
        <value caption="UARTx module is disabled. All UARTx pins are controlled by corresponding bits in the PORTx, TRISx, and LATx registers; UARTx power consumption is minimal" name="" value="0x0"/>
      </value-group>
      <value-group caption="Run During Overflow Condition Mode bit" name="U1MODE__RUNOVF">
        <value caption="When an Overflow Error (OERR) condition is detected, the shift register continues to run to remain synchronized" name="" value="0x2"/>
        <value caption="When an Overflow Error (OERR) condition is detected, the shift register stops accepting new data (Legacy mode)" name="" value="0x0"/>
      </value-group>
