Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/atdf/WFI32E01.atdf
        <register caption="USB SOF Threshold Register (x = 1 and 2)" name="U1SOF" offset="0x2b0" rw="RW" size="4">
          <bitfield caption="SOF Threshold Value bits" mask="0x000000FF" name="CNT" values="U1SOF__CNT"/>
        </register>
        <register caption="USB BDT PAGE 2 Register (x = 1 and 2)" name="U1BDTP2" offset="0x2c0" rw="RW" size="4">
          <bitfield mask="0x000000FF" name="BDTPTRH"/>
        </register>
        <register caption="USB BDT PAGE 3 Register (x = 1 and 2)" name="U1BDTP3" offset="0x2d0" rw="RW" size="4">
          <bitfield mask="0x000000FF" name="BDTPTRU"/>
        </register>
        <register caption="USB Configuration 1 Register (x = 1 and 2)" name="U1CNFG1" offset="0x2e0" rw="RW" size="4">
          <bitfield caption="Automatic Suspend Enable bit" mask="0x00000001" name="UASUSPND" values="U1CNFG1__UASUSPND"/>
          <bitfield caption="Low-Speed Device Enable bit" mask="0x00000008" name="LSDEV" values="U1CNFG1__LSDEV"/>
          <bitfield caption="Stop in Idle Mode bit" mask="0x00000010" name="USBSIDL" values="U1CNFG1__USBSIDL"/>
          <bitfield caption="USB" mask="0x00000040" name="UOEMON" values="U1CNFG1__UOEMON"/>
          <bitfield caption="USB Eye-Pattern Test Enable bit" mask="0x00000080" name="UTEYE" values="U1CNFG1__UTEYE"/>
        </register>
        <register caption="USB Endpoint Control Register 0" name="U1EP0" offset="0x300" rw="RW" size="4">
          <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP0__EPHSHK"/>
          <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP0__EPSTALL"/>
          <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP0__EPTXEN"/>
          <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP0__EPRXEN"/>
          <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP0__EPCONDIS"/>
          <bitfield caption="Retry Disable bit" mask="0x00000040" name="RETRYDIS" values="U1EP0__RETRYDIS"/>
          <bitfield caption="Low-Speed Direct Connection Enable bit" mask="0x00000080" name="LSPD" values="U1EP0__LSPD"/>
        </register>
        <register caption="USB Endpoint Control Register 1" name="U1EP1" offset="0x310" rw="RW" size="4">
          <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP1__EPHSHK"/>
          <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP1__EPSTALL"/>
          <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP1__EPTXEN"/>
          <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP1__EPRXEN"/>
          <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP1__EPCONDIS"/>
        </register>
        <register caption="USB Endpoint Control Register 2" name="U1EP2" offset="0x320" rw="RW" size="4">
          <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP2__EPHSHK"/>
          <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP2__EPSTALL"/>
          <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP2__EPTXEN"/>
          <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP2__EPRXEN"/>
          <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP2__EPCONDIS"/>
        </register>
        <register caption="USB Endpoint Control Register 3" name="U1EP3" offset="0x330" rw="RW" size="4">
          <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP3__EPHSHK"/>
          <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP3__EPSTALL"/>
          <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP3__EPTXEN"/>
          <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP3__EPRXEN"/>
          <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP3__EPCONDIS"/>
        </register>
        <register caption="USB Endpoint Control Register 4" name="U1EP4" offset="0x340" rw="RW" size="4">
          <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP4__EPHSHK"/>
          <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP4__EPSTALL"/>
          <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP4__EPTXEN"/>
          <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP4__EPRXEN"/>
          <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP4__EPCONDIS"/>
        </register>
        <register caption="USB Endpoint Control Register 5" name="U1EP5" offset="0x350" rw="RW" size="4">
          <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP5__EPHSHK"/>
          <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP5__EPSTALL"/>
          <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP5__EPTXEN"/>
          <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP5__EPRXEN"/>
          <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP5__EPCONDIS"/>
        </register>
        <register caption="USB Endpoint Control Register 6" name="U1EP6" offset="0x360" rw="RW" size="4">
          <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP6__EPHSHK"/>
          <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP6__EPSTALL"/>
          <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP6__EPTXEN"/>
          <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP6__EPRXEN"/>
          <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP6__EPCONDIS"/>
        </register>
        <register caption="USB Endpoint Control Register 7" name="U1EP7" offset="0x370" rw="RW" size="4">
          <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP7__EPHSHK"/>
          <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP7__EPSTALL"/>
          <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP7__EPTXEN"/>
          <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP7__EPRXEN"/>
          <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP7__EPCONDIS"/>
        </register>
        <register caption="USB Endpoint Control Register 8" name="U1EP8" offset="0x380" rw="RW" size="4">
          <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP8__EPHSHK"/>
          <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP8__EPSTALL"/>
          <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP8__EPTXEN"/>
          <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP8__EPRXEN"/>
          <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP8__EPCONDIS"/>
        </register>
